(function e(t,n,r){function s(o,u){if(!n[o]){if(!t[o]){var a=typeof require=="function"&&require;if(!u&&a)return a(o,!0);if(i)return i(o,!0);var f=new Error("Cannot find module '"+o+"'");throw f.code="MODULE_NOT_FOUND",f}var l=n[o]={exports:{}};t[o][0].call(l.exports,function(e){var n=t[o][1][e];return s(n?n:e)},l,l.exports,e,t,n,r)}return n[o].exports}var i=typeof require=="function"&&require;for(var o=0;o<r.length;o++)s(r[o]);return s})({"D:\\ksana2015\\jiangkangyurtoc\\index.js":[function(require,module,exports){
var React=require("react");
if(window.location.origin.indexOf("//127.0.0.1")>-1) {
	require("ksana2015-webruntime/livereload")(); 
}
var ksanagap=require("ksana2015-webruntime/ksanagap");
ksanagap.boot("jiangkangyurtoc",function(){
	var Main=React.createElement(require("./src/main.jsx"));
	ksana.mainComponent=React.render(Main,document.getElementById("main"));
});
},{"./src/main.jsx":"D:\\ksana2015\\jiangkangyurtoc\\src\\main.jsx","ksana2015-webruntime/ksanagap":"D:\\ksana2015\\node_modules\\ksana2015-webruntime\\ksanagap.js","ksana2015-webruntime/livereload":"D:\\ksana2015\\node_modules\\ksana2015-webruntime\\livereload.js","react":"react"}],"D:\\ksana2015\\jiangkangyurtoc\\src\\main.jsx":[function(require,module,exports){
var React=require("react");
var E=React.creatElement;
var TreeToc=require("ksana2015-treetoc").Component;
var tocdata=require("./toclist2.json");
var maincomponent = React.createClass({displayName: "maincomponent",
  render: function() {
    return React.createElement("div", null, 
    React.createElement(TreeToc, {toc: tocdata})
    );
  }
});
module.exports=maincomponent;
},{"./toclist2.json":"D:\\ksana2015\\jiangkangyurtoc\\src\\toclist2.json","ksana2015-treetoc":"D:\\ksana2015\\node_modules\\ksana2015-treetoc\\index.js","react":"react"}],"D:\\ksana2015\\jiangkangyurtoc\\src\\toclist2.json":[function(require,module,exports){
module.exports=[
{d:0,t:"目錄"}
,{d:1,t:"འདུལ་བ་གཞི། ༼ཀ༽"}
,{d:2,t:"རབ་ཏུ་འབྱུང་བའི་གཞི་འཆད་པ།"}
,{d:3,t:"ཤཱ་རིའི་བུའི་སྡེ་ཚན།"}
,{d:3,t:"མུ་སྟེགས་ཅན་གྱི་སྡེ་ཚན།"}
,{d:3,t:"དགེ་ཚུལ་གཉིས་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"བྱ་རོག་སྐྲོད་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"དགྲ་བཅོམ་བསད་པའི་སྡེ་ཚན།"}
,{d:3,t:"ལག་རྡུམ་གྱི་སྡེ་ཚན།"}
,{d:2,t:"གསོ་སྦྱོང་གི་གཞི་འཆད་པ།"}
,{d:3,t:"མུ་སྟེགས་ཅན་གྱི་སྡེ་ཚན།"}
,{d:3,t:"ཀ་བི་ནའི་སྡེ་ཚན།"}
,{d:3,t:"གནས་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"རྒྱལ་པོའི་སྡེ་ཚན།"}
,{d:3,t:"སྦྱར་བ་མང་པོའི་སྡེ་ཚན།"}
,{d:2,t:"དགག་དབྱེའི་གཞི་འཆད་པ།"}
,{d:3,t:"དགག་དབྱེའི་སྡེ་ཚན།"}
,{d:3,t:"ཆོས་མིན་གྱི་སྡེ་ཚན།"}
,{d:3,t:"དགེ་སློང་གི་སྡེ་ཚན།"}
,{d:3,t:"ཟློས་པའི་སྡེ་ཚན།"}
,{d:3,t:"དབྱར་གྱི་སྡེ་ཚན།"}
,{d:2,t:"དབྱར་གནས་ཀྱི་གཞི་འཆད་པ།"}
,{d:3,t:"དབྱར་གནས་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"ཟས་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"དབྱར་རལ་བའི་སྡེ་ཚན།"}
,{d:2,t:"ཀོ་ལྤགས་ཀྱི་གཞི་འཆད་པ།"}
,{d:3,t:"ལྔས་ནི་བསྙེན་པར་རྫོགས་པ་དང་ཞེས་པའི་སྡེ་ཚན།"}
,{d:3,t:"གནས་མལ་ཆེ་བའི་སྡེ་ཚན།"}
,{d:3,t:"བེའུའི་སྡེ་ཚན།"}
,{d:3,t:"བཞོན་པའི་སྡེ་ཚན།"}
,{d:3,t:"ཁྲུས་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"བའི་མཇུག་མའི་སྡེ་ཚན།"}
,{d:3,t:"ཤིང་ལྷམ་རི་མོ་ཅན་གྱི་སྡེ་ཚན།"}
,{d:3,t:"སྨྱུག་མའི་ལོ་མ་སོགས་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"མགུལ་ཆད་སོགས་ཀྱི་སྡེ་ཚན།"}
,{d:2,t:"སྨན་གྱི་གཞི་འཆད་པ།༼ཀ༽"}
,{d:3,t:"སྨན་གྱི་སྡེ་ཚན།"}
,{d:3,t:"སྡེ་ཆེན་གྱི་སྡེ་ཚན།"}
,{d:1,t:"འདུལ་བ་གཞི། ༼ཁ༽ "}
,{d:2,t:"སྨན་གྱི་གཞི་འཆད་པ། ༼ཁ༽"}
,{d:3,t:"བདེ་ཆེན་གྱི་སྡེ་ཚན།"}
,{d:3,t:"རྒྱལ་པོའི་ཁབ་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"འོད་མའི་ཚལ་གྱི་སྡེ་ཚན།"}
,{d:3,t:"ཤིང་མཁན་གྱི་སྡེ་ཚན།"}
,{d:3,t:"ཡིད་ཙ་ནང་ག་ལའི་སྡེ་ཚན།"}
,{d:3,t:"ཀམ་པི་ལའི་སྡེ་ཚན།"}
,{d:3,t:"སྔོན་རྒྱལ་པོའི་སྡེ་ཚན།"}
,{d:3,t:"གཞོན་ནུ་བསྐྱེད་སོགས་ཀྱི་སྣེ་ཚན།"}
,{d:4,t:"ང་ལས་ནུའི་སྡེ་ཚན།"}
,{d:4,t:"ལེགས་མཐོང་ཆེན་པོའི་སྡེ་ཚན།"}
,{d:4,t:"དུས་དཔོག་གི་སྡེ་ཚན།"}
,{d:4,t:"ཀུ་ཤུའི་སྔེ་ཚན"}
,{d:4,t:"གདོལ་པའི་སྡེ་ཚན།"}
,{d:4,t:"ལྷ་ཆེན་པོའི་སྡེ་ཚན།"}
,{d:4,t:"རྒྱལ་པོ་མུ་ཁྱུད་ཀྱི་སྡེ་ཚན།"}
,{d:4,t:"མེ་ལོང་གདོང་གི་སྡེ་ཚན།"}
,{d:4,t:"ནོར་བཟང་གི་སྡེ་ཚན།"}
,{d:4,t:"ཐམས་ཅད་སྒྲོལ་གྱི་སྡེ་ཚན།"}
,{d:4,t:"འདུམ་བྱེད་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"ནད་པའི་སྡེ་ཚན།"}
,{d:3,t:"གཏམ་དུ་གྱུར་པའི་སྡེ་ཚན། (སྟོད)"}
,{d:4,t:"གླང་ཆེན་མཆེ་པ་དྲུག་ལྡན་སོགས་བསྟན་པ།"}
,{d:4,t:"སང་ས་རྒྱས་མང་པོའི་སྐབས་བསྟན་པ།"}
,{d:4,t:"སང་ས་རྒྱས་ཀྱི་མཚན་རྣམས་པསྟན་པ།"}
,{d:4,t:"ཤཱ་རིའི་བུ་དང་མོོད་གལ་གྱི་བུའི་ལེའུ།"}
,{d:4,t:"དང་པོ། འོད་སྲུང་གི་ལེའུ།"}
,{d:4,t:"གཉིས་པ། ཤཱ་རིའི་བུའི་ལེའུ།"}
,{d:4,t:"གསུམ་པ། པང་ནས་སྐྱེས་ཀྱི་ལེའུ།"}
,{d:4,t:"བཞི་པ། མཛེས་ལྡན་གྱི་ལེའུ།"}
,{d:4,t:"ལྔ་པ། སྣ་མའི་མེ་ཏོག་གི་ལེའུ།"}
,{d:4,t:"དྲུག་པ། བྱེ་བ་ཉི་ཤུ་པའི་ལེའུ།"}
,{d:4,t:"བདུན་པ། ངག་ད་བང་གི་ལེའུ།"}
,{d:4,t:"བརྒྱད་པ། བྷ་ར་དྷྭ་ཛ་བསོད་སྟོམས་ལེན་གྱི་ལེའུ།"}
,{d:4,t:"དགུ་པ། ལེགས་འོངས་ཀྱི་ལེའུ།"}
,{d:4,t:"བཅུ་པ། མ་འགགས་པའི་གྲོགས་པོ་དགའ་ཡོད་ཀྱི་ལེའུ།"}
,{d:4,t:"བཅུ་གཅིག་པ། གནས་བརྟན་གྲགས་པའི་ལེའུ།"}
,{d:4,t:"བཅུ་གཉིས་པ། དཔལ་སྐྱེད་ཀྱི་ལེའུ།"}
,{d:4,t:"བཅུ་གསུམ་པ། བ་ཀྐུ་ལའི་ལེའུ།"}
,{d:4,t:"བཅུ་བཞི་པ། གནས་བརྟན་གནས་བརྟན་ཞེས་པའི་ལེའུ།"}
,{d:4,t:"བཅུ་ལྔ་པ། ག་ཡཱ་འོད་སྲུང་རྣམས་ཀྱི་ལེའུ།"}
,{d:4,t:"བཅུ་དྲུག་པ། གནས་བརྟན་གྲགས་པའི་ལེའུ།"}
,{d:4,t:"བཅུ་བདུན་པ། མེ་སྐྱེས་ཀྱི་ལེའུ།"}
,{d:4,t:"བཅུ་བརྒྱད་པ། ཡུལ་འཁོར་སྐྱོང་གི་ལེའུ།"}
,{d:4,t:"བཅུ་དགུ་པ། ས་གའི་ལེའུ།"}
,{d:4,t:"ཉི་ཤུ་པ། འོད་སུང་བྱིན་པ་ཅན་གྱི་ལེའུ།"}
,{d:4,t:"ཉི་ཤུ་རྩ་གཅིག་པ། ལམ་ཕྲན་བསྟན་གྱི་ལེའུ།"}
,{d:4,t:"ཉི་ཤུ་རྩ་གཉིས་པ། སྤྲུལ་ཁོལ་གྱི་ལེའུ།"}
,{d:4,t:"ཉི་ཤུ་རྩ་གསུམ་པ། མ་འགགས་པའི་ལེའུ།"}
,{d:4,t:"ཉི་ཤུ་རྩ་བཞི་པ། རི་དྭགས་འཛིན་གྱི་བུ་ནག་པོའི་ལེའུ།"}
,{d:4,t:"ཉི་ཤུ་རྩ་ལྔ་པ། སྒྲ་ཅན་ཟིན་གྱི་ལེའུ།"}
,{d:4,t:"ཉི་ཤུ་རྩ་དྲུག་པ། དགའ་བོའི་ལེའུ།"}
,{d:4,t:"ཉི་ཤུ་རྩ་བདུན་པ། གྱད་བུ་ནོར་གྱི་ལེའུ།"}
,{d:4,t:"ཉི་ཤུ་རྩ་བརྒྱད་པ། ཉེ་སྡེའི་ལེའུ།"}
,{d:4,t:"ཉི་ཤུ་རྩ་དགུ་པ། ཤཱཀྱའི་རྒྱལ་པོ་བཟང་ལྡན་གྱི་ལེའུ།"}
,{d:4,t:"སུམ་ཅུ་པ། མཛེས་བཟང་གི་ལེའུ།"}
,{d:4,t:"སུམ་ཅུ་རྩ་གཅིག་པ། གནས་འཇོག་སྦྲང་རྩི་ཅན་གྱི་ལེའུ།"}
,{d:4,t:"སུམ་ཅུ་རྩ་གཉིས་པ། གནས་བརྟན་རྒྱུ་ཅན་གྱི་ལེའུ།"}
,{d:4,t:"སུམ་ཅུ་རྩ་གསུམ་པ། ཀོོཎྚི་ནྱའི་ལེའུ།"}
,{d:4,t:"སུམ་ཅུ་རྩ་བཞི་པ། ཉེ་བ་འཁོར་གྱི་ལེའུ།"}
,{d:4,t:"སུམ་ཅུ་རྩ་ལྔ་པ། འོད་བྲེད་ཀྱི་ལེའུ།"}
,{d:4,t:"སུམ་ཅུ་རྩ་དྲུག་པ། ནམ་གྲུའི་ལེའུ།"}
,{d:4,t:"སུམ་ཅུ་རྩ་བདུན་པ། དེ་བཞིན་གཤེགས་པའི་ལེའུ(སྟོད)"}
,{d:1,t:"འདུལ་བ་གཞི། ༼ག༽"}
,{d:2,t:"སྨན་གྱི་གཞི་འཆད་པ། ༼ག༽"}
,{d:3,t:"གཏམ་དུ་གྱུར་པའི་སྡེ་ཚན། (སྨད)"}
,{d:4,t:"སུམ་བཅུ་སོ་བདུན་པ། དེ་བཞིན་གཤེགས་པའི་ལེའུ།(སྨད)"}
,{d:4,t:"ནོར་ཅན་སོགས་བསྟན་པ།"}
,{d:3,t:"སྡེའི་སྡེ་ཚན།"}
,{d:4,t:"ནད་བུ་ཅན་སོགས་བསྟན་པ།"}
,{d:4,t:"ཀེ་ནའི་བུ་ཡིས་བཏུང་བ་བླངས་པ་བསྟན་པ།"}
,{d:4,t:"ཀ་ཤིའི་ཚོང་རྡལ་ནས་ནས་ཐུག་བླངས་པ་སོགས་བསྟན་པ།"}
,{d:2,t:"གོས་ཀྱི་གཞི་འཆད་པ།"}
,{d:3,t:"འཚོ་བྱེད་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"གསོ་རས་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"ཁ་ཚར་རིང་པོའི་སྡེ་ཚན།"}
,{d:3,t:"དབྱར་རལ་བར་ནི་རིག་བྱ་དང་ཞེས་པའི་སྡེ་ཚན།"}
,{d:3,t:"ཤི་བའི་དུས་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"ཉེ་དགའི་སྡེ་ཚན།"}
,{d:3,t:"ནད་པའི་སྡེ་ཚན།"}
,{d:2,t:"སྲ་བརྐྱང་གི་གཞི་འཆད་པ།"}
,{d:3,t:"གནས་བཅས་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"རྡོལ་པའི་སྡེ་ཚན།"}
,{d:3,t:"བླིངས་པའི་སྡེ་ཚན།"}
,{d:3,t:"དུས་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"གང་ཟག་མ་མོའི་གཞིའི་སྡེ་ཚན།"}
,{d:3,t:"ཉི་ཤུའི་སྡེ་ཚན།"}
,{d:3,t:"བཅུ་གཉིས་ཀྱི་སྡེ་ཚན།"}
,{d:2,t:"ཀཽ་ཤྭམྦཱིའི་གཞི་འཆད་པ།"}
,{d:2,t:"ལས་ཀྱི་གཞི་འཆད་པ།"}
,{d:2,t:"དམར་སེར་ཅན་གྱི་གཞི་འཆད་པ།"}
,{d:3,t:"དམར་སེར་ཅན་གྱི་ལྡེ་ཚན"}
,{d:3,t:"ལེགས་ལྡན་གྱི་སྡེ་ཚན།"}
,{d:3,t:"འགྲོ་མགྱོགས་དང་ནབ་སོའི་སྡེ་ཚན།"}
,{d:3,t:"ཆུ་སྟོད་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"འདུན་པའི་སྡེ་ཚན།"}
,{d:3,t:"འཆི་ལྟས་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"འཆར་ཀའི་སྡེ་ཚན།"}
,{d:2,t:"གང་ཟག་གི་གཞི་འཆད་པ།"}
,{d:3,t:"འཆར་ཀའི་སྡེ་ཚན།"}
,{d:3,t:"བཏུས་པའི་སྡེ་ཚན།"}
,{d:3,t:"མཐའི་སྡེ་ཚན།"}
,{d:3,t:"གཞན་གྱིས་དང་ཞེས་པའི་སྡེ་ཚན།"}
,{d:2,t:"སྤོ་བའི་གཞི་འཆད་པ།"}
,{d:2,t:"གསོ་སྦྱོང་བཞག་པའི་གཞི་འཆད་པ།"}
,{d:2,t:"གནས་མལ་གྱི་གཞི་འཆད་པ།"}
,{d:2,t:"རྩོད་པའི་གཞི་འཆད་པ།"}
,{d:2,t:"དགེ་འདུན་དབྱེན་གྱི་གཞི་འཆད་པ། (སྟོད)"}
,{d:3,t:"མང་པོས་བཀུར་བ་ལ་སོགས་པའི་སྡེ་ཚན་།(སྟོད)"}
,{d:1,t:"འདུལ་བ་གཞི། ༼ང༽"}
,{d:2,t:"དགེ་འདུན་དབྱེན་གྱི་གཞི་འཆད་པ། (སྨད)"}
,{d:3,t:"མང་པོས་བཀུར་བ་ལ་སོགས་པའི་སྡེ་ཚན།(སྨད)"}
,{d:3,t:"འཁོར་གྱི་སྡེ་ཚན།"}
,{d:3,t:"ཀཽཎྜི་ནྱའི་སྡེ་ཚན།"}
,{d:3,t:"རྫུ་འཕྲུལ་གྱི་སྡེ་ཚན།"}
,{d:3,t:"ཀཽ་ཤི་ཀའི་སྡེ་ཚན།"}
,{d:3,t:"ངང་པའི་སྡེ་ཚན།"}
,{d:3,t:"མནར་མེད་ཀྱི་སྡེ་ཚན།"}
,{d:1,t:"སོ་སོར་ཐར་པའི་མདོ།"}
,{d:2,t:"སོ་སོར་ཐར་པའི་མདོ་གདོན་པའི་གླེང་གཞི་བཤད་པ།"}
,{d:2,t:"ཕམ་པར་འགྱུར་བའི་ཆོས་བཞི་བཤད་པ།"}
,{d:2,t:"དགེ་འདུན་ལྷག་མའི་ཆོས་བཅུ་གསུམ་བཤད་པ།"}
,{d:2,t:"མ་ངེས་པའི་ཆོས་གཉིས་བཤད་པ།"}
,{d:2,t:"སྤང་བའི་ལྟུང་བྱེད་ཀྱི་ཆོས་སུམ་ཅུ་བཤད་པ།"}
,{d:3,t:"བཅུ་ཚན་དང་པོ། འཆང་བ་འབྲལ་འཇོག་སོགས་བཤད་པ།"}
,{d:3,t:"བཅུ་ཚན་གཉིས་པ། སྲིན་བལ་ལ་སོགས་པ་བཤད་པ།"}
,{d:3,t:"བཅུ་ཚན་གསུམ་པ། ལྷུང་བཟེད་གཉིས་སོགས་བཤད་པ།"}
,{d:2,t:"ལྟུང་བྱེད་ཀྱི་ཆོས་དགུ་བཅུ་བཤད་པ།"}
,{d:3,t:"བཅུ་ཚན་དང་པོ། ཤེས་བཞིན་ལ་སོགས་པ་བཤད་པ།"}
,{d:3,t:"བཅུ་ཚན་གཉིས་པ། ས་བོན་ལ་སོགས་པ་བཤད་པ།"}
,{d:3,t:"བཅུ་ཚན་གསུམ་པ། མ་བསྐོས་པ་ལ་སོགས་པ་བཤད་པ།"}
,{d:3,t:"བཅུ་ཚན་བཞི་པ། ཡང་ཡང་ལ་སོགས་པ་བཤད་པ།"}
,{d:3,t:"བཅུ་ཚན་ལྔ་པ། སྲོག་ཆགས་དང་བཅས་པའི་ཆུ་སོགས་བཤད་པ།"}
,{d:3,t:"བཅུ་ཚན་དྲུག་པ། བདེ་དང་མེ་ལ་སོགས་པ་བཤད་པ།"}
,{d:3,t:"བཅུ་ཚན་བདུན་པ། བསམས་བཞིན་དུ་དུད་འགྲོ་གསོད་པ་སོགས་བཤད་པ།"}
,{d:3,t:"བཅུ་ཚན་བརྒྱད་པ། མགྲོན་མང་རྐུན་མ་སོགས་བཤད་པ།"}
,{d:3,t:"བཅུ་ཚན་དགུ་པ། ཟས་བཅས་སྐྱ་རེངས་སོགས་བཤད་པ།"}
,{d:2,t:"སོ་སོར་བཤགས་པར་བྱ་བའི་ཆོས་བཞི་བཤད་པ།"}
,{d:2,t:"བསླབ་པའི་ཆོས་མང་པོ་བཤད་པ།"}
,{d:2,t:"རྩོད་པ་ཞི་བར་བྱ་བའི་ཆོས་བདུན་བཤད་པ།"}
,{d:1,t:"འདུལ་བ་རྣམ་པར་འབྱེད་པ། ༼ཅ༽"}
,{d:2,t:"འདུལ་བ་ལ་བསྟོད་པ།"}
,{d:2,t:"ཕམ་པར་འགྱུར་བའི་ཆོས་རྣམས་བཤད་པ།"}
,{d:3,t:"ཕམ་པར་འགྱུར་བ་དང་པོ་བཤད་པ།"}
,{d:3,t:"ཕམ་པར་འགྱུར་བ་གཉིས་པ་བཤད་པ།"}
,{d:3,t:"ཕམ་པར་འགྱུར་བ་གསུམ་པ་བཤད་པ།"}
,{d:3,t:"ཕམ་པར་འགྱུར་བ་བཞི་པ་བཤད་པ།"}
,{d:2,t:"དགེ་འདུན་ལྷག་མའི་སྡེ་བཤད་པ། (སྟོད)"}
,{d:3,t:"དང་པོ། ཁུ་བ་འབྱིན་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"}
,{d:3,t:"གཉིས་པ། ལུས་ཀྱིས་རེག་པའི་དགེ་འདུན་ལྷག་མ་པཤད་པ།"}
,{d:3,t:"གསུམ་པ། འཁྲིག་པ་དང་ལྡན་པ་སྨྲ་བའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"}
,{d:3,t:"བཞི་པ། བསྙེན་བཀུར་བསྔགས་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"}
,{d:3,t:"ལྔ་པ། སྨྱན་བྱེད་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"}
,{d:3,t:"དྲུག་པ། ཁང་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"}
,{d:3,t:"བདུན་པ། གཙུག་ལག་ཁང་གི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"}
,{d:3,t:"བརྒྱད་པ། གཞི་མེད་པར་སྐུར་པ་འདེབས་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"}
,{d:3,t:"དགུ་པ། གཞན་གྱི་ཆ་མ་ཡིན་པ་དང་མཐུན་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ།"}
,{d:3,t:"བཅུ་པ། ད་གེ་འདུན་གྱི་དབྱེན་བྱེད་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ། (སྟོད)"}
,{d:1,t:"འདུལ་བ་རྣམ་པར་འབྱེད་པ། ༼ཆ༽"}
,{d:2,t:"དགེ་འདུན་ལྷག་མའི་སྡེ་བཤད་པ། (སྨད)"}
,{d:3,t:"བཅུ་པ། དགེ་འདུན་གྱི་དབྱེན་བྱེད་པའི་དགེ་འདུན་ལྷག་མ་བཤད་པ། (སྨད)"}
,{d:3,t:"བཅུ་གཅིག་པ། རྗེས་སུ་ཕྱོགས་པའི་ལྷག་མ་བཤད་པ།"}
,{d:3,t:"བཅུ་གཉིས་པ། ཁྱིམ་སུན་འབྱིན་པའི་ལྷག་མ་བཤད་པ།"}
,{d:3,t:"བཅུ་གསུམ་པ། བཀའ་བློ་མི་བདེ་བའི་ལྷག་མ་བཤད་པ།"}
,{d:2,t:"མ་ངེས་པའི་ཆོས་བཤད་པ།"}
,{d:3,t:"མ་ངེས་པའི་ཆོས་དང་པོ་བཤད་པ།"}
,{d:3,t:"མ་ངེས་པའི་ཆོས་གཉིས་པ་བཤད་པ།"}
,{d:2,t:"སྤང་བའི་ལྟུང་བྱེད་སུམ་ཅུ་བཤད་པ།"}
,{d:3,t:"དང་པོ། འཆང་བའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"གཉིས་པ། འབྲལ་བའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"གསུམ་པ། འཇོག་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"བཞི་པ། འཁྲུར་འཇུག་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"ལྔ་པ། ལེན་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"དྲུག་པ། སློང་བའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"བདུན་པ། སློང་བར་རིགས་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"བརྒྱད་པ། སྤགས་པ་ལས་ལྷག་པ་སློང་བའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"དགུ་པ། སོ་སོ་ནས་སྤགས་པ་ལས་ལྷག་པ་སློང་བའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"བཅུ་པ། བསྐུར་བའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"བཅུ་གཅིག་པ། སྲིན་བལ་གྱི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"བཅུ་གཉིས་པ། བལ་ནག་པོ་འབའ་ཞིག་གི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"བཅུ་གསུམ་པ། ཆ་གཉིས་བསྲེས་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"བཅུ་བཞི་པ། ལོ་དྲུག་ཏུ་བཅང་བའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"བཅོ་ལྔ་པ། མཐོ་གང་གི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"བཅུ་དྲུག་པ། བལ་ཐོགས་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"བཅུ་བདུན་པ། བལ་རྨེལ་དུ་འཇུག་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"བཅོ་བརྒྱད་པ། གསེར་དངུལ་ལ་རེག་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"བཅུ་དགུ་པ། མངོན་མཚན་ཅན་གྱིས་སྦྱོད་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"ཉི་ཤུ་པ། ཉོ་འཚོང་བྱེད་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"ཉི་ཤུ་གཅིག་པ། ལྷུང་བཟེད་འཆང་བའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"ཉི་ཤུ་གཉིས་པ། ལྷུང་བཟེད་ཚོལ་བའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"ཉི་ཤུ་གསུམ་པ། འཐག་ཏུ་འཇུད་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"ཉི་ཤུ་བཞི་པ། འཐག་པ་སྐྱེད་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"ཉི་ཤུ་ལྔ་པ། འཕྲོག་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"ཉི་ཤུ་དྲུག་པ། བརྟད་པ་ལས་བྱུང་བ་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"ཉི་ཤུ་བདུན་པ། ཞག་བདུན་གྱིས་འབྲལ་བ་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"ཉི་ཤུ་བརྒྱད་པ། དབྱར་གྱི་རས་ཆེན་གྱི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"ཉི་ཤུ་དགུ་པ། བསྔོས་པ་ལས་བསྒྱུར་པའི་སྤང་བ་བསྟན་པ།"}
,{d:3,t:"སུམ་ཅུ་པ། གསོག་འཇོག་གི་སྤང་བ་བསྟན་པ།"}
,{d:2,t:"ལྟུང་བྱེད་ཀྱི་སྡེ་རྣམས་བཤད་པ། (སྟོད)"}
,{d:3,t:"བཅུ་ཚན་དང་པོ། ཤེས་བཞིན་ལ་སོགས་པའི་སྡེ་ཚན།"}
,{d:4,t:"དང་པོ། བརྫུན་དུ་སྨྲ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"གཉིས་པ། མིའི་སྐྱོན་ནས་སྨྲ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"གསུམ་པ། དགེ་སློང་ལ་ཕྲ་མ་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཞི་པ། སྐྱོ་སྔོགས་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ལྔ་པ། སྟོན་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"དྲུག་པ། འདོན་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བདུན་པ། གནས་ངན་ལེན་བརྗོད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བརྒྱད་པ། མིའི་ཆོས་བླ་མ་བརྗོད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"དགུ་པ། སྐུར་བ་འདེབས་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཅུ་པ། བསླབ་པ་ཁྱད་དུ་གསོད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"བཅུ་ཚན་གཉིས་པ། ས་བོན་ལ་སོགས་པའི་སྡེ་ཚན། (སྟོད)"}
,{d:4,t:"བཅུ་གཅིག་པ། ས་བོན་དང་སྐྱེ་བ་འཇིག་པའི་ལྟུང་བྱེད"}
,{d:1,t:"འདུལ་བ་རྣམ་པར་འབྱེད་པ། ༼ཇ༽"}
,{d:2,t:"ལྟུང་བྱེད་ཀྱི་སྡེ་རྣམས་བཤད་པ། (བར)"}
,{d:3,t:"བཅུ་ཚན་གཉིས་པ། ས་བོན་ལ་སོགས་པའི་སྡེ་ཚན། (སྨད)"}
,{d:4,t:"བཅུ་གཉིས་པ། འཕྱ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཅུ་གསུམ་པ། བསྒོ་བ་རྣ་ལ་གཟོན་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཅུ་བཞི་པ། གནས་མལ་གྱི་ལྟུང་བྱེད།"}
,{d:4,t:"བཅོ་ལྔ་པ། གདིང་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཅུ་དྲུག་པ། སྐྲོད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཅུ་བདུན་པ། ཕྱིས་གནོན་གྱི་ལྟུང་བྱེད།"}
,{d:4,t:"བཅོ་བརྒྱད་པ། རྩ་བ་འབྱུང་བ་ལ་འདུག་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཅུ་དགུ་པ། སྲོག་ཆགས་དང་བཅས་པ་ལ་སྤྱོད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ཉི་ཤུ་པ། གཙུག་ལག་ཁང་གི་ལྟུང་བྱེད།"}
,{d:3,t:"བཅུ་ཚན་གསུམ་པ། མ་བསྐོས་པ་ལ་སོགས་པའི་སྡེ་ཚན།"}
,{d:4,t:"ཉི་ཤུ་གཅིག་པ། མ་བསྐོས་པར་སྟོན་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ཉི་ཤུ་གཉིས་པ། ཉི་མ་ནུབ་ཀྱི་བར་དུ་སྟོན་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ཉི་ཤུ་གསུམ་པ། ཟས་ཅུང་ཟད་ཙམ་གྱི་ཕྱིར་སྟོན་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ཉི་ཤུ་བཞི་པ། གོས་སྦྱིན་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ཉི་ཤུ་ལྔ་པ། གོས་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ཉི་ཤུ་དྲུག་པ། དགེ་སློང་མ་དང་ལྷན་ཅིག་འགྲོན་ལམ་དུ་འཇུག་པའི་ལྷུང་བྱེད།"}
,{d:4,t:"ཉི་ཤུ་བདུན་པ། དགེ་སློང་མ་དང་ལྷན་ཅིག་གྲུར་འཇུག་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ཉི་ཤུ་བརྒྱད་པ། གཅིག་པུ་འདུག་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ཉི་ཤུ་དགུ་པ། གཅིག་པུ་འགྲེང་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"སུམ་བཅུ་པ། དགེ་སློང་མས་སྦྱོར་དུ་བཅུག་པ་ཟ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བཅུ་ཚན་བཞི་པ། ཡང་ཡང་ཟ་བ་ལ་སོགས་པའི་སྡེ་ཚན།"}
,{d:4,t:"སུམ་བཅུ་རྩ་གཅིག་པ། ཡང་ཡང་ཟ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"སུམ་བཅུ་རྩ་གཉིས་པ། འདུག་གནས་གཅིག་ཏུ་ཟ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"སུམ་བཅུ་རྩ་གསུམ་པ། ལྷུང་བཟེད་དོ་གསུམ་ཙམ་ལས་ལྷག་པར་ལེན་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"སུམ་བཅུ་རྩ་བཞི་པ། སྟན་གཅིག་པའི་ཟས་ཀྱི་ལྟུང་བྱེད།"}
,{d:4,t:"སུམ་བཅུ་རྩ་ལྔ་པ། སྤང་ས་པ་ལ་སྟོབས་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"སུམ་བཅུ་རྩ་དྲུག་པ། འདུས་ཤིང་ཟ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"སུམ་བཅུ་རྩ་བདུན་པ། དུས་མ་ཡིན་པར་ཟ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"སུམ་བཅུ་རྩ་བརྒྱད་པ། གསོག་འཇོག་གི་ལྟུང་བྱེད།"}
,{d:4,t:"སུམ་བཅུ་རྩ་དགུ་པ། བྱིན་ལེན་མ་བྱས་པར་ཟ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཞི་བཅུ་པ། བསོད་པ་སློང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བཅུ་ཚན་ལྔ་པ། ཆུ་ལ་སོགས་པའི་སྡེ་ཚན།"}
,{d:4,t:"བཞི་བཅུ་རྩ་གཅིག་པ། སྲོག་ཆགས་དང་བཅས་པའི་ཆུ་ལ་སྤྱོད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཞི་བཅུ་རྩ་གཉིས་པ། ཉལ་པོ་བྱེད་པར་ཤོམ་པའི་ཁྱིམ་ན་འདུག་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཞི་བཅུ་རྩ་གསུམ་པ། ཉལ་པོ་བྱེད་པར་ཤོམ་པའི་ཁྱིམ་ན་འགྲེང་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཞི་བཅུ་རྩ་བཞི་པ། གཅེར་བུ་པ་ལ་སྦྱིན་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཞི་བཅུ་རྩ་ལྔ་པ། དམག་ལ་ལྟ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཞི་བཅུ་རྩ་དྲུག་པ། དམག་གི་ནང་ན་གནས་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཞི་བཅུ་རྩ་བདུན་པ། དཔུང་གི་ཡན་ལག་ཉམས་སུ་མྱོང་བར་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཞི་བཅུ་རྩ་བརྒྱད་པ། རྡེག་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བཞི་བཅུ་རྩ་དགུ་པ། གཟས་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ལྔ་བཅུ་པ། གནས་ངན་ལེན་འཆབ་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"བཅུ་ཚན་དྲུག་པ། ཁྱིམ་ལ་སོགས་པའི་སྡེ་ཚན།"}
,{d:4,t:"ལྔ་བཅུ་རྩ་གཅིག་པ། ཟན་གཅོད་དུ་འཇུག་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ལྔ་བཅུ་རྩ་གཉིས་པ། མེ་ལ་རེག་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ལྔ་བཅུ་རྩ་གསུམ་པ། འདུན་པ་ཕྱིར་སྒྱུར་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"ལྔ་བཅུ་རྩ་བཞི་པ། རྫོགས་པར་མ་བསྙེན་པ་དང་ལྷན་ཅིག་ཉལ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"ལྔ་བཅུ་རྩ་ལྔ་པ། ལྟ་བའི་རྣམ་པ་མི་གཏོང་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"ལྔ་བཅུ་རྩ་དྲུག་པ། སྤངས་པའི་རྗེས་སུ་ཕྱོགས་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ལྔ་བཅུ་རྩ་བདུན་པ། བསྙིལ་བ་སྡུད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ལྔ་བཅུ་རྩ་བརྒྱད་པ། ཁ་མ་བསྒྱུར་བའི་གོས་གྱོན་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"ལྔ་བཅུ་རྩ་དགུ་པ། ལོངས་པའི་གཞིར་གཏོགས་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"དྲུག་བཅུ་པ། ཁྲུས་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"བཅུ་ཚན་བདུན་པ། བསམས་བཞིན་ལ་སོགས་པའི་སྡེ་ཚན།"}
,{d:4,t:"དྲུག་བཅུ་རྩ་གཅིག་པ། དུད་འགྲོ་གསོད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"དྲུག་བཅུ་རྩ་གཉིས་པ། འགྱོད་པ་སྐྱེད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"དྲུག་བཅུ་རྩ་གསུམ་པ། ག་ག་ཚིལ་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"དྲུག་བཅུ་རྩ་བཞི་པ། ཆུ་ལ་རྩེ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"དྲུག་བཅུ་རྩ་ལྔ་པ། བུད་མེད་དང་ལྷན་ཅིག་ཉལ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"དྲུག་བཅུ་རྩ་དྲུག་པ། སྔངས་པར་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"དྲུག་བཅུ་རྩ་བདུན་པ། སྦེད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"དྲུག་བཅུ་རྩ་བརྒྱད་པ། བྱིན་པས་ཉེ་བར་འཚོ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"དྲུག་བཅུ་རྩ་དགུ་པ། སྐུར་པ་འདེབས་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བདུན་བཅུ་པ། བུད་མེད་དང་ལྷན་ཅིག་འགྲོ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བཅུ་ཚན་བདུན་པ། འགྲོན་མང་རྐུན་མ་སོགས་ཀྱི་སྡེ་ཚན། (སྟོད)"}
,{d:4,t:"བདུན་བཅུ་རྩ་གཅིག་པ། རྐུན་མ་དང་ལྷན་ཅིག་འགྲོ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"བདུན་བཅུ་རྩ་གཉིས་པ། ལོ་ཉི་ཤུ་མ་ལོན་པར་རྫོགས་པར་བསྙེན་པར་བྱེད་པའི་ལྷུང་བྱེད།"}
,{d:1,t:"འདུལ་བ་རྣམ་པར་འབྱེད་པ། ༼ཉ༽"}
,{d:2,t:"ལྟུང་བྱེད་ཀྱི་སྡེ་རྣམས་བཤད་པ། (སྨད)"}
,{d:3,t:"བཅུ་ཚན་བདུན་པ། འགྲོན་མང་རྐུན་མ་སོགས་ཀྱི་སྡེ་ཚན (སྨད)"}
,{d:4,t:"བདུན་བཅུ་རྩ་གསུམ་པ། ས་རྐོ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"བདུན་བཅུ་རྩ་བཞི་པ། མགྲོན་དུ་གཉེར་བ་ལས་རིང་དུ་འདུག་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བདུན་བཅུ་རྩ་ལྔ་པ། བསླབ་པ་ལ་ཉེ་བར་འཇོག་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བདུན་བཅུ་རྩ་དྲུག་པ། ཉན་རྣ་ལས་གྱུར་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བདུན་བཅུ་རྩ་བདུན་པ། མི་སྨྲ་བར་འགྲོ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"བདུན་བཅུ་རྩ་བརྒྱད་པ། མ་གུས་པའི་ཚུལ་གྱི་ལྟུང་བྱེད།"}
,{d:4,t:"བདུན་བཅུ་རྩ་དགུ་པ། མྱོས་པར་འགྱུར་བ་འཐུང་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"བརྒྱད་བཅུ་པ། དུས་མ་ཡིན་པར་འགྲོ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བཅུ་ཚན་བརྒྱད་པ། མཆོད་སྟོན་ལ་སོགས་པའི་སྡེ་ཚན།"}
,{d:4,t:"བརྒྱད་བཅུ་རྩ་གཅིག་པ། གྲོང་དུ་རྒྱུ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"བརྒྱད་བཅུ་རྩ་གཉིས་པ། རྒྱལ་པོའི་ཕོ་བྲང་དུ་ནུབ་མོ་འགྲོ་བའི་ལྟུང་བྱེད།"}
,{d:4,t:"བརྒྱད་བཅུ་རྩ་གསུམ་པ། བསླབ་པའི་གཞིའི་དངོས་པོ་ལ་ཁྱད་དུ་གསོད་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བརྒྱད་བཅུ་རྩ་བཞི་པ། ཁབ་རལ་འཆོས་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བརྒྱད་བཅུ་རྩ་ལྔ་པ། ཁྲི་རྐང་འཆོས་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བརྒྱད་བཅུ་རྩ་དྲུག་པ། ཤིང་བལ་གྱིས་གོས་པར་བྱས་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བརྒྱད་བཅུ་རྩ་བདུན་པ། གདིང་བ་ལས་གྱུར་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བརྒྱད་བཅུ་རྩ་བརྒྱད་པ། གཡན་པ་དགབ་པ་ལས་གྱུར་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"བརྒྱད་བཅུ་རྩ་དགུ་པ། དབྱར་གྱི་རས་ཆེན་ལས་གྱུར་པའི་ལྟུང་བྱེད།"}
,{d:4,t:"དགུ་བཅུ་པ། བདེ་བར་གཤེགས་པའི་ཆོས་གོས་ཀྱི་ཚད་ལས་གྱུར་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བའི་སྡེ་བཤད་པ།"}
,{d:4,t:"དང་པོ། དགེ་སློང་མ་ལས་ཟས་ལེན་པའི་སོ་སོར་བཤགས་པར་བྱ་བ།"}
,{d:4,t:"གཉིས་པ། གྲལ་རིམས་སུ་མ་ཕེབས་པར་འབྲིམ་དུ་འཇུག་པ་མ་བཟློག་པར་ཟ་བའི་བའི་སོ་སོར་བཤགས་པར་བྱ་བ།"}
,{d:4,t:"གསུམ་པ། བསླབ་པ་དྲལ་ཏེ་ཁྱིམ་དུ་འཇུག་པའི་སོ་སོར་བཤགས་པར་བྱ་བ།"}
,{d:4,t:"བཞི་པ། ནགས་བརྟག་པ་ལས་གྱུར་པའི་སོ་སོར་བཤགས་པར་བྱ་བ།"}
,{d:3,t:"བསླབ་པའི་ཆོས་མང་པོ་བཤད་པ།"}
,{d:3,t:"རྩོད་པ་ཞི་བར་བྱ་བའི་ཆོས་བདུན་བཤད་པ།"}
,{d:1,t:"དགེ་སློང་མའི་སོ་སོར་ཐར་པའི་མདོ།"}
,{d:2,t:"སོ་སོར་ཐར་པའི་མདོ་གདོན་པའི་གླེང་གཞི།"}
,{d:2,t:"ཕམ་པར་འགྱུར་བའི་ཆོས་བརྒྱད་འཆད་པ།"}
,{d:2,t:"དགེ་འདུན་ལྷག་མའི་ཆོས་ཉི་ཤུ་འཆད་པ།"}
,{d:2,t:"སྤང་བའི་ལྟུང་བྱེད་སུམ་ཅུ་རྩ་གསུམ་འཆད་པ།"}
,{d:2,t:"ལྟུང་བྱེད་ཀྱི་ཆོས་བརྒྱ་དང་བརྒྱད་ཅུ་འཆད་པ།"}
,{d:3,t:"བརྫུན་སྐྱོན་སོགས་འཆད་པ།"}
,{d:3,t:"ས་བོན་སོགས་འཆད་པ།"}
,{d:3,t:"འདུག་གནས་སོགས་འཆད་པ།"}
,{d:3,t:"སྲོག་ཆགས་སོགས་འཆད་པ།"}
,{d:3,t:"བདེ་བ་སོགས་འཆད་པ།"}
,{d:3,t:"དུད་འགྲོ་སོགས་འཆད་པ།"}
,{d:3,t:"རྐུ་བ་སོགས་འཆད་པ།"}
,{d:3,t:"ཟས་དང་བཅས་པ་སོགས་འཆད་པ།"}
,{d:3,t:"ལོ་བཅུ་གཉིས་མ་ལོན་པ་སོགས་འཆད་པ།"}
,{d:3,t:"འདྲིད་པ་སོགས་འཆད་པ།"}
,{d:3,t:"ནད་གཡོག་སོགས་འཆད་པ།"}
,{d:3,t:"ཉན་པ་སོགས་འཆད་པ།"}
,{d:3,t:"ཁྲི་གཅིག་ལ་ཉལ་བ་སོགས་འཆད་པ།"}
,{d:3,t:"པུ་ཤེལ་ཙི་སོགས་འཆད་པ།"}
,{d:3,t:"མཆིལ་ལྷམ་སོགས་འཆད་པ།"}
,{d:3,t:"སྒོག་སྐྱ་སོགས་འཆད་པ།"}
,{d:3,t:"ཆོས་ལ་སེར་སྣ་བྱེད་པ་སོགས་འཆད་པ།"}
,{d:3,t:"འདུན་པ་སོགས་འཆད་པ།"}
,{d:3,t:"མི་འགྲོ་བ་སོགས་འཆད་པ།"}
,{d:2,t:"སོ་སོར་བཤགས་པར་བྱ་བའི་ཆོས་བཅུ་གཅིག་འཆད་པ།"}
,{d:2,t:"བསླབ་པར་བྱ་བའི་ཆོས་མང་པོ་འཆད་པ།"}
,{d:2,t:"རྩོད་པ་ཞི་བར་བྱ་བའི་ཆོས་བདུན་འཆད་པ།"}
,{d:1,t:"དགེ་སློང་མའི་འདུལ་བ་རྣམ་པར་འབྱེད་པ།"}
,{d:2,t:"ཕམ་པར་འགྱུར་བའི་ཆོས་བརྒྱད་འཆད་པ།"}
,{d:3,t:"ཕས་ཕམ་པར་གྱུར་པ་དང་པོ་འཆད་པ།"}
,{d:3,t:"ཕས་ཕམ་པར་གྱུར་པ་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ཕས་ཕམ་པར་གྱུར་པ་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ཕས་ཕམ་པར་གྱུར་པ་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ཕས་ཕམ་པར་གྱུར་པ་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ཕས་ཕམ་པར་གྱུར་པ་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"ཕས་ཕམ་པར་གྱུར་པ་བདུན་པ་འཆད་པ།"}
,{d:3,t:"ཕས་ཕམ་པར་གྱུར་པ་བརྒྱད་པ་འཆད་པ།"}
,{d:2,t:"དགེ་འདུན་ལྷག་མའི་ཆོས་ཉི་ཤུ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་དང་པོ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་བཞི་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་བདུན་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"ད་གེ་འདུན་ལྷག་མ་དགུ་པ་འཆད་པ།"}
,{d:3,t:"ད་གེ་འདུན་ལྷག་མ་བཅུ་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་བཅུ་གཅིག་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་བཅུ་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་བཅུ་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་བཅུ་བཞི་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་བཅྭ་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་བཅུ་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་བཅུ་བདུན་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་བཅྭ་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་བཅུ་དགུ་པ་འཆད་པ།"}
,{d:3,t:"དགེ་འདུན་ལྷག་མ་ཉི་ཤུ་པ་འཆད་པ།"}
,{d:2,t:"སྤང་བའི་ལྟུང་བྱེད་སུམ་ཅུ་རྩ་གསུམ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་དང་པོ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་བཞི་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་བདུན་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་དགུ་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་བཅུ་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་བཅུ་གཅིག་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་བཅུ་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་བཅུ་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་བཅུ་བཞི་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་བཅྭ་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་བཅུ་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་བཅུ་བདུན་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་བཅྭ་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་བཅུ་དགུ་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་གཅིག་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་བཞི་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་ཉི་ཤུ་དགུ་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་སུམ་བཅུ་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་སུམ་བཅུ་གཅིག་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་སུམ་བཅུ་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"སྤང་བའི་ལྟུང་བྱེད་སུམ་བཅུ་གསུམ་པ་འཆད་པ།"}
,{d:2,t:"ལྟུང་བྱེད་ཀྱི་ཆོས་བརྒྱ་དང་བརྒྱད་ཅུ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བདུན་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དགུ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དང་པོའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གཉིས་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གཉིས་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གཉིས་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གཉིས་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གཉིས་པའི་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གཉིས་པའི་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གཉིས་པའི་བདུན་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གཉིས་པའི་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གཉིས་པའི་དགུ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གཉིས་པའི་བཅུ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གསུམ་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གསུམ་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གསུམ་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གསུམ་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གསུམ་པའི་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གསུམ་པའི་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གསུམ་པའི་བདུན་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གསུམ་པའི་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གསུམ་པའི་དགུ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གསུམ་པའི་བཅུ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གསུམ་པའི་བཅུ་གཅིག་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་གསུམ་པའི་བཅུ་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པའི་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པའི་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པའི་བདུན་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པའི་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པའི་དགུ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པའི་བཅུ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པའི་བཅུ་གཅིག་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པའི་བཅུ་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཞི་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ལྔ་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ལྔ་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ལྔ་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ལྔ་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ལྔ་པའི་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ལྔ་པའི་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ལྔ་པའི་བདུན་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ལྔ་པའི་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ལྔ་པའི་དགུ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ལྔ་པའི་བཅུ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ལྔ་པའི་བཅུ་གཅིག་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ལྔ་པའི་བཅུ་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དྲུག་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དྲུག་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དྲུག་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དྲུག་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དྲུག་པའི་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དྲུག་པའི་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དྲུག་པའི་བདུན་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དྲུག་པའི་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དྲུག་པའི་དགུ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དྲུག་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བདུན་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བདུན་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བདུན་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བདུན་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བདུན་པའི་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བདུན་པའི་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བདུན་པའི་བདུན་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བདུན་པའི་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བདུན་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བརྒྱད་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བརྒྱད་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བརྒྱད་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བརྒྱད་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དགུ་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དགུ་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དགུ་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་དགུ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གཅིག་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གཅིག་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གཅིག་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གཅིག་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གཅིག་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གཉིས་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གཉིས་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གཉིས་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གཉིས་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གཉིས་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གསུམ་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གསུམ་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གསུམ་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གསུམ་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་གསུམ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་བཞི་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་བཞི་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་བཞི་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་བཞི་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་བཞི་པའི་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་བཞི་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅྭ་ལྔ་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅྭ་ལྔ་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅྭ་ལྔ་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅྭ་ལྔ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་དྲུག་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་དྲུག་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་དྲུག་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་དྲུག་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་དྲུག་པའི་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་དྲུག་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་བདུན་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་བདུན་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་བདུན་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་བདུན་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་བདུན་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅྭ་བརྒྱད་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅྭ་བརྒྱད་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅྭ་བརྒྱད་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅྭ་བརྒྱད་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་དགུ་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་དགུ་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་དགུ་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་དགུ་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་དགུ་པའི་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་བཅུ་དགུ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་པའི་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་པའི་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་པའི་བདུན་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་པའི་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གཅིག་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གཅིག་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གཅིག་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གཅིག་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གཉིས་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གཉིས་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གཉིས་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གཉིས་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གཉིས་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གསུམ་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གསུམ་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གསུམ་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གསུམ་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་གསུམ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བཞི་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བཞི་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བཞི་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བཞི་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་ལྔ་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་ལྔ་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་ལྔ་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་ལྔ་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་ལྔ་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་དྲུག་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་དྲུག་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་དྲུག་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་དྲུག་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་དྲུག་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་བདུན་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་དགུ་པ་འཆ་ད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་བཅུ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་བཅུ་གཅིག་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བདུན་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པའི་དང་པོ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པའི་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པའི་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པའི་བཞི་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པའི་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"ལྟུང་བྱེད་ཉི་ཤུ་བརྒྱད་པའི་ཚིགས་སུ་བཅད་པའི་སྡོམ་འཆད་པ།"}
,{d:2,t:"སོ་སོར་བཤགས་པར་བྱ་བའི་ཆོས་བཅུ་གཅིག་འཆད་པ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་དང་པོ་འཆད་པ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་གཉིས་པ་འཆད་པ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་གསུམ་པ་འཆད་པ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་བཞི་པ་འཆད་པ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་ལྔ་པ་འཆད་པ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་དྲུག་པ་འཆད་པ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་བདུན་པ་འཆད་པ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་བརྒྱད་པ་འཆད་པ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་དགུ་པ་འཆད་པ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་བཅུ་པ་འཆད་པ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་བཅུ་གཅིག་པ་འཆད་པ།"}
,{d:2,t:"བསླབ་པར་བྱ་བའི་ཆོས་མང་པོ་འཆད་པ།"}
,{d:2,t:"རྩོད་པ་ཞི་བར་བྱ་བའི་ཆོས་བདུན་འཆད་པ།"}
,{d:1,t:"འདུལ་བ་ཕྲན་ཚེགས་ཀྱི་གཞི། ༼ཐ༽"}
,{d:2,t:"ཕྲ་མོའི་སྒོ་དང་པོ། སོ་ཕག་གི་སྡེ་ཚན།"}
,{d:3,t:"སོ་ཕག་སོགས་བཤད་པ།"}
,{d:3,t:"སེན་མོ་བཅོས་པ་སོགས་བཤད་པ།"}
,{d:3,t:"ལྷུང་བཟེད་སོགས་བཤད་པ།"}
,{d:3,t:"མེ་ལོང་སྐྱེས་སོགས་བཤད་པ།"}
,{d:3,t:"ཡན་ལག་སོགས་བཤད་པ།"}
,{d:3,t:"ལམ་ཕྲན་སོགས་བཤད་པ།"}
,{d:3,t:"ཆུ་ཚགས་སོགས་བཤད་པ།"}
,{d:3,t:"མོན་སྲན་སྡེའུ་སོགས་བཤད་པ།"}
,{d:3,t:"རྐང་པ་བཀྲུ་བ་སོགས་བཤད་པ།"}
,{d:3,t:"གོས་མདུད་པ་སོགས་བཤད་པ།"}
,{d:2,t:"ཕྲ་མོའི་སྒོ་གཉིས་པ། ཆན་པའི་སྡེ་ཚན།"}
,{d:3,t:"ཆན་པས་འདྲེག་སོགས་བཤད་པ།"}
,{d:3,t:"གདུགས་སོགས་བཤད་པ།"}
,{d:3,t:"བེའུ་རས་སོགས་བཤད་པ།"}
,{d:3,t:"རྒྱན་སྤེལ་མ་སོགས་བཤད་པ།"}
,{d:3,t:"ལེན་པ་སོགས་བཤད་པ།"}
,{d:3,t:"ཚོགས་དང་ཁྲུས་ལ་སོགས་པ་བཤད་པ།"}
,{d:3,t:"གཅིན་ལ་སོགས་པ་བཤད་པ།"}
,{d:3,t:"སྒོ་འཕར་བཤད་པ།"}
,{d:3,t:"གསོར་ལ་སོགས་པ་བཤད་པ།"}
,{d:3,t:"སྟེའུ་སོགས་བཤད་པ།"}
,{d:2,t:"ཕྲ་མོའི་སྒོ་གསུམ་པ། ཆོས་གོས་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"ཆོས་གོས་ཀྱི་གདང་སོགས་བཤད་པ།"}
,{d:3,t:"ནང་དང་ཕྱི་རོལ་སོགས་བཤད་པ།"}
,{d:3,t:"བསྐྲད་པ་སོགས་བཤད་པ།"}
,{d:3,t:"ཁང་བཟངས་སོགས་བཤད་པ།"}
,{d:3,t:"ལན་ཚྭ་སོགས་བཤད་པ།"}
,{d:3,t:"གདོང་ཕྱིས་སོགས་བཤད་པ།"}
,{d:3,t:"ཕྱི་བ་སོགས་བཤད་པ།"}
,{d:3,t:"མཁར་ལེན་སོགས་བཤད་པ།"}
,{d:3,t:"སྟན་སོགས་བཤད་པ།"}
,{d:3,t:"སྤུ་གྲི་སོགས་བཤད་པ།"}
,{d:2,t:"ཕྲ་མོའི་སྒོ་བཞི་པ། གནས་བརྟན་གྱི་སྡེ་ཚན།"}
,{d:3,t:"གནས་བརྟན་སོགས་བཤད་པ།"}
,{d:3,t:"ར་བ་སོགས་བཤད་པ།"}
,{d:3,t:"ལྷན་པ་སོགས་བཤད་པ།"}
,{d:3,t:"ནད་པ་སོགས་བཤད་པ།"}
,{d:3,t:"རིགས་ངན་སོགས་བཤད་པ།"}
,{d:3,t:"ཕག་སོགས་བཤད་པ།"}
,{d:3,t:"རི་མོ་སོགས་བཤད་པ།"}
,{d:3,t:"ལྷུང་བཟེད་མེད་པ་སོགས་བཤད་པ།"}
,{d:3,t:"གནས་བཅའ་བ་སོགས་བཤད་པ།"}
,{d:3,t:"ཤིང་བསྐྱེད་པ་སོགས་བཤད་པ།"}
,{d:2,t:"ཕྲ་མོའི་སྒོ་ལྔ་པ། ལུས་ཀྱི་སྡེ་ཚན།"}
,{d:3,t:"རོ་བསྲེག་པར་བྱ་བ་སོགས་བཤད་པ།"}
,{d:3,t:"གླེང་བ་སོགས་བཤད་པ།"}
,{d:3,t:"སངས་རྒྱས་མཚན་ནས་སྨོས་པ་སོགས་བཤད་པ།"}
,{d:3,t:"སྤང་བ་སོགས་བཤད་པ།"}
,{d:3,t:"ང་འདས་ནས་འདི་ལ་བྱིན་ཅིག་སོགས་བཤད་པ།"}
,{d:3,t:"མཚམས་ཀྱི་ཕྱི་རོལ་སོགས་བཤད་པ།"}
,{d:3,t:"དགེ་སློང་བགྲང་བར་བྱ་བ་སོགས་བཤད་པ།"}
,{d:3,t:"དགེ་ཚུལ་གྱི་ཁྲིའུ་སོགས་བཤད་པ།"}
,{d:3,t:"ཚུལ་ཤིང་བྲིམས་པ་སོགས་བཤད་པ།"}
,{d:3,t:"རུང་བ་མི་ཡིན་པ་ལྔ་སོགས་བཤད་པ།"}
,{d:2,t:"ཕྲ་མོའི་སྒོ་དྲུག་པ། རྒྱུས་པའི་སྡེ་ཚན། (སྟོད)"}
,{d:3,t:"རྒྱུས་པ་སོགས་བཤད་པ།"}
,{d:3,t:"རབ་སྣང་སོགས་བཤད་པ།"}
,{d:3,t:"འཚོ་བྱེད་སོགས་བཤད་པ།"}
,{d:3,t:"ཞི་བ་སོགས་བཤད་པ།"}
,{d:3,t:"བ་ལང་སྐྱོང་སོགས་བཤད་པ། (སྟོད)"}
,{d:1,t:"འདུལ་བ་ཕྲན་ཚེགས་ཀྱི་གཞི། ༼ད༽"}
,{d:2,t:"ཕྲ་མོའི་སྒོ་དྲུག་པ། རྒྱུས་པའི་སྡེ་ཚན། (སྨད)"}
,{d:3,t:"བ་ལང་སྐྱོང་སོགས་བཤད་པ། (སྨད)"}
,{d:3,t:"དྲག་ཤུལ་ཅན་སོགས་བཤད་པ།"}
,{d:3,t:"བྲན་ཅན་སོགས་བཤད་པ།"}
,{d:3,t:"བཙའ་ཞུགས་པ་སོགས་བཤད་པ།"}
,{d:3,t:"འཕྱན་པ་སོགས་བཤད་པ།"}
,{d:3,t:"མདུན་དུ་འགྲོ་བར་མི་བྱ་བ་སོགས་བཤད་པ།"}
,{d:3,t:"ཚོང་དཔོན་གྱིས་ཀྱང་ཟས་ལྷག་མ་ཞེས་སོགས་བཤད་པ"}
,{d:3,t:"དགེ་སློང་ལྷག་མ་མི་རུང་སྟེ་ཞེས་སོགས་བཤད་པ།"}
,{d:3,t:"བཙོག་པའི་གནས་སུ་མི་དོར་བ་སོགས་བཤད་པ།"}
,{d:2,t:"ཕྲ་མོའི་སྒོ་བདུན་པ། འགྱོད་པའི་སྡེ་ཚན།"}
,{d:3,t:"ཐེ་ཚོམ་སོགས་བཤད་པ།"}
,{d:3,t:"སང་ཀཱག་ཀྵི་སོགས་བཤད་པ།"}
,{d:3,t:"མཚན་གཉིས་སོགས་བཤད་པ།"}
,{d:3,t:"མཚན་མ་ཙམ་སོགས་བཤད་པ།"}
,{d:3,t:"དགེ་སློང་ཕས་ལས་བརྗོད་པ་སོགས་བཤད་པ།"}
,{d:3,t:"ཆང་འཚོང་མ་སོགས་བཤད་པ།"}
,{d:3,t:"དགེ་སློང་མ་ལས་དགེ་སློང་ནང་དུ་བཞག་པ་སོགས་བཤད་པ།"}
,{d:3,t:"ཕྱི་རོལ་དགེ་སློང་བཟོད་མི་གསོལ་ཞེས་སོགས་བཤད་པ།"}
,{d:3,t:"ལུས་ལ་ཕ་གུས་ཕྱི་བར་མི་བྱ་བ་སོགས་བཤད་པ།"}
,{d:2,t:"ཕྲ་མོའི་སྒོ་བརྒྱད་པ། དབྱུང་བའི་སྡེ་ཚན།"}
,{d:3,t:"དགེ་སློང་མ་ཡི་བཀུར་སྟི་བྲི་བ་སོགས་བཤད་པ།"}
,{d:3,t:"དགེ་སློང་མས་བཟོད་པ་གསོལ་པ་སོགས་བཤད་པ།"}
,{d:3,t:"སྒོ་ཡི་དྲུང་ན་འཁོད་པ་སོགས་བཤད་པ།"}
,{d:3,t:"མི་འབྲོས་པར་བསྒོ་བ་སོགས་བཤད་པ།"}
,{d:3,t:"ཁར་བའི་སྣོད་སོགས་བཤད་པ།"}
,{d:3,t:"བུད་མེད་ཆུ་འགྲམ་ཕྱེ་མས་མིན་ཞེས་སོགས་བཤད་པ།"}
,{d:3,t:"བུད་མེད་གར་དང་བྲེལ་བ་དང་ཞེས་སོགས་བཤད་པ།"}
,{d:3,t:"བརྟགས་ནས་འགྲོ་བར་བྱ་བ་སོགས་བཤད་པ།"}
,{d:3,t:"སྣམ་སྦྱར་ཅི་རིགས་བགོ་བ་སོགས་བཤད་པ།"}
,{d:3,t:"མལ་ན་སྦྲུལ་ནག་ཉལ་བ་སོགས་བཤད་པ།"}
,{d:3,t:"ངག་ལྡན་གྱིས་ཞུས་པ་སོགས་བཤད་པ།"}
,{d:3,t:"སྟོན་པ་དང་འདུལ་བ་སོགས་བཤད་པ།"}
,{d:3,t:"ཙ་པ་ལ་སོགས་བཤད་པ།"}
,{d:1,t:"འདུལ་བ་གཞུང་བླ་མ། ༼ན༽"}
,{d:2,t:"ཕམ་པ་འཆད་པ།"}
,{d:3,t:"མི་ཚངས་པར་སྤྱོད་པའི་ཕམ་པ།"}
,{d:3,t:"མ་བྱིན་པར་ལེན་པའི་ཕམ་པ།"}
,{d:3,t:"སྲོག་གཅོད་པའི་ཕམ་པ།"}
,{d:3,t:"མིའི་ཆོས་བླ་མར་གྱུར་པའི་ཕམ་པ།"}
,{d:2,t:"དགེ་འདུན་ལྷག་མ་འཆད་པ།"}
,{d:3,t:"ཁུ་བ་འབྱིན་པའི་དགེ་འདུན་ལྷག་མ།"}
,{d:3,t:"རེག་པའི་དགེ་འདུན་ལྷག་མ།"}
,{d:3,t:"གནས་ངན་ལེན་གྱི་ཚིག་སྨྲ་བ་དང་བསྙིན་བཀུར་བསྔགས་པའི་དགེ་འདུན་ལྷག་མ།"}
,{d:3,t:"སྨྱན་བྱེད་པའི་དགེ་འདུན་ལྷག་མ།"}
,{d:3,t:"ཁང་པ་དང་གཙུག་ལག་ཁང་གི་དགེ་འདུན་ལྷག་མ།"}
,{d:3,t:"གཞི་མེད་པར་སྐུར་པ་འདེབས་པ་དང་གཞན་གྱི་ཆ་དང་མཐུན་པ་མ་ཡིན་པའི་དགེ་འདུན་ལྷག་མ།"}
,{d:3,t:"དབྱེན་བྱེད་པའི་དགེ་འདུན་ལྷག་མ།"}
,{d:2,t:"མ་ངེས་པ་དང་ལྡན་པ་འཆད་པ།"}
,{d:2,t:"སྤང་བའི་ལྟུང་བྱེད་འཆད་པ།"}
,{d:3,t:"འཆང་བའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"འབྲལ་བའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"འཇོག་པའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"འཁྲུར་འཇུག་པའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"ལེན་པའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"སློང་བའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"སློང་བར་རིགས་པའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྤགས་པ་སློང་བའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"སོ་སོ་ནས་སྤགས་པ་སློང་བའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྐུར་པའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྲིན་བལ་གྱི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བལ་ནག་པོ་འབའ་ཞིག་དང་ཆ་གཉིས་བསྲེས་པའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"ལོ་དྲུག་ཏུ་བཅང་བའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"མཐོ་གང་གི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བལ་ཐོགས་པའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བལ་རྨེལ་དུ་འཇུག་པའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"གསེར་དངུལ་ལ་རེག་པའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"མངོན་མཚན་ཅན་གྱི་སྤྱོད་པ་དང་ཉོ་ཚོང་བྱེད་པའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"ལྷུང་བཟེད་འཆང་བའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"ལྷུང་བཟེད་འཚོལ་བའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"འཐག་ཏུ་འཇུག་པའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"འཐག་པ་བསྐྱེད་པའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"འཕྲོག་པའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བརྟད་པ་ལས་བྱུང་བའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཞག་བདུན་ལ་འབྲལ་བའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"དབྱར་གྱི་རས་ཆེན་གྱི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བསྔོས་པ་ལས་བསྒྱུར་བའི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"གསོག་འཇོག་གི་སྤང་བའི་ལྟུང་བྱེད།"}
,{d:2,t:"ལྟུང་བྱེད་འབའ་ཞིག་པ་འཆད་པ།"}
,{d:3,t:"བརྫུན་དུ་སྨྲ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྐྱོན་ནས་སྨྲ་བ་དང་ཕྲ་མ་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྐྲོ་སྔོགས་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྟོན་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"འདོན་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"གནས་ངན་ལེན་དང་མིའི་ཆོས་བླ་མ་བརྫོད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྐུར་པ་འདེབས་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཁྱད་དུ་གསོད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ས་བོན་དང་སྐྱེ་བ་འཇིག་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"འཕྱ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བསྒོ་བ་རྣ་ལ་གཟོན་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"གནས་མལ་དང་གདིང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྐྲོད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཕྱིས་གནོན་གྱི་ལྟུང་བྱེད།"}
,{d:3,t:"རྩ་བ་འབྱུང་བ་ལ་འདུག་པ་དང་སྲོག་ཆགས་དང་བཅས་པ་ལ་སྦྱོད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"གཙུག་ལག་ཁང་གི་ལྟུང་བྱེད།"}
,{d:1,t:"འདུལ་བ་གཞུང་དམ་པ། ༼ན༽"}
,{d:2,t:"ཕམ་པར་འགྱུར་བ་རྣམས་བཤད་པ།"}
,{d:3,t:"མི་ཚངས་པར་སྤྱོད་པའི་ཕམ་པ།"}
,{d:3,t:"མ་བྱིན་ལེན་གྱི་ཕམ་པ"}
,{d:3,t:"གསོད་པའི་ཕམ་པ།"}
,{d:3,t:"བརྫུན་དུ་སྨྲ་བའི་ཕམ་པ"}
,{d:2,t:"དགེ་འདུན་ལྷག་མ་རྣམས་བཤད་པ།"}
,{d:3,t:"ཁུ་བ་འབྱིན་པའི་དགེ་འདུན་ལྷག་མ།"}
,{d:3,t:"ལུས་ཀྱིས་རེག་པའི་དགེ་འདུན་ལྷག་མ།"}
,{d:3,t:"སྤྲོད་པ་ལས་བྱུང་བ་དང་ལྡན་པ་སྨྲ་བ་དང་ཀུན་ཏུ་སྦྱོད་པས་བསྔགས་པའི་དགེ་འདུན་ལྷག་མ།"}
,{d:3,t:"སྨྱན་བྱེད་པའི་དགེ་འདུན་ལྷག་མ།"}
,{d:3,t:"ཁང་པ་དང་གཙུག་ལག་ཁང་གི་དགེ་འདུན་ལྷག་མ།"}
,{d:3,t:"གཞི་མེད་པར་སྐུར་པ་འདེབས་པ་དང་གཞན་གྱི་ཆ་མ་ཡིན་པ་དང་མཐུན་པའི་དགེ་འདུན་ལྷག་མ།"}
,{d:3,t:"བཀའ་བློ་མི་བདེ་བའི་དགེ་འདུན་ལྷག་མ།"}
,{d:2,t:"མ་ངེས་པའི་ཆོས་གཉིས་བཤད་པ།"}
,{d:2,t:"སྤང་བའི་ལྟུང་བྱེད་རྣམས་བཤད་པ།"}
,{d:3,t:"འཆང་བའི་སྤང་བ།"}
,{d:3,t:"འབྲལ་བའི་སྤང་བ།"}
,{d:3,t:"འཇོག་པའི་སྤང་བ།"}
,{d:3,t:"འཁྲུར་འཇུག་པའི་སྤང་བ།"}
,{d:3,t:"ལེན་པའི་སྤང་བ།"}
,{d:3,t:"སློང་བའི་སྤང་བ།"}
,{d:3,t:"སློང་བར་རིགས་པའི་སྤང་བ།"}
,{d:3,t:"སྤགས་པ་ལས་ལྷག་པ་སློང་བའི་སྤང་བ།"}
,{d:3,t:"སོ་སོ་ནས་སྤགས་པ་ལས་ལྷག་པ་སློང་བའི་སྤང་བ།"}
,{d:3,t:"སྐུར་པའི་སྤང་བ།"}
,{d:3,t:"སྲིན་བལ་གྱི་སྤང་བ་དང་བལ་ནག་པོ་འབའ་ཞིག་དང་ཆ་གཉིས་བསྲེ་བའི་སྤང་བ།"}
,{d:3,t:"ལོ་དྲུག་ཏུ་བཅང་བའི་སྤང་བ།"}
,{d:3,t:"མཐོ་གང་གི་སྤང་བ།"}
,{d:3,t:"བལ་ཐོགས་པའི་སྤང་བ།"}
,{d:3,t:"བལ་རྨེལ་དུ་འཇུག་པའི་སྤང་བ།"}
,{d:3,t:"གསེར་དངུལ་ལ་རེག་པའི་སྤང་བ།"}
,{d:3,t:"མངོན་མཚན་ཅན་གྱི་སྤང་བ་དང་ཉོ་ཚོང་བྱེད་པའི་སྤང་བ།"}
,{d:3,t:"ལྷུང་བཟེད་འཆང་བའི་སྤང་བ།"}
,{d:3,t:"ལྷུང་བཟེད་ཚོལ་བའི་སྤང་བ།"}
,{d:3,t:"འཐག་ཏུ་འཇུག་པའི་སྤང་བ།"}
,{d:3,t:"འཐག་པ་བསྐྱེད་པའི་སྤང་བ།"}
,{d:3,t:"འཕྲོག་པའི་སྤང་བ།"}
,{d:3,t:"བརྟད་པ་ལས་བྱུང་བའི་སྤང་བ།"}
,{d:3,t:"ཞག་བདུན་གྱི་འབྲལ་བའི་སྤང་བ།"}
,{d:3,t:"དབྱར་གྱི་རས་ཆེན་གྱི་སྤང་བ།"}
,{d:3,t:"བསྔོས་པ་ལས་བསྒྱུར་བའི་སྤང་བ།"}
,{d:3,t:"གསོག་འཇོག་གི་སྤང་བ།"}
,{d:2,t:"ལྟུང་བྱེད་འབའ་ཞིག་ཏུ་འགྱུར་བ་རྣམས་བཤད་པ།"}
,{d:3,t:"བརྫུན་དུ་སྨྲ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"མིའི་སྐྱོན་ནས་སྨྲ་བ་དང་དགེ་སློང་ལ་ཕྲ་མ་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྐྱོ་སྡོགས་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྟོན་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"འདོན་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"གནས་ངན་ལེན་དང་མིའི་མཆོག་བླ་མ་བརྫོད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྐུར་པ་འདེབས་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"བསླབ་པ་ཁྱད་དུ་གསོད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ས་བོན་དང་སྐྱེ་བ་འཇིག་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"འཕྱ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བསྒོ་བ་རྣ་ལ་གཟོན་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"གནས་མལ་དང་འདིང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྐྲོད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཕྱིས་གནོན་གྱི་ལྟུང་བྱེད།"}
,{d:3,t:"རྩ་བ་འབྱུང་བ་ལ་འདུག་པ་དང་སྲོག་ཆགས་དང་བཅས་པ་ལ་སྦྱོད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"གཙུག་ལག་ཁང་གི་ལྟུང་བྱེད།"}
,{d:3,t:"མ་བསྐོས་པར་སྟོན་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཉི་མ་ནུབ་ཀྱི་བར་དུ་སྟོན་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཟས་ཅུང་ཟད་ཙམ་གྱི་ཕྱིར་སྟོན་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"གོས་སྦྱིན་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"གོས་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"དགེ་སློང་མ་དང་འགྲོན་ལམ་དུ་འཇུག་པ་དང་ལྷན་ཅིག་གྲུར་འཇུག་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"གཅིག་པུ་འདུག་པ་དང་གཅིག་པུ་འགྲེང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"དགེ་སློང་མས་སྦྱོར་དུ་བཅུག་པ་ཟ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཡང་ཡང་ཟ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"འདུག་གནས་སུ་ཟ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"ལྷུང་བཟེད་དོ་གསུམ་ཙམ་ལས་ལྷག་པར་ལེན་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྟན་གཅིག་པའི་ཟས་ཀྱི་ལྟུང་བྱེད།"}
,{d:3,t:"སྤངས་པ་ལ་སྟོབས་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"འདུས་ཤིང་ཟ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"དུས་མ་ཡིན་པར་ཟ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"གསོག་འཇོག་གི་ལྟུང་བྱེད།"}
,{d:3,t:"བྱིན་ལེན་མ་བྱས་པར་ཟ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བསོད་པ་སློང་བ་དང་སྲོག་ཆགས་དང་བཅས་པའི་ཆུ་ལ་སྤྱོད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཉལ་པོ་བྱེད་པར་ཤོམ་པའི་ཁྱིམ་ན་འདུག་པ་དང་འགྲེང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"གཅེར་བུ་ལ་སྦྱིན་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"དམག་ལ་ལྟ་བ་དང་དམག་གི་ནང་ན་གནས་པ་དང་དཔུང་གི་ཡན་ལག་ཉམས་སུ་མྱོང་བར་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"རྡེག་པ་དང་གཟས་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"གནས་ངན་ལེན་འཆབ་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཟན་གཅོད་དུ་འཇུད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"མེ་ལ་རེག་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"འདུན་པ་ཕྱིར་བསྒྱུར་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"རྫོགས་པར་མ་བསྙིན་པ་དང་ལྷན་ཅིག་ཉལ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"ལྟ་བའི་རྣམ་པ་མི་གཏོང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྤངས་པའི་རྗེས་སུ་ཕྱོགས་པ་དང་བསྙིལ་བ་སྡུད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཁ་མ་བསྒྱུར་བའི་གོས་རྒྱོན་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ལོངས་པའི་གཞིར་གཏོགས་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཁྲུས་བྱེད་པ་དང་དུད་འགྲོ་གསོད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"འགྱོད་པ་སྐྱེས་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ག་ག་ཚིལ་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཆུ་ལ་རྩེ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བུད་མེད་དང་ལྷན་ཅིག་ཉལ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྔངས་པར་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"སྤེད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"བྱིན་པ་ལ་ཉེ་བར་འཚོ་བ་དང་སྐུར་པ་འདེབས་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"བུད་མེད་དང་ལྷན་ཅིག་འགྲོ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"རྐུན་མ་དང་ལྷན་ཅིག་འགྲོ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"མ་ལོན་པར་རྫོགས་པར་བསྙིན་པར་བྱེད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ས་རྐོ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"མགྲོན་དུ་གཉེར་བ་ལས་རིང་དུ་འདུག་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"བསླབ་པ་ལ་ཉེ་བར་འཇོག་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཉན་རྣ་བ་ལས་གྱུར་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"མི་སྨྲ་བར་འགྲོ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"མ་གུས་པའི་ཚུལ་གྱི་ལྟུང་བྱེད།"}
,{d:3,t:"མྱོས་པར་འགྱུར་བ་འཐུང་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"དུས་མ་ཡིན་པར་འགྲོ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"གྲོང་རྒྱུ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"རྒྱལ་པོའི་ཕོ་བྲང་དུ་ནུབ་མོ་འགྲོ་བའི་ལྟུང་བྱེད།"}
,{d:3,t:"བསླབ་པའི་གཞིའི་དངོས་པོ་ལ་ཁྱད་དུ་གསོད་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཁབ་རལ་བཅོས་པའི་ལྟུང་བྱེད།"}
,{d:3,t:"ཁྲི་རྐང་འཆོས་པ་དང་ཤིང་བལ་གྱི་གོས་པར་བྱས་པ་གདིང་བ་ལས་གྱུར་པ་གཡན་པ་དགབ་པ་ལས་གྱུར་པ་དབྱར་གྱི་རས་ཆེན་ལས་གྱུར་པ་བདེ་བར་གཤེགས་པའི་ཆོས་གོས་ཀྱི་ཚད་ལས་གྱུར་པ་ལ་སོགས་པའི་ལྟུང་བྱེད།"}
,{d:2,t:"སོ་སོར་བཤགས་པར་བྱ་བ་རྣམས་བཤད་པ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་དང་པོ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་གཉིས་པ"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་གསུམ་པ།"}
,{d:3,t:"སོ་སོར་བཤགས་པར་བྱ་བ་བཞི་པ།"}
,{d:2,t:"བསྙེན་པར་རྗོགས་པའི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"གསོ་སྦྱོང་གི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"སྐབས་འབྱེད་པའི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"དབྱར་གྱི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"པགས་པའི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"སྨན་གྱི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"གོས་ཀྱི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"གཏན་པའི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"ཡུལ་ཀཽ་ཤམྦྷི་ཀའི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"དམར་སྐྱའི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"གང་ཟག་གི་དངོས་པོ་དང་། ཆད་པའི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"གསོ་སྦྱོང་དགག་པའི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"མལ་སྟན་གྱི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"རྩོད་བའི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"དགེ་འདུན་གྱི་དབྱེན་གྱི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"འདུལ་བར་བྱེད་པ་བཤད་པ།(སྟོད)"}
,{d:1,t:"འདུལ་བ་གཞུང་དམ་པ། ༼པ༽"}
,{d:2,t:"འདུལ་བར་བྱེད་པ་བཤད་པ།(སྨད)"}
,{d:2,t:"གཅིག་ནས་འཛེགས་པ་བཤད་པ།"}
,{d:3,t:"གཅིག་པ་བཤད་པ།"}
,{d:3,t:"འདུལ་བ་གཅིག་པོ་ཡན་ཆད་པའི་སྒོ་དང་པོ་བཤད་པཤད་པ"}
,{d:3,t:"སྒོ་གཉིས་པ་བཤད་པ།"}
,{d:3,t:"སྒོ་གསུམ་པ་བཤད་པ།"}
,{d:2,t:"ལྔ་ཚན་སྐོར་བཤད་པ།"}
,{d:2,t:"འདུལ་བ་ལས་བྱུང་བ་རྣམ་པ་བཅུ་དྲུག་བཤད་པ།"}
,{d:2,t:"གླེང་གཞི་རྣམས་བཤད་པ།"}
,{d:3,t:"གླེང་གཞིའི་སྒོ་དང་པོ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་ཐོག་མའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་དང་པོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ།"}
,{d:3,t:"གླེང་གཞིའི་སྒོ་གཉིས་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གཉིས་པ་སྟེ་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གཉིས་པ་སྟེ་ཚིགས་ས་བཅད་པ་དགུ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ།"}
,{d:3,t:"གླེང་གཞིའི་སྒོ་གསུམ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་ནང་ནས་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་ནང་ནས་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་ནང་ནས་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་ནང་ནས་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ།"}
,{d:3,t:"གླེང་གཞིའི་སྒོ་བཞི་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་ནང་ནས་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ།"}
,{d:3,t:"གླེང་གཞིའི་སྒོ་ལྔ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་ལྔ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་ལྔ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་ལྔ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་ལྔ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་ལྔ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ།"}
,{d:4,t:"གླེང་གཞིའི་སྒོ་ལྔ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལདྲུག་པ་བཤད་པ།"}
,{d:2,t:"རྐྱང་པའི་སྒོ་བཤད་པ།"}
,{d:3,t:"རྐྱང་པའི་སྒོ་དང་པོ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་ཐོག་མ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་ནང་ནས་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་དང་པོའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ།"}
,{d:3,t:"རྐྱང་པའི་སྒོ་གཉིས་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གཉིས་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ།"}
,{d:3,t:"རྐྱང་པའི་སྒོ་གསུམ་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་གསུམ་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ།"}
,{d:3,t:"རྐྱང་པའི་སྒོ་བཞི་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོའི་མདོ་བཞི་པའི་ཚིགས་སུ་བཅད་པ་དང་པོ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཞི་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དྲུག་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བདུན་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་དགུ་པ་བཤད་པ།"}
,{d:4,t:"རྐྱང་པའི་སྒོ་བཞི་པའི་མདོའི་ཚིགས་སུ་བཅད་པ་བཅུ་པ་བཤད་པ།"}
,{d:2,t:"འདུལ་བ་གཞུང་དམ་པ་ལས་གཏམ་གྱི་དངོས་པོ་བཤད་པ།"}
,{d:2,t:"འདུལ་བ་གཞུང་དམ་པ་ལས་མ་ན་བི་ཀ་ཞེས་བྱ་བ་བཤད་པ།"}
,{d:3,t:"འདུལ་བ་གཞུང་དམ་པ་ལས་མ་ན་བི་ཀ་བའི་སྒོ་དང་པོ་བཤད་པ།"}
,{d:3,t:"འདུལ་བ་གཞུང་དམ་པ་མ་ན་བི་ཀ་ཞེས་བྱ་བའི་འདུལ་བའི་རིམ་པ་བཤད་པ།"}
,{d:2,t:"འདུལ་བ་གཞུང་དམ་པ་ལས་མ་ལྟ་བུ་བཤད་པ།"}
,{d:3,t:"འདུལ་བ་གཞུང་དམ་པ་ལས་མ་ལྟ་བུའི་བསྙེན་པར་རྫོགས་པའི་ཕུང་པོ་དང་པོ་བཤད་པ།"}
,{d:4,t:"མ་ལྟ་བུ་ལས་དངོས་པོ་གཉིས་ཀྱི་ལེའུ་བཤད་པ།"}
,{d:4,t:"མ་ལྟ་བུའི་རབ་ཏུ་ལྡན་པའི་ཕུང་པོ་ཞེས་བྱ་བ་ཕུང་པོ་གཉིས་པ་བཤད་པ།"}
,{d:4,t:"མ་ལྟ་བུའི་དུམ་བུ་གསུམ་པོའི་དངོས་པོ་བཤད་པ།"}
,{d:4,t:"མ་ལྟ་བུའི་བྱ་བའི་ཕུང་པོ་ཞེས་བྱ་བའི་ཕུང་པོ་གསུམ་པ་བཤད་པ།"}
,{d:4,t:"ཨུ་པཱ་ལིས་ཀུན་དྲིས་པ་བཤད་པ།"}
,{d:1,t:"འཕགས་པ་བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་གྱི་རྒྱལ་པོ།"}
,{d:1,t:"འཕགས་པ་བྱམས་པའི་སྨོན་ལམ།"}
,{d:1,t:"མཆོག་གི་སྤྱོད་པའི་སྨོན་ལམ།"}
,{d:1,t:"མར་མེའི་ལོ་རྒྱུས་དང་སྨོན་ལམ་གྱི་མདོ།"}
,{d:1,t:"འཕགས་པ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས་གསུངས་པའི་སྨོན་ལམ།"}
,{d:1,t:"འཕགས་པ་སྟོང་ཆེན་མོ་རབ་ཏུ་འཇོམས་པ་ལས་གསུངས་པའི་སྨོན་ལམ།"}
,{d:1,t:"རིགས་སྔགས་ཀྱི་རྒྱལ་མོ་རྨ་བྱ་ཆེན་མོ་ལས་གསུངས་པའི་སྨོན་ལམ་དང་བདེན་ཚིག །"}
,{d:1,t:"ཡངས་པའི་གྲོང་ཁྱེར་དུ་འཇུག་པའི་བདེ་ལེགས་ཀྱི་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"བདེ་ལེགས་ཀྱི་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"བདེ་ལེགས་སུ་འགྱུར་བའི་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"ཤིས་པར་བརྗོད་པའི་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"དཀོན་མཆོག་གསུམ་གྱི་བཀྲ་ཤིས་ཀྱི་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་སོགས་པ་གསུམ་གྱིས་བཀྲ་ཤིས་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"བཅོམ་ལྡན་འདས་ལ་ལྷའི་རྒྱལ་པོ་རབ་མཚེ་མས་བཀྲ་ཤིས་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"བཅོམ་ལྡན་འདས་ལ་ལྷའི་རྒྱལ་པོ་རབ་དགའ་ལྡན་གྱིས་བཀྲ་ཤིས་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"ལྷས་ཞུས་པའི་བཀྲ་ཤིས་ཀྱི་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"སངས་རྒྱས་རབས་བདུན་གྱི་བཀྲ་ཤིས་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"བཀྲ་ཤིས་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ཀ༽"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཤཱ་རིའི་བུའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། རབ་འབྱོར་གྱི་ལེའུ། (སྟོད)"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ཁ༽"}
,{d:2,t:"གསུམ་པ། རབ་འབྱོར་གྱི་ལེའུ། (སྨད)"}
,{d:2,t:"བཞི་པ། སྐྱོན་མེད་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། ཀུན་ཏུ་རྒྱུ་བཟོ་སྦྱངས་ཀྱི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། མཚན་མ་མེད་པའི་ལེའུ། (སྟོད)"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ག༽"}
,{d:2,t:"དྲུག་པ། མཚན་མ་མེད་པའི་ལེའུ། (སྨད)"}
,{d:2,t:"བདུན་པ། སྒྱུ་མ་ལྟ་བུའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལེའུ། (སྟོད)"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ང༽"}
,{d:2,t:"བརྒྱད་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལེའུ། (སྨད)"}
,{d:2,t:"དགུ་པ། ཏིང་ངེ་འཛིན་གྱི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། ལམ་དང་གཟུངས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། ངེས་འབྱུང་གི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། ཟིལ་གྱིས་གནོན་པའི་ལེའུ།"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ཅ༽"}
,{d:2,t:"བཅུ་གསུམ་པ། གཉིས་སུ་མེད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། རབ་འབྱོར་གྱི་ལེའུ། (སྟོད)"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ཆ༽"}
,{d:2,t:"བཅུ་བཞི་པ། རབ་འབྱོར་གྱི་ལེའུ། (སྨད)"}
,{d:2,t:"བཅོ་ལྔ་པ། བརྒྱ་བྱིན་གྱི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། རྟོགས་པར་དཀའ་བའི་ལེའུ། "}
,{d:2,t:"བཅུ་བདུན་པ། མཐའ་ཡས་ལུང་སྟོན་གྱི་ལེའུ། (སྟོད)"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ཇ༽"}
,{d:2,t:"བཅུ་བདུན་པ། མཐའ་ཡས་ལུང་སྟོན་གྱི་ལེའུ། (སྨད)"}
,{d:2,t:"བཅོ་བརྒྱད་པ། ཡོན་ཏན་ཡོངས་སུ་གཟུང་བའི་ལེའུ། "}
,{d:2,t:"བཅུ་དགུ་པ། མཆོད་རྟེན་ལ་བསྙེན་བཀུར་བྱས་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པའི་ལེའུ། "}
,{d:2,t:"ཉེར་གཅིག་པ། ཀུན་དུ་རྒྱུ་བཟློག་པའི་ལེའུ། "}
,{d:2,t:"ཉེར་གཉིས་པ། མཆོད་རྟེན་གྱི་ལེའུ། "}
,{d:2,t:"ཉེར་གསུམ་པ། སྐུ་གདུང་གི་ལེའུ།"}
,{d:2,t:"ཉེར་བཞི་་པ། བསོད་ནམས་ཀྱི་རྣམ་གྲངས་ཀྱི་ལེའུ། (སྟོད)"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ཉ༽"}
,{d:2,t:"ཉེར་བཞི་་པ། བསོད་ནམས་ཀྱི་རྣམ་གྲངས་ཀྱི་ལེའུ། (སྨད)"}
,{d:2,t:"ཉེར་ལྔ་པ། རྗེས་སུ་ཡི་རང་དང་བསྔོ་བའི་ལེའུ།"}
,{d:2,t:" ཉ���ར་དྲུག་པ། སྒྲུབ་པའི་ལེའུ།"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ཏ༽"}
,{d:2,t:"ཉེར་བདུན་པ། དམྱལ་བའི་ལེའུ། (སྟོད)"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ཐ༽"}
,{d:2,t:"ཉེར་བདུན་པ། དམྱལ་བའི་ལེའུ། (སྨད)"}
,{d:2,t:"ཉེར་བརྒྱད་པ། རྣམ་པར་དག་པའི་ལེའུ། (སྟོད)"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ད༽"}
,{d:2,t:"ཉེར་བརྒྱད་པ། རྣམ་པར་དག་པའི་ལེའུ། (སྨད)"}
,{d:2,t:"ཉེར་དགུ་པ། གནས་མེད་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་པ། དམིགས་པ་མེད་པའི་ལེའུ།"}
,{d:2,t:"སོ་གཅིག་པ། བྱང་ཕྱོགས་ཀྱི་རྒྱུད་ཀྱི་ལེའུ། (སྟོད)"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ན༽"}
,{d:2,t:"སོ་གཅིག་པ། བྱང་ཕྱོགས་ཀྱི་རྒྱུད་ཀྱི་ལེའུ། (སྨད)"}
,{d:2,t:"སོ་གཉིས་པ། བདུད་ཀྱི་ལས་ཀྱི་ལེའུ།"}
,{d:2,t:"སོ་གསུམ་པ། འཇིག་རྟེན་སྟོན་པའི་ལེའུ།"}
,{d:2,t:"སོ་བཞི་པ། མི་མཉམ་པ་དང་མཉམ་པའི་ལེའུ།"}
,{d:2,t:"སོ་ལྔ་པ། འདུས་པའི་ལེའུ།"}
,{d:2,t:"སོ་དྲུག་པ། གྲུའི་ལེའུ།"}
,{d:2,t:"སོ་བདུན་པ། ངོ་བོ་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"སོ་བརྒྱད་པ། ཆགས་པ་མེད་པའི་ལེའུ། (སྟོད)"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼པ༽"}
,{d:2,t:"སོ་བརྒྱད་པ། ཆགས་པ་མེད་པའི་ལེའུ། (སྨད)"}
,{d:2,t:"སོ་དགུ་པ། བྱང་ཆུབ་སེམས་ཀྱི་བསླབ་པ་རྣམ་པར་གཞག་པའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་པ། སྦྱོར་ལམ་གྱི་རྟགས་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཞེ་གཅིག་པ། ཕྱིར་མི་ལྡོག་པའི་རྟགས་ཀྱི་ལེའུ།"}
,{d:2,t:"ཞེ་གཉིས་པ། ཐབས་ལ་མཁས་པའི་ལེའུ།"}
,{d:2,t:"ཞེ་གསུམ་པ། ཞིང་སྦྱོང་བའི་ཐབས་ལ་མཁས་པའི་ལེའུ།"}
,{d:2,t:"ཞེ་བཞི་པ། གང་གཱའི་ལྷ་མོའི་ལེའུ།"}
,{d:2,t:"ཞེ་ལྔ་པ། རྣམ་ཐར་སྒོ་གསུམ་གྱི་ཐབས་ལ་མཁས་པའི་ལེའུ།"}
,{d:2,t:"ཞེ་དྲུག་པ། རྣམ་པར་རྟོག་པ་སྤང་བའི་ལེའུ།"}
,{d:2,t:"ཞེ་བདུན་པ། སྤྱོད་པའི་ལེའུ།"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ཕ༽"}
,{d:2,t:"ཞེ་བརྒྱད་པ། བསླབ་པ་མཉམ་པའི་ལེའུ།"}
,{d:2,t:"ཞེ་དགུ་པ། རྣམ་པར་མི་རྟོག་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་པ། ཆགས་པ་མེད་པའི་ལེའུ།"}
,{d:2,t:"ང་གཅིག་པ། ཡོངས་སུ་གཏད་པའི་ལེའུ།"}
,{d:2,t:"ང་གཉིས་པ། མི་ཟད་པའི་ལེའུ།"}
,{d:2,t:"ང་གསུམ་པ། ཐོད་རྒལ་གྱི་ལེའུ།"}
,{d:2,t:"ང་བཞི་པ། ཆོས་གཉིས་ཀྱི་ཞུ་བ་མང་བའི་ལེའུ།"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼བ༽"}
,{d:2,t:"ང་ལྔ་པ། ཡང་དག་པར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ང་དྲུག་པ། དགེ་བའི་བཤེས་གཉེན་ལ་བསྙེན་བཀུར་བའི་ལེའུ།"}
,{d:2,t:"ང་བདུན་པ། སྦྱིན་པའི་ལེའུ།"}
,{d:2,t:"ང་བརྒྱད་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་ཐབས་ཀྱི་ལེའུ།"}
,{d:2,t:"ང་དགུ་པ། རྣམ་འཕེལ་གྱི་ལེའུ།"}
,{d:2,t:"དྲུག་བཅུ་པ། མཐར་གྱིས་པའི་ལེའུ།"}
,{d:2,t:"རེ་གཅིག་པ། མཚན་མ་མེད་པའི་ལེའུ།"}
,{d:2,t:"རེ་གཉིས་པ། མཚན་ཉིད་མེད་པའི་ལེའུ།"}
,{d:2,t:"རེ་གསུམ་པ། མཚན་དཔེའི་ལེའུ། (སྟོད)"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་བརྒྱ་པ། ༼ཨ༽"}
,{d:2,t:"རེ་གསུམ་པ། མཚན་དཔེའི་ལེའུ། (སྨད)"}
,{d:2,t:"རེ་བཞི་པ། མཉམ་པ་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"རེ་ལྔ་པ། ཆོས་ཉིད་འཁྲུག་པ་མེད་པའི་ལེའུ།"}
,{d:2,t:"རེ་དྲུག་པ། མི་དམིགས་པ་དང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པའི་བྱེད་པའི་ཕྲིན་ལས་སྟོན་པའི་ལེའུ།"}
,{d:2,t:"རེ་བདུན་པ། སངས་རྒྱས་ཀྱི་ཞིང་ད་ག་པའི་ལེའུ།"}
,{d:2,t:"རེ་བརྒྱད་པ།  སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ལེའུ།"}
,{d:2,t:"རེ་དགུ་པ། དངོས་པོ་དང་དངོས་པོ་མེད་པའི་སེམས་ཅན་ལེའུ།"}
,{d:2,t:"བདུན་ཅུ་པ། ཀུན་ནས་ཉོན་མོངས་དང་རྣམ་བྱང་མེད་པའི་ལེའུ།"}
,{d:2,t:"དོན་གཅིག་པ། དོན་དམ་པའི་རྣལ་འབྱོར་གྱི་ལེའུ།"}
,{d:2,t:"དོན་གཉིས་པ། ཆོས་ཉིད་མི་འགྱུར་བ་བསྟན་པའི་ལེའུ།"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།༼ཀ༽"}
,{d:2,t:"ལེའུ་དང་པོ།"}
,{d:2,t:"ལེའུ་གཉིས་པ།"}
,{d:2,t:"ལེའུ་གསུམ་པ།"}
,{d:2,t:"ལེའུ་བཞི་པ།"}
,{d:2,t:"ལེའུ་ལྔ་པ།"}
,{d:2,t:"ལེའུ་དྲུག་པ།"}
,{d:2,t:"ལེའུ་བདུན་པ།"}
,{d:2,t:"ལེའུ་བརྒྱད་པ།"}
,{d:2,t:"ལེའུ་དགུ་པ།"}
,{d:2,t:"འེའུ་བཅུ་པ།"}
,{d:2,t:"ལེའུ་བཅུ་གཅིག་པ།(སྟོད)"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།༼ཁ༽"}
,{d:2,t:"ལེའུ་བཅུ་གཅིག་པ།(སྨད)"}
,{d:2,t:"ལེའུ་བཅུ་གཉིས་པ།"}
,{d:2,t:"ལེའུ་བཅུ་གསུམ་པ།"}
,{d:2,t:"ལེའུ་བཅུ་བཞི་པ།"}
,{d:2,t:"ལེའུ་བཅོ་ལྔ་པ།"}
,{d:2,t:"ལེའུ་བཅུ་དྲུག་པ།"}
,{d:2,t:"ལེའུ་བཅུ་བདུན་པ།"}
,{d:2,t:"ལེའུ་བཅོ་བརྒྱད་པ།"}
,{d:2,t:"ལེའུ་བཅུ་དགུ་པ།"}
,{d:2,t:"ལེའུ་ཉི་ཤུ་པ།"}
,{d:2,t:"ལེའུ་ཉི་ཤུ་གཅིག་པ།"}
,{d:2,t:"ལེའུ་ཉི་ཤུ་གཉིས་པ།"}
,{d:2,t:"ལེའུ་ཉི་ཤུ་གསུམ་པ།"}
,{d:2,t:"ལེའུ་ཉི་ཤུ་བཞི་པ།"}
,{d:2,t:"ལེའུ་ཉི་ཤུ་ལྔ་པ།"}
,{d:2,t:"ལེའུ་ཉི་ཤུ་དྲུག་པ།"}
,{d:2,t:"ལེའུ་ཉི་ཤུ་བདུན་པ།"}
,{d:2,t:"ལེའུ་ཉི་ཤུ་བརྒྱད་པ།"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།༼ག༽"}
,{d:2,t:"ལེའུ་ཉི་ཤུ་དགུ་པ།"}
,{d:2,t:"ལེའུ་ཉི་ཤུ་དགུ་པ།"}
,{d:2,t:"ལེའུ་སུམ་ཅུ་པ།"}
,{d:2,t:"ལེའུ་སུམ་ཅུ་གཅིག་པ།"}
,{d:2,t:"ལེའུ་སུམ་ཅུ་གཉིས་པ།"}
,{d:2,t:"ལེའུ་སུམ་ཅུ་གསུམ་པ།"}
,{d:2,t:"ལེའུ་སུམ་ཅུ་བཞི་པ།"}
,{d:2,t:"ལེའུ་སུམ་ཅུ་ལྔ་པ།"}
,{d:2,t:"ལེའུ་སུམ་ཅུ་དྲུག་པ།"}
,{d:2,t:"ལེའུ་སུམ་ཅུ་བདུན་པ།"}
,{d:2,t:"ལེའུ་སུམ་ཅུ་བརྒྱད་པ།"}
,{d:2,t:"ལེའུ་སུམ་ཅུ་དགུ་པ།"}
,{d:2,t:"ལེའུ་བཞི་བཅུ་པ།"}
,{d:2,t:"ལེའུ་བཞི་བཅུ་གཅིག་པ།"}
,{d:2,t:"ལེའུ་བཞི་བཅུ་གཉིས་པ།"}
,{d:2,t:"ལེའུ་བཞི་བཅུ་གསུམ་པ།"}
,{d:2,t:"ལེའུ་བཞི་བཅུ་བཞི་པ།"}
,{d:2,t:"ལེའུ་བཞི་བཅུ་ལྔ་པ།"}
,{d:2,t:"ལེའུ་བཞི་བཅུ་དྲུག་པ།"}
,{d:2,t:"ལེའུ་བཞི་བཅུ་བདུན་པ།"}
,{d:2,t:"ལེའུ་བཞི་བཅུ་བརྒྱད་པ།"}
,{d:2,t:"ལེའུ་བཞི་བཅུ་དགུ་པ།"}
,{d:2,t:"ལེའུ་ལྔ་བཅུ་པ།"}
,{d:2,t:"ལེའུ་ལྔ་བཅུ་གཅིག་པ།"}
,{d:2,t:"ལེའུ་ལྔ་བཅུ་གཉིས་པ།"}
,{d:2,t:"ལེའུ་ལྔ་བཅུ་གསུམ་པ། (སྟོད)"}
,{d:1,t:"ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། ༼ང་༽"}
,{d:2,t:"ལེའུ་ལྔ་བཅུ་གསུམ་པ། (སྨད)"}
,{d:2,t:"ལེའུ་ལྔ་བཅུ་བཞི་པ།"}
,{d:2,t:"ལེའུ་ལྔ་བཅུ་ལྔ་པ།"}
,{d:2,t:"ལེའུ་ལྔ་བཅུ་དྲུག་པ།"}
,{d:2,t:"ལེའུ་ལྔ་བཅུ་བདུན་པ།"}
,{d:2,t:"ལེའུ་ལྔ་བཅུ་བརྒྱད་པ།"}
,{d:2,t:"ལེའུ་ལྔ་བཅུ་དགུ་པ།"}
,{d:2,t:"ལེའུ་དྲུག་ཅུ་པ།"}
,{d:2,t:"ལེའུ་དྲུག་ཅུ་གཅིག་པ།"}
,{d:2,t:"ལེའུ་དྲུག་ཅུ་གཉིས་པ།"}
,{d:2,t:"ལེའུ་དྲུག་ཅུ་གསུམ་པ།"}
,{d:2,t:"ལེའུ་དྲུག་ཅུ་བཞི་པ།"}
,{d:2,t:"ལེའུ་དྲུག་ཅུ་ལྔ་པ།"}
,{d:2,t:"ལེའུ་དྲུག་ཅུ་དྲུག་པ།"}
,{d:2,t:"ལེའུ་དྲུག་ཅུ་བདུན་པ།"}
,{d:2,t:"ལེའུ་དྲུག་ཅུ་བརྒྱད་པ།"}
,{d:2,t:"ལེའུ་དྲུག་ཅུ་དགུ་པ།"}
,{d:2,t:"ལེའུ་བདུན་བཅུ་པ།"}
,{d:2,t:"ལེའུ་བདུན་ཅུ་གཅིག་པ།"}
,{d:2,t:"ལེའུ་བདུན་ཅུ་གཉིས་པ།"}
,{d:2,t:"ལེའུ་བདུན་ཅུ་གསུམ་པ།"}
,{d:2,t:"ལེའུ་བདུན་ཅུ་བཞི་པ།"}
,{d:2,t:"ལེའུ་བདུན་ཅུ་ལྔ་པ།"}
,{d:2,t:"ལེའུ་བདུན་ཅུ་དྲུག་པ།"}
,{d:2,t:"ལེའུ་བདུན་ཅུ་བདུན་པ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་བརྒྱད་སྟོང་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ༼ཀ༽"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། སེམས་བསྐྱེད་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། ཉེ་བར་བརྟག་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། མི་མཉམ་པ་དང་མཉམ་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། ལྗགས་ཀྱི་དབང་པོའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། རབ་འབྱོར་གྱི་ལེའུ།"}
,{d:2,t:"བདུན་པ། སྐྱོན་མེད་པ་ལ་འཇུག་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། ཀུན་ཏུ་རྒྱུ་བཟོ་སྦྱངས་ཀྱི་ལེའུ།"}
,{d:2,t:"དགུ་པ། མཚན་མའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། སྒྱུ་མ་ལྟ་བུའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། ཁྲེལ་ཡོད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། ལྟ་བ་སྤོང་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། མ་བཅིངས་མ་གྲོལ་བའི་ལེའུ"}
,{d:2,t:"བཅོ་ལྔ་པ། ཏིང་ངེ་འཛིན་གྱི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། གཟུངས་ཀྱི་སྒོར་འཇུག་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། ས་ཡོངས་སུ་སྦྱང་བའི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། ཐེག་པ་ཆེན་པོའི་ས་ངེས་པར་འབྱུང་བ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། ཟིལ་གྱིས་གནོན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། གཉིས་སུ་མེད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། གནས་བརྟན་རབ་འབྱོར་གྱི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། བརྒྱ་བྱིན་གྱི་ལེའུ་དང་པོ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། རྟོགས་པར་དཀའ་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། མཐའ་ཡས་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། བརྒྱ་བྱིན་གྱི་ལེའུ་གཉིས་པ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། ཡོངས་སུ་བཟུང་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། མཆོད་རྟེན་གྱི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བརྒྱད་པ། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡོན་ཏ་ན་ཡོངས་སུ་བརྗོད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དགུ་པ། གཞན་མུ་སྟེགས་ཅན་གྱི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་བརྒྱད་སྟོང་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"སུམ་ཅུ་པ། རི་མོ་བྱེད་པའི་ཕན་ཡོན་གྱི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཅིག་པ། སྐུ་གདུང་གི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཉིས་པ། བསོད་ནམས་ཀྱི་ཁྱད་པར་གྱི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གསུམ་པ། ཡོངས་སུ་བསྔོ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བཞི་པ། མངོན་པར་བསྒྲུབ་པའི་ཡོན་ཏན་ཡང་དག་པར་བསྔགས་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་ལྔ་པ། སེམས་ཅན་དམྱལ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དྲུག་པ། ཆོས་ཐམས་ཅད་རྣམ་པར་དག་པར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བདུན་པ། གནས་མེད་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བརྒྱད་པ། དམིགས་སུ་མེད་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དགུ་པ། བྱང་ཕྱོགས་ཀྱི་རྒྱུད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་པ། བདུད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གཅིག་པ། བདུད་ཀྱི་ཆོགས་པ་དང་མི་ལྡན་པའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གཉིས་པ། འཇིག་རྟེན་སྟོན་པའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གསུམ་པ། བསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བཞི་པ། འདུས་པའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་ལྔ་པ། གྲུའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་དྲུག་པ། འདོད་ཆགས་འདུལ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་བདུན་པ། འདོད་ཆགས་འདུལ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བརྒྱད་པ། བྱང་ཆུབ་སེམས་དའི་བསླབ་པ་རྣམ་པར་གཞག་པའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་དགུ་པ། ཕྱིར་མི་ལྡོག་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་པ། ཕྱིར་མི་ལྡོག་པའི་རྟགས་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་གཅིག་པ། ཐབས་ལ་མཁས་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་གཉིས་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་ཐབས་ཡོངས་སུ་རྫོགས་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་གསུམ་པ། གང་གཱའི་ལྷ་མོ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་བཞི་པ། ཐབས་ལ་མཁས་པ་སྒོམ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་ལྔ་པ། རྣམ་པར་རྟོག་པ་སྤང་བར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་དྲུག་པ། བསླབ་པ་མཉམ་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་བདུན་པ། སྤྱིད་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་བརྒྱད་པ། རྣམ་པར་མི་རྟོག་པ་བསྟན་པའི་དཔེ་བརྗོད་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་དགུ་པ། ཆགས་པ་མེད་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་པ། ཡོངས་སུ་གཏད་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་གཅིག་པ། མི་ཟད་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་གཉིས་པ། ཐོད་རྒལ་དུ་སྙོམས་པར་འཇུག་པའི་ཁེའུ"}
,{d:2,t:"དྲུག་ཅུ་རྩ་གསུམ་པ། ཆོས་གཉིས་ཀྱི་ཞུ་བ་མང་པོའི་ལེའུ། (སྟོད)"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་བརྒྱད་སྟོང་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ༼ག༽"}
,{d:2,t:"དྲུག་ཅུ་རྩ་གསུམ་པ། ཆོས་གཉིས་ཀྱི་ཞུ་བ་མང་པོའི་ལེའུ། (སྨད)"}
,{d:2,t:"དྲུག་ཅུ་རྩ་བཞི་པ། ཡང་ད་ག་པར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་ལྔ་པ། བསྙེན་བཀུར་བྱ་བའི་ཐབས་ཀྱི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་དྲུག་པ། ཐབས་ལ་མཁས་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་བདུན་པ། ཚུལ་ཁྲིམས་ཀྱི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་བརྒྱད་པ། རྣམ་པར་འཕེལ་བའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་དགུ་པ། ལམ་བསྒོམ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བདུན་ཅུ་པ། མཐར་གྱིས་བྱ་བ་ད་ང་། བསླབ་པ་ད་ང་། བསྒྲུབ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བདུན་ཅུ་རྩ་གཅིག་པ། དམིགས་སུ་མེད་པའི་ཆོས་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"བདུན་ཅུ་རྩ་གཉིས་པ། མཚན་ཉིད་མེད་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བདུན་ཅུ་རྩ་གསུམ་པ། ཡི་གེ་མངོན་པར་བསྒྲུབ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བདུན་ཅུ་རྩ་བཞི་པ། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བདུན་ཅུ་རྩ་ལྔ་པ། མི་འཁྲུགས་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བདུན་ཅུ་རྩ་དྲུག་པ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་གོ་ཆའི་ལེའུ།"}
,{d:2,t:"བདུན་ཅུ་རྩ་བདུན་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་ད་ག་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བདུན་ཅུ་རྩ་བརྒྱད་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཐབས་ལ་མཁས་པ་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བདུན་ཅུ་རྩ་དགུ་པ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་ཅུ་པ། ཀུན་ནས་ཉོན་མོངས་པ་ད་ང་རྣམ་པར་བྱང་བ་མེད་པའི་ཁེའུ"}
,{d:2,t:"བརྒྱད་ཅུ་རྩ་གཅིག་པ། དོན་དམ་པའི་རྣལ་འབྱོར་གྱི་ལེའུ།"}
,{d:2,t:"བརྒྱད་ཅུ་རྩ་གཉིས་པ། ཆོས་ཉིད་འགྱུར་བ་མེད་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་ཅུ་རྩ་གསུམ་པ། བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་རབ་ཏུ་ད་བྱེ་་ བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་ཅུ་རྩ་བཞི་པ། སྡུད་པའི་ཚིགས་སུ་བ་ཅད་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་ཅུ་རྩ་ལྔ་པ། རྟག་ཏུ་ངུའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་ཅུ་རྩ་དྲུག་པ། ཆོས་འཕགས་ཀྱི་ལེའུ།"}
,{d:2,t:"བརྒྱད་ཅུ་རྩ་བདུན་པ། ཡོངས་སུ་གཏ་ད་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཆོས་ཐམས་ཅད་ཀྱི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། མངོན་པར་ཞེན་པ་མེད་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། རྣལ་འབྱོར་གྱི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། བྱང་ཆུབ་སེམས་དཔའི་ཚིག་བླ་དྭགས་ཀྱི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། བསླབ་པའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། མི་དམིགས་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། སྐྱོན་མེད་པའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། བསྟན་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ།"}
,{d:2,t:"བཅུ་པ། མངོན་པར་ཤེས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། མི་གནས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། ཏིང་ངེ་འཛིན་གྱི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། ནམ་མཁའ་ལྟ་བུ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། འོང་བ་དང་འགྲོ་བ་མེད་པའི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། རྣམ་པར་རྟོག་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། ཕན་ཡོན་གྱི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། རྣམ་པར་དག་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། བྱེད་པ་པོ་དང་བྱེད་པ་པོ་མེད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། ཡོན་ཏན་གྱི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་གཅིག་པ། སྔ་ལྟས་ཀྱི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་གཉིས་པ། བསྒོམ་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་གསུམ་པ། ཡོངས་སུ་གཟུང་བ་མེད་པ་དང་སྤང་བ་མེད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་བཞི་པ། དང་པོ་འཇུག་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་ལྔ་པ། ཐབས་ལ་མཁས་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་དྲུག་པ། རྗེས་སུ་ཡི་རང་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་བདུན་པ། ཕ་རོལ་ཏུ་ཕྲིན་པ་ཡོངས་སུ་བསྡུ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་བརྒྱད་པ། མཚན་ཉིད་མི་འདྲ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་དགུ་པ། ཆོས་ཀྱི་སྦྱིན་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་པ། རང་བཞིན་གྱི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་གཅིག་པ། ཕྱིར་མི་ལྡོག་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་གཉིས་པ། མངོན་པར་བྱང་ཆུབ་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་གསུམ་པ། མཇུག་སྡུད་ཀྱི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བརྒྱད་སྟོང་པ།"}
,{d:2,t:"དང་པོ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྦྱོད་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། བརྒྱ་བྱིན་གྱི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མཆོད་རྟེན་ལ་བཀུར་སྟིར་བྱེད་པ་གཞལ་དུ་མེད་པའི་ཡོན་ཏན་འཛིན་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། བསོད་ནམས་ཀྱི་རྣམ་གྲངས་ཀྱི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། རྗེས་སུ་ཡི་རང་བ་དང་ཡོངས་སུ་བསྔོ་བའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། དམྱལ་བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། རྣམ་པར་དག་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། བསྟོད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། འཛིན་པའི་ཡོན་ཏན་ཡོངས་སུ་བརྫོད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། བདུད་ཀྱི་ལས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། འཇིག་རྟེན་ཡང་དག་པར་སྟོན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། བསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། དཔེའི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། ལྷའི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། དེ་བཞིན་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། ཕྱིར་མི་ལྡོག་པའི་རྣམ་པ་དང་རྟགས་དང་མཚན་མའི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། སྟོང་པ་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། སྲིང་མོ་གང་གཱའི་ལྷ་མོའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། ཐབས་མཁས་པ་ལ་སྤྱོད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། བདུད་ཀྱི་ལས་ཀྱི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། དགེ་བའི་བཤེས་གཉེན་གྱི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། བརྒྱ་བྱིན་གྱི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། མངོན་པའི་ང་རྒྱལ་གྱི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། བསླབ་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། སྒྱུ་མ་ལྟ་བུའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། སྙིང་པོའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བརྒྱད་པ། མེ་ཏོག་བཀྲམ་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དགུ་པ། རྗེས་སུ་རིག་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་པ། རྟག་ཏུ་ངུའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཅིག་པ། ཆོས་འཕགས་ཀྱི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཉིས་པ། ཡོངས་སུ་གཏད་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྡུད་པ་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"འཕགས་པ་རབ་ཀྱི་རྩལ་གྱིས་རྣམ་པར་གནོན་པས་ཞུས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ།"}
,{d:2,t:"དང་པོ། གླེ་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཀུན་དགའ་བོའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། དེ་བཞིན་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཞི་པ། དཔེའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། རབ་འབྱོར་གྱི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། སྤྱོད་པའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། ཕན་ཡོན་གྱི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བདུན་བརྒྱ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་བརྒྱ་པ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྡོ་རྗེ་གཅོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་བཅུ་པ།"}
,{d:1,t:"དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུམ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མ་ཡི་གེ་གཅིག་མ་ཞེས་བྱ་བ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉི་མའི་སྙིང་པོ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཟླ་བའི་སྙིང་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཀུན་ཏུ་བཟང་པོ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལག་ན་རྡོ་རྗེའི་མདོ་ཐེག་པ་ཆེན་པོ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྡོ་རྗེ་རྒྱལ་མཚན་གྱི་མདོ་ཐེག་པ་ཆེན་པོ།"}
,{d:1,t:"ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བའི་མདོ།"}
,{d:1,t:"སྐྱེས་པ་རབས་ཀྱི་གླེང་གཞི།"}
,{d:2,t:"རིང་བའི་གླེང་གཞི་འཆད་པ།"}
,{d:2,t:"བར་མའི་གླེང་གཞི་འཆད་པ།"}
,{d:2,t:"ཉེ་བའི་གླེང་གཞི་འཆད་པ།"}
,{d:1,t:"ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་གི་མདོ།"}
,{d:2,t:"ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་གི་མདོ་ལས་སྐབས་རབ་མཆོག་དང་པོ་འཆད་པ།"}
,{d:2,t:"ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་གི་མདོ་ལས་སྐབས་རབ་མཆོག་གཉིས་པ་འཆད་པ།"}
,{d:1,t:"འདུས་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"བྱམས་པའི་མདོ།"}
,{d:1,t:"བྱམས་པ་བསྒོམ་པའི་མདོ།"}
,{d:1,t:"བསླབ་པ་ལྔའི་ཕན་ཡོན་གྱི་མདོ།"}
,{d:1,t:"རིའི་ཀུན་དགའ་བོའི་མདོ།"}
,{d:1,t:"ཀླུའི་རྒྱལ་པོ་དགའ་བོ་ཉེར་དགའ་འདུལ་བའི་མདོ།"}
,{d:1,t:"འོད་སྲུང་ཆེན་པོའི་མདོ།"}
,{d:1,t:"ཉི་མའི་མདོ།"}
,{d:1,t:"ཟླ་བའི་མདོ།"}
,{d:1,t:"བཀྲ་ཤིས་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བསྐལ་པ་བཟང་པོ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་རྒྱ་ཆེར་རོལ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཡང་དག་པར་སྤྲོ་བར་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། རིགས་ཡོངས་སུ་དག་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། ཆོས་སྣང་བའི་སྒོའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། བསྐྱོད་པར་བརྩམས་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། ལྷུམས་སུ་འཇུག་པའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། བལྟམ་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། ལྷ་ཁང་དུ་ཁྱེར་བའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། རྒྱན་གྱི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། ཡི་གེ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། ཞིང་པའི་གྲོང་གི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། སྒྱུ་རྩལ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། བསྐུལ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། རྨི་ལམ་གྱི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། མངོན་པར་འབྱུང་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། གཟུགས་ཙན་སྙིང་པོ་འོངས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། དཀའ་བ་སྤྱད་པའི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། ནེེ་རན་ཛ་ནའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཞུད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བརྐོད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། བདུད་བཏུལ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། མངོན་པར་བསྟོད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། ག་གོན་དང་བཟང་པོའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། བསྐུལ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། ཚོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། མཇུག་སྡུད་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་འཇམ་དཔལ་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་འཇམ་དཔལ་རྣམ་པར་འཕྲུལ་པའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་བརླབས་སེམས་ཅན་ལ་གཟིགས་ཤིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་བཀོད་པ་ཀུན་ཏུ་སྟོན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་ལ་འཇུག་པའི་ཡེ་ཤེས་སྣང་བའི་རྒྱན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པའི་ཆེ་བའི་བདག་ཉིད་ཀྱི་བསྔགས་པ་བརྗོད་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་དམ་པའི་ཆོས་ཡོངས་སུ་ཚོལ་བའི་བསོད་ནམས་ཀྱི་བསྔགས་པ་བརྗོད་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་བསྔགས་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། བྱང་ཆུབ་སེམས་དཔའ་འདུས་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། བྱང་ཆུབ་སེམས་དཔའི་སྦྱོད་པ་དང་། ལྷག་པའི་བསམ་པ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་མངོན་པར་བརྩོན་པའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། ལྷག་པའི་བསམ་པ་ཡང་དག་པར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། བྱང་ཆུབ་ཀྱི་སེམས་ཡང་དག་པར་འཛིན་དུ་གཞུག་པ་དང་། རྣམ་པར་བརྗོད་པ་དང་། བསྐྱེད་པ་བསླབ་པའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། ཐབས་ལ་འཇུག་པ་དང་། དམ་པའི་ཆོས་སྤོང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་འཛིན་དུ་གཞུག་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། བྱང་ཆུབ་སེམས་དཔའི་སྦྱོད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། མངོན་པར་འབྱུང་བ་ཡང་དག་པར་བརྗོད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། འཁོར་དག་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། སྒོའི་ཚིག་མངོན་པར་སྒྲུབ་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། ཏིང་ངེ་འཛིན་གྱི་ལས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། ཡོངས་སུ་གཏད་པའི་ཕན་ཡོན་གྱི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཟུང་གི་མདོའི་ཆོས་ཀྱི་རྣམ་གྲངས།"}
,{d:1,t:"འཕགས་པ་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པས་བསྟན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས།"}
,{d:1,t:"འཕགས་པ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བརྗོད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས།"}
,{d:1,t:"འཕགས་པ་དཀྱིལ་འཁོར་བརྒྱད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། དོན་ཟབ་དགོངས་པ་ངེས་པར་འགྲེལ་གྱི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཆོས་འཕགས་ཀྱི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། བློ་གྲོས་ཤིན་ཏུ་རྣམ་དག་གི་ལེའུ།"}
,{d:2,t:"བཞི་པ། རབ་འབྱོར་གྱི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། བློ་གྲོས་ཡངས་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། ཡོན་ཏན་འབྱུང་གནས་ཀྱི་ལེའུ།"}
,{d:2,t:"བདུན་པ། དོན་དམ་ཡང་དག་འཕགས་ཀྱི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། བྱམས་པའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། འཇམ་དཔལ་གྱི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ལང་ཀར་གཤེགས་པའི་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། འབོད་འགྲོགས་ཀྱིས་གསོལ་བ་བཏབ་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཆོས་ཐམས་ཅད་བསྡུས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། མི་རྟག་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། མངོན་པར་རྟོགས་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། དེ་བཞིན་གཤེགས་པ་རྟག་པ་དང་མི་རྟག་པར་འགྱུར་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། སྐད་ཅིག་མའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། ཤ་མི་ཟ་བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ།"}
,{d:1,t:"འཕགས་པ་ལང་ཀར་གཤེགས་པ་རིན་པོ་ཆེའི་མདོ་ལས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གསུང་གི་སྙིང་པོ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ག་ཡཱ་མགོའི་རི་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་རྒྱན་སྟུག་པོ་བཀོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། སྟུག་པོའི་རིས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྒྱན་ལས་བྱུང་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། སྦྱིན་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། སྟུག་པོར་འཇུག་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། མངལ་གྱི་སྐྱེ་བ་འབྱུང་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། བདག་གི་ལས་ཀྱི་བྱ་བ་སྤྱད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། རྣལ་འབྱོར་རྣམ་པར་ཕྱེ་བའི་སྦྱོད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། འཕགས་པ་རྒྱན་སྟུག་པོ་ལས་ལས་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། རང་གི་རྣམ་པར་རིག་པའི་ཡུལ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གཟུགས་མང་རྒྱལ་པོས་རྡོ་རྗེ་སྙིང་པོ་ལ་དྲི་བ་དང་ལན་གནང་བ་སོགས་བརྗོད་པ།"}
,{d:1,t:"འཕགས་པ་སྙིང་རྗེ་ཆེན་པོའི་པད་མ་དཀར་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ་། ཚངས་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། དེད་དཔོན་གྱི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། བརྒྱ་བྱིན་གྱི་ལེའུ།"}
,{d:2,t:"བཞི་པ། སྒྲ་གཅན་ཟིན་གྱི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། འོད་སྲུང་གི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། དམ་པའི་ཆོས་འཛིན་པའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། སྐུ་གདུང་མེད་པར་མི་འགྱུར་བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། ཕྱག་འཚལ་བའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། དགེ་བའི་རྩ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། ཡོན་གྱི་བསོད་ནམས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། དགེ་བའི་རྩ་བ་སྐྱེད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། དམ་པའི་ཆོས་ཡོང་ས་སུ་གཏད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། བསྟན་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་སྙིང་རྗེ་པད་མ་དཀར་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། གཟུངས་ཀྱི་སྒོའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། སྦྱིན་པ་གཏོང་བའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། སྦྱིན་པའི་ལེའུ།"}
,{d:2,t:"ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ཆོས་བཞིའི་དགོས་པ་བསྡུས་ཏེ་བསྟན་པ།"}
,{d:1,t:"དམ་པའི་ཆོས་པད་མ་དཀར་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཐབས་ལ་མཁས་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། དཔེའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། མོས་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། སྨན་གྱི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། ཉན་ཐོས་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། སྔོན་གྱི་སྦྱོར་བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། དགེ་སློང་ལྔ་བརྒྱ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། ཀུན་དགའ་བོ་དང་སྒྲ་གཅན་ཟིན་དང་ངགེ་སློང་ཉིས་སྟོང་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། ཆོས་སྨྲ་བའི་ལེའུ"}
,{d:2,t:"བཅུ་གཅིག་པ། མཆོད་རྟེན་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། སྤྲོ་བར་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། བདེ་བར་གནས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། བྱང་ཆུབ་སེམས་དཔའ་ས་རུམ་ནས་འཐོན་པའི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། དེ་བཞེན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། བསོད་ནམས་ཀྱི་རྣམ་གྲངས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། སྐྱེ་མཆེད་དྲུག་རྣམ་པར་དག་པའི་ཕན་ཡོན་གྱི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། རྟག་ཏུ་བརྙས་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱེད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། གཟུངས་སྔགས་ཀྱི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། སྨན་གྱི་རྒྱལ་པོའི་སྔོན་གྱི་སྦྱོར་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། སང་སང་པོའི་དབྱངས་ཀྱི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རྣམ་པར་འཕྲུལ་པ་བསྟན་པ་ཀུན་ནས་སྒོའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། རྒྱལ་པོ་དགེ་བ་བཀོད་པའི་སྔོན་གྱི་སྦྱོར་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། ཀུན་ཏུ་བཟང་པོས་སྤྲོ་བར་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། ཡོངས་སུ་གཏད་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཆོས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བདེ་བ་ཅན་གྱི་བཀོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཟ་མ་ཏོག་བཀོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"ལེའུ་དང་པོ"}
,{d:2,t:"ལེའུ་གཉིས་པ།"}
,{d:1,t:"འཕགས་པ་དཀོན་མཆོག་གི་ཟ་མ་ཏོག་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་རིན་པོ་ཆེའི་མཐའ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོའི་མདོ། ༼ཀ༽"}
,{d:2,t:"དང་པོ། སྐུ་ཚེའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། རྡོ་རྗེའི་སྐུ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། མཚན་གྱི་ཡོན་ཏན་བརྗོད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། དེ་བཞིན་གཤེགས་པའི་སྙིང་པོའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། འཁོར་མང་པོས་ཀུན་ནས་དྲིས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། འཕགས་པའི་སྤྱོད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། ཚངས་པར་སྤྱོད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། བུས་པ་ཆུང་ངུ་སྤྱོད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དགུ་པ།་་་་་་་་་་་་་་་་་་་་་་་་"}
,{d:1,t:"འཕགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོའི་མདོ། ༼ཁ༽"}
,{d:2,t:"བཅུ་པ། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་སྣང་བ་མཐོ་བཙུན་དཔལ་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བས་ཡོངས་སུ་དྲིས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། བྱང་ཆུབ་སེམས་དཔའ་སེང་གེ་སྒྲ་ཞེས་བྱ་བས་ཡོངས་སུ་དྲིས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། འོད་སྲུང་གིས་ཡོངས་སུ་དྲིས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། ཚེ་དང་ལྡན་པ་ཅང་ཤེས་ཀཽཎྜི་ནྱའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། བསྟན་པ་གཞག་པའི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། སྐུ་མྱ་ངན་ལས་འདས་ཤིང་ཞུགས་ལ་བཞེན་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། འཚེ་བ་མེད་པའི་ཕུང་པོའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། རྡོ་རྗེ་ལྟར་མི་ཤིགས་པའི་སྐུའི་ཕུང་པོ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། མདོའི་མིང་གི་གཏན་ཚིགས་དང་ཡོན་ཏན་གྱི་ཚུལ་གྱི་ལེའུ།"}
,{d:2,t:"བཞི་པ། བྱང་ཆུབ་སེམས་དཔའ་སྣ་གྲངས་བཞིས་ཆོས་སྟོན་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། སྲིན་པོ་ལ་སོགས་པ་འདུས་པས་ཞུས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་འདའ་ཀ་ཡེ་ཤེས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"སངས་རྒྱས་ཀྱི་མཛོད་ཀྱི་ཆོས་ཀྱི་ཡི་གེ །"}
,{d:2,t:"དང་པོ། ཆོས་སོ་ཅོག་གི་བདེན་པའི་མཚན་མའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། སངས་རྒྱས་བསམ་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། ཆོས་བསམ་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། དགེ་འདུན་བསམ་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། ཚུལ་ཁྲིམས་གཙང་མའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། གཙང་མའི་ཆོས་ཀྱི་ལེའུ།"}
,{d:2,t:"བདུན་པ། གནའ་འདས་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། གཙང་མ་མཐོང་བའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། དོགས་པ་བྱེ་བྲག་ཕྱེད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། བཅོལ་བའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་དཀོན་མཆོག་འབྱུང་གནས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་གསེར་གྱི་མདོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་གསེར་གྱི་བྱེ་མ་ལྟ་བུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། སཱ་ལའི་དབང་པོའི་རྒྱལ་པོའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཡང་དག་པར་བསྔགས་པའི་ལ���འུ།"}
,{d:2,t:"བཞི་པ། ཏིང་ངེ་འཛིན་གྱི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། དབྱངས་བྱིན་གྱ་ལེའུ།"}
,{d:2,t:"དྲུག་པ། ཏིང་ངེ་འཛིན་ཡོངས་སུ་སྦྱང་བ་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། བཟོད་པ་ལ་འཇུག་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། དངོས་པོ་མེད་པ་ལས་བྱུང་བའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། ཆོས་ཟབ་མོ་ལ་བཟོད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། གྲོང་ཁྱེར་དུ་གཤེགས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། མདོ་སྡེ་འཛིན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། ཏིང་ངེ་འཛིན་ལ་རྗེས་སུ་སློབ་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། ཏིང་ངེ་འཛིན་ངེས་པར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། འཛུམ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། འཛུམ་པ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། སྔོན་བྱུང་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། སངས་རྒྱས་མང་པོའི་ཏིང་ངེ་འཛིན་གྱི་སྒོའི་ལེའུ།"}
,{d:2,t:"བཅྭ་བརྒྱད་པ། ཏིང་ངེ་འཛིན་རྗེས་སུ་གཏད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ངེས་པར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། དབང་པོའི་ཏོག་གི་རྒྱལ་མཚན་གྱི་རྒྱལ་པོའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། སྔོན་བྱུང་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། ལུས་ངེས་པར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། དེ་བཞིན་གཤེགས་པའི་སྐུ་ངེས་པར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། དེ་བཞིན་གཤེགས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་འཇུག་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། རྗེས་སུ་ཡི་རང་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། སྦྱིན་པའི་ཕན་ཡོན་གྱི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བརྒྱད་པ། ཚུལ་ཁྲིམས་ངེས་པར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དགུ་པ། ཕན་ཡོན་བཅུའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་པ། གཟི་བརྗིད་ཚོགས་ཀྱི་རྒྱལ་པོའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཅིག་པ། ཕན་ཡོན་གྱི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཉིས་པ། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གསུམ་པ། མདོ་སྡེ་འཛིན་པའི་ཕན་ཡོན་གྱི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བཞི་པ། བདེ་བས་བྱིན་གྱི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་ལྔ་པ། ཡེ་ཤེས་ལྡན་གྱི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དྲུག་པ། མེ་ཏོག་ཟླ་མཛེས་ཀྱི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བདུན་པ། ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ངེས་པར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བརྒྱད་པ། སྙན་པའི་འོད་ཀྱི་ལེའུ།"}
,{d:2,t:"ལུས་དང་ངག་དང་ཡིད་ཀྱི་སྡོམ་པ་དང་ཚིག་སུམ་བརྒྱ་པོ་རྒྱས་པར་བསྟན་པ་སོགས་བཤད་པ།"}
,{d:1,t:"འཕགས་པ་ཆོས་ཉིད་རང་གི་ངོ་བོ་སྟོང་པ་ཉིད་ལས་མི་གཡོ་བར་ཐ་དད་པར་ཐམས་ཅད་ལ་སྣང་བའི་མདོ།"}
,{d:1,t:"འཕགས་པ་རབ་ཏུ་ཞི་བ་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་གྱི་ཏིང་ངེ་འཛིན་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ད་ལྟར་གྱི་སངས་རྒྱས་མངོན་སུམ་དུ་བཞུགས་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"ལེའུ་དང་པོ"}
,{d:2,t:"ལེའུ་གཉིས་པ།"}
,{d:2,t:"ལེའུ་གསུམ་པ།"}
,{d:2,t:"ལེའུ་བཞི་པ།"}
,{d:2,t:"ལེའུ་ལྔ་པ།"}
,{d:2,t:"ལེའུ་དྲུག་པ།"}
,{d:2,t:"ལེའུ་བདུན་པ།"}
,{d:2,t:"ལེའུ་བརྒྱད་པ།"}
,{d:2,t:"ལེའུ་དགུ་པ།"}
,{d:2,t:"ལེའུ་བཅུ་པ།"}
,{d:2,t:"ལེའུ་བཅུ་གཅིག་པ།"}
,{d:2,t:"ལེའུ་བཅུ་གཉིས་པ།"}
,{d:2,t:"ལེའུ་བཅུ་གསུམ་པ།"}
,{d:2,t:"ལེའུ་བཅུ་བཞི་པ།"}
,{d:2,t:"ལེའུ་བཅོ་ལྔ་པ།"}
,{d:2,t:"ལེའུ་བཅུ་དྲུག་པ།"}
,{d:2,t:"ལེའུ་བཅུ་བདུན་པ།"}
,{d:2,t:"ལེའུ་བཅྭ་བརྒྱད་པ།"}
,{d:2,t:"ལེའུ་བཅུ་དགུ་པ།"}
,{d:2,t:"ལེའུ་ཉི་ཤུ་པ།"}
,{d:2,t:"ལེའུ་ཉེར་གཅིག་པ།"}
,{d:2,t:"ལེའུ་ཉེར་གཉིས་པ།"}
,{d:2,t:"ལེའུ་ཉེར་གསུམ་པ།"}
,{d:2,t:"ལེའུ་ཉེར་བཞི་པ།"}
,{d:2,t:"ལེའུ་ཉེར་ལྔ་པ།"}
,{d:1,t:"འཕགས་པ་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"ལེའུ་དང་པོ"}
,{d:2,t:"ལེའུ་གཉིས་པ།"}
,{d:1,t:"རྡོ་རྗེའི་ཏིང་ངེ་འཛིན་གྱི་ཆོས་ཀྱི་ཡི་གེ །"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། མཚན་མ་མེད་པའི་ཆོས་ཀྱི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། སྐྱེ་བ་མེད་པ་སྤྱོད་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། ཕྱི་མོའི་ཚོར་བའི་ཕན་བསོད་ཀྱི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། ཡང་དག་པ་བདེན་པའི་དབྱིངས་སུ་འཇུག་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། ཡང་དག་པའི་ངོ་བོ་ཉིད་སྟོང་པའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། ཡང་དག་པར་གཤེགས་པའི་མཛོད་ཀྱི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། མདོ་འཛིན་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཁྱེའུ་བཞིའི་ཏིང་ངེ་འཛིན་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཏིང་ངེ་འཛིན་མཆོག་དམ་པ།"}
,{d:1,t:"འཕགས་པ་འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། བདུད་སྤ་བཀོང་བའིལེའུ།"}
,{d:2,t:"གཉིས་པ། སྔོན་བྱུང་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། བདུད་བཏུལ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། དྲང་སྲོང་སྐར་མ་ལ་དགའ་བའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། མཚན་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། གཟུངས་ཀྱི་ལེའུ།"}
,{d:2,t:"བདུན་པ། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། སྙིང་བརྩེ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། ཀུན་ཏུ་བསྲུང་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། དམ་པའི་ཆོས་ཀྱི་ཚུལ་བསྲུང་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། འབྲོག་གནས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། མཐར་ཕྱིན་པའི་ལེའུ།"}
,{d:1,t:" འཕགས་པ་རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སྒོ་མཐའ་ཡས་པ་སྒྲུབ་པ་ཞེས་བྱ་བའི་གཟུངས།"}
,{d:1,t:"འཕགས་པ་སྒོ་དྲུག་པ་ཞེས་བྱ་བའི་གཟུངས།"}
,{d:1,t:"འཕགས་པ་རྣམ་པར་མི་རྟོག་པ་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས།"}
,{d:1,t:"ཚིགས་སུ་བཅད་པ་གཉིས་པའི་གཟུངས།"}
,{d:1,t:"འཕགས་པ་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་རབ་ཏུ་སྒོམ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། མཚན་ཉིད་རབ་ཏུ་དབྱེ་བའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། སྐྱེ་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། རབ་ཏུ་དབྱེ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་པ།"}
,{d:1,t:"འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་གྱི་ཐབས་ཀྱི་ཡུལ་ལ་རྣམ་པར་འཕྲུལ་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། ཐབས་ལ་མཁས་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། ཐེག་པ་གཅིག་ཏུ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། རྒྱལ་པོའི་དྲུང་དུ་ཕྱིན་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། རྒྱལ་པོའི་ཚུལ་གྱི་ལེའུ།"}
,{d:2,t:"བདུན་པ། བདིན་སྨྲ་མགྲོན་དུ་བོས་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། ཡོན་ཏན་དང་སྐྱོན་བསྟན་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་ངེས་པར་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ནམ་མཁའ་མཛོད་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བྱམས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་ཞུས་པ་ཆོས་བདུན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སྤོབས་པའི་བློ་གྲོས་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བློ་གྲོས་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། ཐམས་ཅད་མཁྱེན་པའི་སེམས་རིན་པོ་ཆེ་ཡོངས་སུ་སྦྱང་བའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། གནོད་པ་བཟོད་པ་དང་ངེས་པར་འབིགས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། ཏིང་ངེ་འཛིན་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། དཔེ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། བརྩོན་འགྲུས་བརྩམས་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། སངས་རྒྱས་ཀྱི་ཆོས་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། ཡོངས་སུ་གཏད་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། ཆོས་ཀྱི་སྒོའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། ཡོངས་སུ་བསྔོ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། སྔོན་བྱུང་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་དུ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། བྱིན་གྱི་རླབས་ཀྱི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། སྨོན་ལམ་གྱི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཞི་པ། མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་ཕན་ཡོན་གྱི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་གནས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། ཀླུ་ཡོངས་སུ་བསྐྱབ་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཚངས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཚངས་པས་བྱིན་གྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཚངས་པ་ཁྱད་པར་སེམས་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ལྷའི་བུ་རབ་རྩལ་སེམས་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དཔལ་དབྱིག་གིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་རིན་ཆེན་དྲ་བ་ཅན་གྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་རིན་ཆེན་ཟླ་བས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བདེ་བྱེད་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཡུལ་འཁོར་སྐྱོང་གིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"དྲི་མ་མེད་པའི་འོད་ཀྱིས་ཞུས་པ།"}
,{d:1,t:"འཕགས་པ་ཐེག་པ་ཆེན་པོའི་མན་ངག་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བྲམ་ཟེ་མོ་དཔལ་ལྡན་མས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བགྲེས་མོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་འཇམ་དཔལ་གྱིས་དྲིས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བདག་མེད་པ་དྲིས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་འཇིག་རྟེན་འཛིན་གྱིས་ཡོངས་སུ་དྲིས་པ་ཞེས་བྱ་བའི་མདོ།"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཕུང་པོ་ལྔ་ལ་བརྟགས་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། ཁམས་བཅོ་བརྒྱད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཞི་པ། སྐྱེ་མཆེད་བཅུ་གཉིས་ཤེས་པར་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། རྟེན་ཅིང་འབྲེལ་ཏེ་འབྱུང་བ་བཅུ་གཉིས་ཤེས་པར་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། དྲན་པ་ཉེ་བར་བཞག་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། དབང་པོ་ལྔ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། འདུས་བྱས་དང་འདུས་མ་བྱས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། སྔོན་བྱུང་བའི་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། གདམས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་བློ་གྲོས་མི་ཟད་པས་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དྲི་མ་མེད་པར་གྲགས་པས་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཐབས་མཁས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། ཉན་ཐོས་དང་བྱང་ཆུབ་སེམས་དཔའ་གཏང་བར་རྨས་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། ན་བ་ཡང་དག་པར་དགའ་བར་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། ལྷ་མོའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོར་འཇུག་པའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། སྤྲུལ་པས་ཞལ་ཟས་བླངས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། ཟད་པ་དང་མི་ཟད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྫོངས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། སྔོན་གྱི་སྦྱོར་བ་དང་། དམ་པའི་ཆོས་གཏད་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་འཇམ་དཔལ་གྱིས་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཀུན་རྫོབ་དང་དོན་དམ་པའི་བདེན་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཆོས་ཐམས་ཅད་འབྱུང་བ་མེད་པར་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ།"}
,{d:3,t:"དང་པོ། རྗེས་སུ་ཡི་རང་བའི་ལེའུ།"}
,{d:3,t:"གཉིས་པ། སྦྱིན་པའི་ཐབས་ལ་མཁས་པའི་ལེའུ།"}
,{d:3,t:"གསུམ་པ། དཔེའི་ལེའུ།"}
,{d:3,t:"བཞི་པ། མཚན་མ་མེད་པའི་ལེའུ།"}
,{d:3,t:"ལྔ་པ། སྒྱུ་མ་ལྟ་བུར་བསྟན་པའི་ལེའུ།"}
,{d:3,t:"དྲུག་པ། འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པར་བྱང་ཆུབ་སེམས་དཔའི་སྦྱོད་པ་དང་། སངས་རྒྱས་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:3,t:"བདུན་པ། ཕྱིར་མི་ལྔོག་པའི་སའི་ལེའུ།"}
,{d:3,t:"བརྒྱད་པ། བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྦྱང་བར་བྱ་བའི་ལེའུ།"}
,{d:3,t:"དགུ་པ།"}
,{d:2,t:"ཆུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ།"}
,{d:3,t:"ལེའུ་དང་པོ།"}
,{d:3,t:"ལེའུ་གཉིས་པ།"}
,{d:3,t:"ལེའུ་གསུམ་པ།"}
,{d:3,t:"ལེའུ་བཞི་པ།"}
,{d:3,t:"ལེའུ་ལྔ་པ།"}
,{d:3,t:"ལེའུ་དྲུག་པ།"}
,{d:3,t:"ལེའུ་བདུན་པ།"}
,{d:2,t:"བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ།"}
,{d:3,t:"ལེའུ་དང་པོ"}
,{d:3,t:"ལེའུ་གཉིས་པ།"}
,{d:3,t:"ལེའུ་གསུམ་པ།"}
,{d:2,t:"བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ།"}
,{d:2,t:"བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྲིན་པ་བསྟན་པ།"}
,{d:3,t:"ལེའུ་དང་པོ"}
,{d:3,t:"ལེའུ་གཉིས་པ།"}
,{d:3,t:"ལེའུ་གསུམ་པ།"}
,{d:3,t:"ལེའུ་བཞི་པ།"}
,{d:1,t:"འཕགས་པ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"ལེའུ་དང་པོ"}
,{d:2,t:"ལེའུ་གཉིས་པ།"}
,{d:1,t:"འཕགས་པ་སྦྱིན་པའི་ཕན་ཡོན་བསྟན་པ།"}
,{d:1,t:"འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་དང་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་ལ་འཇུག་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་ཀྱི་སྟོབས་སྐྱེད་པའི་ཆོ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ།"}
,{d:1,t:"འཕགས་པ་མར་མེ་མཛད་ཀྱིས་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཚངས་པའི་དཔལ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བུད་མེད་འགྱུར་བ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བུ་མོ་ཟླ་མཆོག་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བདེ་ལྡན་མ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ལྷ་མོ་ཆེན་པོ་དཔལ་ལུང་བསྟན་པ།"}
,{d:1,t:"འཕགས་པ་རྒྱལ་བའི་བློ་གྲོས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སྤྱན་རས་གཟིགས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་འཇམ་དཔལ་གནས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བྱམས་པ་འཇུག་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་འཇིག་རྟེན་གྱི་རྗེས་སུ་འཐུན་པར་འཇུག་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དད་པའི་སྟོབས་བསྐྱེད་པ་ལ་འཇུག་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ངེས་པ་དང་མ་ངེས་པར་འགྲོ་བའི་ཕྱག་རྒྱ་ལ་འཇུག་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཆོས་ཀྱི་ཕྱག་རྒྱ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་མར་མེ་འབུལ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་གྲོང་ཁྱེར་གྱིས་འཚོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"ཟས་ཀྱི་འཚོ་བ་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"གླང་པོའི་རྩལ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སྒྲ་ཆེན་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སེང་གེའི་སྒྲ་བསྒྲགས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སཱ་ལུའི་ལྗང་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་པོ་དང་རྣམ་པར་དབྱེ་བ་བསྟན་པ་ཞེས་བྱ་བའི་མདོ།"}
,{d:1,t:"འཕགས་པ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཞེས་བྱ་བའི་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སོར་མོའི་ཕྲེང་བ་ལ་ཕན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"རྒྱལ་པོ་ལ་གདམས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"རྒྱལ་པོ་ལ་གདམས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་མ་སྐྱེས་དགྲའི་འགྱོད་པ་བསལ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དཔལ་སྦས་ཞེས་བྱ་བའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་གཅོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"སངས་རྒྱས་ཀྱི་སྡེ་སྣོད་ཚུལ་ཁྲིམས་འཆལ་པ་ཚར་གཅོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། དྲན་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། དགེ་བའི་བཤེས་གཉེན་གྱི་ལེའུ།"}
,{d:2,t:"བཞི་པ། འཕགས་པའི་དགེ་འདུན་གྱི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། འཆལ་བའི་ཚུལ་ཁྲིམས་ཀྱི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། ཡོངས་སུ་མ་དག་པའི་ཆོས་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། སྔོན་གྱི་སྦྱོར་བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། དེ་བཞིན་གཤེགས་པ་ལ་བཀུར་སྟི་བྱས་པ་དང་། བླ་མར་བྱས་པ་དང་། རྗེད་པ་དང་། མཆོད་པ་དང་། མཉེས་པར་བྱས་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་རྒྱལ་པོ་ལ་གདམས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་རྔ་བོ་ཆེ་ཆེན་པོའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སུམ་བཅུ་རྩ་གསུམ་པའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ལྷག་པའི་བསམ་པ་བརྟན་པའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སྲིད་པ་འཕོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་རྣམ་པར་འཐག་པ་ཐམས་ཅད་བསྡུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་བགྲོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འདུས་པ་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་མདོ་སྡེ་ལས་དེ་བཞིན་གཤེགས་པའི་དཔལ་གྱི་དམ་ཚིག་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། ཉན་ཐོས་མཚོན་པ།"}
,{d:2,t:"གཉིས་པ། བསམ་གཏན་མཚོན་པ།"}
,{d:2,t:"གསུམ་པ། ཐེན་ཆེན་རབ་ཏུ་ཞི་བར་བྱེད་པའི་མཚོན་པ།"}
,{d:2,t:"བཞི་པ།"}
,{d:1,t:"འཕགས་པ་དཀོན་མཆོག་སྤྲིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སྤྲིན་ཆེན་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། ལྷ་ཐམས་ཅད་འདུས་པ་ཞེས་བྱ་བ་སྟེ་ཕུང་པོའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཏིང་ངེ་འཛིན་གྱི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། གཟུངས་ཀྱི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། ལྡེམ་པོ་ངག་གི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། སྲིད་པར་སྐྱེ་བའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། འཁོར་བ་ཉོན་མོངས་པའི་ཞིང་གི་ལས་ཀྱི་ས་འཐོབ་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། ཡེ་ཤེས་ལ་རྨོང་པ་གཟུད་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། ཡེ་ཤེས་ཟབ་མོ་བརྟན་པ་འཐོབ་པ་ལ་འཇུག་པའི་རྣམ་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། རྣམ་པར་ཐར་པའི་བསོད་ནམས་ཀྱི་མཛོད་ཀྱི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། བསོད་ནམས་ཀྱི་རྣམ་པ་ཡོངས་སུ་བརྗོད་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། སྤྲིན་ཆེན་པོའི་ཚོགས་ནམ་མཁའ་ལས་འབྱུང་བའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། གློག་གི་འོད་ཀྱི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། སྤྲིན་ཆེན་པོའི་གློག་འགྱུ་བ་དང་ལྡན་ཞིང་མུན་པ་འཇོམས་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། སྤྲིན་ཆེན་པོའི་གློག་གི་སྒྱུ་འཕྲུལ་གྱི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"བཅྭ་ལྔ་པ། ཆོ་འཕྲུལ་ཆེན་པོའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། ཆོས་ཀྱི་ཐོག་ཏོག་གི་འབེལ་བའི་གཏམ་གྱི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། ཡེ་ཤེས་རྡོ་རྗེའི་རྣམ་པ་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"བཅྭ་བརྒྱད་པ། ལོངས་སྤྱོད་མི་ཟད་པའི་རྣམ་པ་ལ་འཇུག་པ་རྣམ་པར་འཕྲུལ་བའི་རྒྱལ་པོའི་ཆོས་ཀྱི་སྒོའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། ཡང་དག་པའི་ལམ་གྱི་རྣམ་པ་མངོན་པར་མཚོན་པ་ལ་འཇུག་པའི་ཆོས་ཀྱི་སྒོའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། ཕྲ་ཞིང་ཟབ་པའི་གླེང་གཞིའི་རྣམ་པ་ལ་འཇུག་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་གཅིག་པ། སེང་གེ་རྣམ་པར་རྩེ་བ་ལ་དམིགས་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་གཉིས་པ། མཚམས་སྦྱར་བ་ཚོགས་པའི་རྣམ་པ་འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པར་བྱ་བ་ལ་འཇུག་པའི་མདོའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་གསུམ་པ། མངོན་པར་རྩེ་བ་རིན་པོ་ཆེའི་མཛོད་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་བཞི་པ། ནམ་མཁའ་ལྡིང་གི་རྩལ་ཆེན་པོའི་སྟོབས་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་ལྔ་པ། སྒྲ་ཆེན་པོའི་དུས་རྣམ་པར་བསྒྲགས་པ་བཀོད་པའི་རྒྱལ་པོའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་དྲུག་པ། མི་འཇིགས་པ་ཆེན་པོའི་སྟོབས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་བདུན་པ། གནས་ཀྱི་རྣམ་པ་དང་བཅས་པ་ཡངས་པའི་ཆོས་ཀྱི་སྒོའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་བརྒྱད་པ། ལྷག་པའི་བསམ་པའི་ཆོ་ག་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་དགུ་པ། དམག་ཆེན་པོ་དཔའ་བའི་རྒྱལ་པོ་སྟོབས་བཀོད་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"སུམ་བཅུ་པ། བཟང་པོའི་རྣམ་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོའི་ཆོས་ཀྱི་སྒོའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"སུམ་བཅུ་གཅིག་པ། རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་སྟོན་པའི་དཔུང་བསྐྱེད་པ་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"སུམ་བཅུ་གཉིས་པ། ཡེ་ཤེས་རྩོམ་པའི་ཆོ་ག་ལ་ཞུགས་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"སུམ་བཅུ་གསུམ་པ། ཡེ་ཤེས་ཀྱི་ནོར་བསྒྲིམས་ཏེ་བསྒྲུབ་པའི་མཛོད་ཀྱི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"སུམ་བཅུ་བཞི་པ། ཡང་དག་པའི་མཆོད་སྦྱིན་ལ་ཕན་པའི་ཆོ་ག་བཀོད་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"སུམ་བཅུ་ལྔ་པ། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡང་དག་པའི་ས་བོན་རབ་ཏུ་སྐྱེད་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་དྲུག་པ། དེ་ཁོ་ནའི་སྙིང་པོའི་ཚུལ་གྱིས་མངོན་པར་རྩེ་བ་ལ་དགའ་བའི་རྒྱལ་པོའི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"སུམ་བཅུ་བདུན་པ། དམ་པའི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཕུང་པོའི།"}
,{d:1,t:"འཕགས་པ་སྤྲིན་ཆེན་པོའི་མདོ་ལས་ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོ་འདུས་པའི་དགའ་སྟོན་ཆེན་པོ་ལ་རྩེ་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་སྤྲིན་ཆེན་པོ་རླུང་གི་དཀྱིལ་འཁོར་གྱི་ལེའུ་ཀླུ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སྤྲིན་ཆེན་པོ།"}
,{d:1,t:"བཅོམ་ལྡན་འདས་ཀྱི་གཙུག་ཏོར་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་གསང་བསྒྲུབ་པའི་དོན་མངོན་པར་ཐོབ་པའི་རྒྱུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་དཔའ་བར་འགྲོ་བའི་མདོ་ལེའུ་སྟོང་ཕྲག་བཅུ་པ་ལས་ལེའུ་བཅུ་པ།"}
,{d:1,t:"གཙུག་ཏོར་ཆེན་པོ་བམ་པོ་དགུ་པ་ལས་བདུད་ཀྱི་ལེའུ་ཉི་ཚེ་ཕྱུང་བ།"}
,{d:1,t:"འཕགས་པ་ཆོས་ཡང་དག་པར་སྡུད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འདུས་པ་ཆེན་པོ་ལས་སའི་སྙིང་པོའི་འཁོར་ལོ་བཅུ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། འཁོར་ལོ་བཅུའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། གནས་ཤིང་སྤྱད་པར་མི་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། གནས་པ་དང། སྤྱད་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། བསོད་ནམས་ཀྱི་ཞིང་གི་མཚན་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། བདེ་བའི་དོན་ཐོབ་པ་ཡོངས་སུ་གདམས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་འཁོར་ལོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཡོངས་སུ་བསྔོ་བའི་འཁོར་ལོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"དམ་པའི་ཆོས་ཀྱི་རྒྱལ་པོ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཆོས་ཀྱི་ཚུལ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཆོས་ཀྱི་ཕུང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དོན་དམ་པའི་ཆོས་ཀྱིས་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཆོས་དང་དོན་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"བྱང་ཆུབ་སེམས་དཔའི་སོ་སོར་ཐར་པ་ཆོས་བཞི་སྒྲུབ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཆོས་བཞི་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"ཆོས་བཞི་པའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཆོས་བཞི་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བཞི་པ་སྒྲུབ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"ཆོས་གསུམ་པ་ཞེས་བྱ་བའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཆོས་ཀྱི་རྒྱལ་མཚན་གྱི་མདོ་ཐེག་པ་ཆེན་པོའོ།"}
,{d:1,t:"ཐེག་པ་ཆེན་པོའི་མདོ་ཆོས་རྒྱ་མཚོ་ཞེས་བྱ་བ།"}
,{d:1,t:"ཆོས་ཀྱི་རྒྱ་མོ།"}
,{d:1,t:"འཕགས་པ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་སྡེ་ཉི་མའི་སྙིང་པོ་ཞེས་བྱ་བའི་མདོ།"}
,{d:2,t:"དང་པོ། དམ་པའི་ཆོས་བསྲུང་བའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཕོ་ཉའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། གཟུངས་སྔགས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཞི་པ། ལས་འབྱང་བའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། ཀུན་ཏུ་བསྲུང་བའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། ཉི་མའི་སྙིང་པའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། རྒྱུ་སྐར་གྱི་སྦྱོར་བ་རྣམ་པར་གཞག་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ།"}
,{d:2,t:"དགུ་པ། སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བ། རི་རབ་ལ་གཤེགས་པའི་ལེའུ "}
,{d:2,t:"བཅུ་གཅིག་པ། ཀླུ་སྐྱབས་སུ་འགྲོ་བའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཡི་གེ་མེད་པའི་ཟ་མ་ཏོག་རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ནམ་མཁའི་སྙིང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཐབས་མཁས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"སངས་རྒྱས་ཀྱི་མཚན་ལྔ་སྟོང་བཞི་བརྒྱ་ལྔ་བཅུ་རྩ་གསུམ་པ།"}
,{d:1,t:"འཕགས་པ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། "}
,{d:1,t:"འཕགས་པ་རྟོགས་པ་ཆེན་པོ་ཡོངས་སུ་རྒྱས་པའི་མདོ་ལས། ཕྱག་འཚལ་བའི་ཆོ་ག་དང་། འགྱོད་ཚངས་ཀྱི་ལེའུ་ཉི་ཚེ།"}
,{d:1,t:"འཕགས་པ་མེ་ཏོག་གི་ཚོགས་ཤེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། "}
,{d:1,t:"དཔང་སྐོང་ཕྱག་བརྒྱ་པ་ཞེས་བྱ་བ།"}
,{d:1,t:"འཕགས་པ་བསམ་གྱིས་མྱི་ཁྱབ་པའི་རྒྱལ་པོའི་མདོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཕྱོགས་བཅུའི་མུན་པ་རྣམ་པར་སེལ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་བདུན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་བརྒྱད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"སངས་རྒྱས་བཅུ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་བཅུ་གཉིས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་ཀྱི་དབུ་རྒྱན་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་ཆོས་ཀྱི་རྣམ་གྲངས་ཆེན་པོ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་ཀྱི་ས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་མི་སྤང་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དཀྱིལ་འཁོར་བརྒྱད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བཀྲ་ཤིས་བརྒྱད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ།"}
,{d:1,t:"ཆོས་རྗེས་སུ་དྲན་པ།"}
,{d:1,t:"དགེ་འདུན་རྗེས་སུ་དྲན་པ།"}
,{d:1,t:"འཕགས་པ་སྐུ་གསུམ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཕུང་པོ་གསུམ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཡོང་སུ་བསྔོ་བ།"}
,{d:1,t:"འཕགས་པ་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཡོངས་སུ་བསྔོ་བ།"}
,{d:1,t:"འཕགས་པ་དམ་པའི་ཆོས་དྲན་པ་ཉེ་བར་གཞག་པ། ༼ཀ༽"}
,{d:1,t:"འཕགས་པ་དམ་པའི་ཆོས་དྲན་པ་ཉེ་བར་གཞག་པ།༼ཁ༽"}
,{d:1,t:"འཕགས་པ་དམ་པའི་ཆོས་དྲན་པ་ཉེ་བར་གཞག་པ།༼ག༽"}
,{d:1,t:"འཕགས་པ་དམ་པའི་ཆོས་དྲན་པ་ཉེ་བར་གཞག་པ།༼ང་༽"}
,{d:1,t:"མདོ་ཆེན་པོ་སྒྱུ་མའི་དྲ་བ་ཞེས་བྱ་བ།"}
,{d:1,t:"མདོ་ཆེན་པོ་གཟུགས་ཅན་སྙིང་པོས་བསུ་བ་ཞེས་བྱ་བ།"}
,{d:1,t:"མདོ་ཆེན་པོ་སྟོང་པ་ཉིད།"}
,{d:1,t:"མདོ་ཆེན་པོ་སྟོང་པ་ཉིད་ཆེན་པོ་ཞེས་བྱ་བ།"}
,{d:1,t:"མདོ་ཆེན་པོ་རྒྱལ་མཚན་མཆོག་ཅེས་བྱ་བ།"}
,{d:1,t:"མདོ་ཆེན་པོ་རྒྱལ་མཚན་དམ་པ་ཞེས་བྱ་བ།"}
,{d:1,t:"མདོ་ཆེན་པོ་ལྔ་གསུམ་པ་ཞེས་བྱ་བ།"}
,{d:1,t:"འཕགས་པ་རྡོ་འཕངས་པའི་མདོ།"}
,{d:1,t:"གཞོན་ནུ་དཔེའི་མདོ།"}
,{d:1,t:"ཁམས་མང་པོ་པའི་མདོ།"}
,{d:1,t:"གཎ་ཌཱིའི་མདོ།"}
,{d:1,t:"གཎ་ཌཱིའི་དུས་ཀྱི་མདོ།"}
,{d:1,t:"འཕགས་པ་དགེ་བའི་བཤེས་གཉེན་བསྟེན་པའི་མདོ།"}
,{d:1,t:" མངོན་པར་འབྱུང་བའི་མདོ།"}
,{d:1,t:"དགེ་སློང་ལ་རབ་ཏུ་གཅེས་པའི་མདོ་ཞེས་བྱ་བ།"}
,{d:1,t:"ཚུལ་ཁྲིམས་ཡང་དག་པར་ལྡན་པའི་མདོ།"}
,{d:1,t:"ལྟུང་བ་སྡེ་ལྔའི་དགེ་བ་དང་མི་དགེ་བའི་འབྲས་བུ་བརྟག་པའི་མདོ།"}
,{d:1,t:"མཆོག་ཏུ་གདགས་པའི་མདོ།"}
,{d:1,t:"རྣམ་པར་གྲོལ་བའི་ལམ་ལས་སྦྱངས་པའི་ཡོན་ཏན་བསྟན་པ་ཞེས་བྱ་བ།"}
,{d:1,t:"ཚེའི་མཐའི་མདོ།"}
,{d:1,t:"ཚེ་འཕོ་བ་ཇི་ལྟར་འགྱུར་བ་ཞུས་པའི་མདོ།"}
,{d:1,t:"མི་རྟག་པ་ཉིད་ཀྱི་མདོ།"}
,{d:1,t:"མི་རྟག་པ་ཉིད་ཀྱི་མདོ།"}
,{d:1,t:"འཕགས་པ་འདུ་ཤེས་བཅུ་གཅིག་བསྟན་པའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཡངས་པའི་གྲོང་ཁྱེར་དུ་འཇུག་པའི་མདོ་ཆེན་པོ།"}
,{d:1,t:"འཕགས་པ་མཚན་མོ་བཟང་པོ་ཞེས་བྱ་བའི་མདོ།"}
,{d:1,t:"མུན་གྱི་ནགས་ཚལ་གྱི་སྒོ་ཞེས་བྱ་བའི་མདོ།"}
,{d:1,t:"ཕ་མའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བདེན་པ་བཞིའི་མདོ།"}
,{d:1,t:"དོན་རྣམ་པར་ངེས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས།"}
,{d:1,t:"འཕགས་པ་དོན་རྒྱས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས།"}
,{d:1,t:"འཕགས་པ་རྨད་དུ་བྱུང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས།"}
,{d:1,t:"འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་བཞག་པའི་ཕན་ཡོན་ཡང་དག་པར་བརྗོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས།"}
,{d:1,t:"མཆོད་རྟེན་བསྐོར་བའི་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"གསལ་རྒྱལ་གྱི་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:"ཚིགས་སུ་བཅད་པ་གཅིག་པ།"}
,{d:1,t:"ཚིགས་སུ་བཅད་པ་བཞི་པ།"}
,{d:1,t:"ཀླུའི་རྒྱལ་པོ་རྔ་སྒྲའི་ཚིགས་སུ་བཅད་པ།"}
,{d:1,t:" ཆེད་ཏུ་བརྗོད་པའི་ཚོམས།"}
,{d:1,t:"འཕགས་པ་སྐྱེས་བུ་དམ་པའི་མདོ།"}
,{d:1,t:"དགའ་བོ་རབ་ཏུ་བྱུང་བའི་མདོ།"}
,{d:1,t:"ལྷའི་མདོ།"}
,{d:1,t:"ལྷའི་མདོ་ཉུང་ངུ།"}
,{d:1,t:" ཟླ་བའི་མདོ། "}
,{d:1,t:"ཁང་བུ་བརྩེགས་པའི་མདོ།"}
,{d:1,t:"འཕགས་པ་གནས་འཇོག་གི་མདོ་ཞེས་བྱ།"}
,{d:1,t:"འཕགས་པ་དགའ་བ་ཅན་གྱི་མདོ།"}
,{d:1,t:"འཕགས་པ་མཁར་སིལ་གྱི་མདོ།"}
,{d:1,t:"མཁར་སིལ་འཆང་བའི་ཀུན་ཏུ་སྤྱོད་པའི་ཆོ་ག །"}
,{d:1,t:"ཆོས་ཀྱི་འཁོར་ལོའི་མདོ།"}
,{d:1,t:"ལས་རྣམ་པར་འབྱེད་པ།"}
,{d:1,t:"ལས་ཀྱི་རྣམ་པར་འགྱུར་བ་ཞེས་བྱ་བ་ཆོས་ཀྱི་གཞུང་།"}
,{d:1,t:"ལས་བརྒྱ་ཐམ་པ།༼ཀ༽"}
,{d:2,t:"སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་དང་པོ།"}
,{d:2,t:"སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་གཉིས་པ།"}
,{d:2,t:"སྡོམ་གྱི་ཚིགས་���ུ་བཅད་པ་གསུམ་པ།"}
,{d:2,t:"སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་བཞི་པ།"}
,{d:2,t:"སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་ལྔ་པ།"}
,{d:2,t:"སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་དྲུག་པ།"}
,{d:2,t:"སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་བདུན་པ།(སྟོད)"}
,{d:1,t:"ལས་བརྒྱ་ཐམ་པ་པ།༼ཨ༽"}
,{d:2,t:"སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་བདུན་པ། (སྨད)"}
,{d:2,t:"སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ། "}
,{d:2,t:"སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་དགུ་པ། "}
,{d:2,t:"སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་བཅུ་པ། "}
,{d:1,t:"མཛངས་བླུན་ཞེས་བྱ་བའི་མདོ།"}
,{d:2,t:"དང་པོ། དཔེ་སྣ་ཚོགས་བསྟན་པའི་ལེའུ། "}
,{d:2,t:"གཉིས་པ། སེམས་ཅན་ཆེན་པོས་སྟག་མོ་ལ་བྱིན་པའི་ལེའུ། "}
,{d:2,t:"གསུམ་པ། ཀུན་ཏུ་རྒྱུས་ཚུལ་ཁྲིམས་བསྲུངས་པའི་ལེའུ། "}
,{d:2,t:"བཞི་པ། ལུས་བཙོངས་ནས་མཆོད་པ་བྱས་པའི་ལེའུ། "}
,{d:2,t:"ལྔ་པ། རྒྱ་མཚོའི་ལྷས་དྲིས་པའི་ལེའུ། "}
,{d:2,t:"དྲུག་པ། ལྷའི་བུ་གང་གཱ་ད་ར་ཞེས་བྱ་བའི་ལེའུ། "}
,{d:2,t:"བདུན་པ། རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་བུ་མོ་རྡོ་རྗེའི་ལེའུ། "}
,{d:2,t:"བརྒྱད་པ། གསེར་དབྱིག་གི་ལེའུ། "}
,{d:2,t:"དགུ་པ། ལྷའི་མེ་ཏོག་གི་ལེའུ། "}
,{d:2,t:"བཅུ་པ། ལྷའི་རིན་ཆེན་གྱི་ལེའུ། "}
,{d:2,t:"བཅུ་གཅིག་པ། བཟོད་པའི་ལེའུ། "}
,{d:2,t:"བཅུ་གཉིས་པ། རྒྱལ་པོ་བྱམས་པའི་སྟོབས་ཀྱི་སྦྱིན་པའི་ལེའུ། "}
,{d:2,t:"བཅུ་གསུམ་པ། སྟོན་པ་དྲུག་བཏུལ་བའི་ལེའུ། "}
,{d:2,t:"བཅུ་བཞི་པ། གཅན་གཟན་ཀུན་ཏས་ལུས་ཀྱི་སྦྱིན་པ་བྱས་པའི་ལེའུ། "}
,{d:2,t:"བཅོ་ལྔ་པ། རབ་ཏུ་བྱུང་བའི་ཡོན་ཏན་བསྔགས་པའི་ལེའུ། "}
,{d:2,t:"བཅུ་དྲུག་པ། དགེ་ཚུལ་གྱིས་ཚུལ་ཁྲིམས་བསྲུངས་པའི་ལེའུ། "}
,{d:2,t:"བཅུ་བདུན་པ། ཁྱིམ་བདག་དབང་པོ་མེད་པའི་ལེའུ། "}
,{d:2,t:"བཅོ་བརྒྱད་པ། དབུལ་མོས་རས་ཕུལ་བའི་ལེའུ། "}
,{d:2,t:"བཅུ་དགུ་པ། བྲན་མོ་དབུལ་མོས་ཀཱ་ཏྱཱ་ཡ་ན་ལ་དབུལ་བཙོངས་པའི་ལེའུ། "}
,{d:2,t:"ཉི་ཤུ་པ། གསེར་ལྷའི་ལེའུ། "}
,{d:2,t:"ཉི་ཤུ་གཅིག་པ། རིགས་གཉིས་པའི་ལེའུ། "}
,{d:2,t:"ཉི་ཤུ་གཉིས་པ། རྒྱལ་པོ་ཟླ་འོད་ཀྱིས་མགོ་སྦྱིན་པའི་ལེའུ། "}
,{d:2,t:"ཉི་ཤུ་གསུམ་པ། བློན་པོ་རིས་དྭགས་ཀྱི་བུ་བདུན་གྱི་ལེའུ། "}
,{d:2,t:"ཉི་ཤུ་བཞི་པ། ཀ་པྱི་ན་ཆེན་པོའི་ལེའུ། "}
,{d:2,t:"ཉི་ཤུ་ལྔ་པ། དགེ་སློང་མ་ཨུད་པ་ལའི་ལེའུ། "}
,{d:2,t:"ཉི་ཤུ་དྲུག་པ། ཤུད་དོ་ལག་གར་ནིའི་ལེའུ། "}
,{d:2,t:"ཉི་ཤུ་བདུན་པ། རྒྱལ་པོ་ཨ་ཤོ་ཀའི་ལེའུ། "}
,{d:2,t:"ཉི་ཤུ་བརྒྱད་པ། གསེར་གྱི་བུམ་པའི་ལེའུ། "}
,{d:2,t:"ཉི་ཤུ་དགུ་པ། བྲམ་ཟེ་མོ་བདེ་བའི་ལེའུ། "}
,{d:2,t:"སུམ་བཅུ་པ། སྦྱིན་པ་ཆེན་པོ་རྒྱ་མཚོར་ཞུགས་པའི་ལེའུ "}
,{d:2,t:"སུམ་བཅུ་གཅིག་པ། རྒྱལ་པོ་མེ་ལོང་གདོང་གི་ལེའུ། "}
,{d:2,t:"སུམ་བཅུ་གཉིས་པ། ལེགས་ཚོལ་དང་ཉེས་ཚོལ་གཉིས་ཀྱི་ལེའུ། "}
,{d:2,t:"སུམ་བཅུ་གསུམ་པ། རྒྱལ་བུ་དགེ་དོན་གྱི་ལེའུ། "}
,{d:2,t:"སུམ་བཅུ་བཞི་པ། ཁྱིམ་བདག་སྡུམས་བྱེད་ཀྱི་ལེའུ། "}
,{d:2,t:"སུམ་བཅུ་ལྔ་པ། རྒྱལ་པོ་མིག་འབྱེད་ཀྱི་ལེའུ། "}
,{d:2,t:"སུམ་བཅུ་དྲུག་པ། མི་གདུང་བ་སོར་འཕྲེང་ཅན་གྱི་ལེའུ། "}
,{d:2,t:"སུམ་བཅུ་བདུན་པ། བུ་མོ་བསྙེན་དགའ་མོའི་ལེའུ། "}
,{d:2,t:"སུམ་བཅུ་བརྒྱད་པ། བ་ཤི་ཙིར་གྱི་ལེའུ། "}
,{d:2,t:"སུམ་བཅུ་དགུ་པ། ཁྱིམ་བདག་དབྱུག་པ་ཅན་གྱི་ལེའུ། "}
,{d:2,t:"བཞི་བཅུ་པ། བྲམ་ཟེ་ཤི་ཙིར་གྱི་ལེའུ། "}
,{d:2,t:"བཞི་བཅུ་གཅིག་པ། ཁྱིམ་བདག་དན་བྱི་ལ་ཞེས་བྱ་བའི་ལེའུ། "}
,{d:2,t:"བཞི་བཅུ་གཉིས་པ། གླང་པོ་སྐྱོང་གི་ལེའུ། "}
,{d:2,t:"བཞི་བཅུ་གསུམ་པ། བྲམ་ཟེས་ལྷན་པ་ཕུལ་བའི་ལེའུ། "}
,{d:2,t:"བཞི་བཅུ་བཞི་པ། སངས་རྒྱས་ཐོག་མ་བྱམས་པའི་ཐུགས་བསྐྱེད་པའི་ལེའུ། "}
,{d:2,t:"བཞི་བཅུ་རྩ་ལྔ་པ། རྒྱལ་པོ་སྤྱི་བོ་སྐྱེས་ཀྱི་ལེའུ། "}
,{d:2,t:"བཞི་བཅུ་དྲུག་པ། བུ་མོ་སུ་མ་ནའི་བུ་བཅུའི་ལེའུ། "}
,{d:2,t:"བཞི་བཅུ་བདུན་པ། ཨུ་པ་ཀུབ་ཏའི་ལེའུ། "}
,{d:2,t:"བཞི་བཅུ་བརྒྱད་པ། ངང་པ་ལྔ་བརྒྱ་ལྷར་སྐྱེས་པའི་ལེའུ། "}
,{d:2,t:" བཞི་བཅུ་དགུ་པ། སེང་གེ་ཡི་དམ་བརྟན་པ་ཞེས་བྱ་བའི་ལེའུ། "}
,{d:2,t:"ལྔ་བཅུ་པ། སྲིན་བུའི་ལོ་རྒྱུས་བསྟན་པའི་ལེའུ། "}
,{d:2,t:"ལྔ་བཅུ་གཅིག་པ། དགེ་ཚུལ་ཀྱུན་ཏེའི་ལེའུ། "}
,{d:1,t:"འཕགས་པ་བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་གྱི་རྒྱལ་པོ།"}
,{d:1,t:"གང་པོ་ལ་སོགས་པའི་རྟོགས་པ་བརྗོད་པ་བརྒྱ་པ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་ཀྱི་རྟོགས་པ་བརྗོད་པ་ཤེས་ལྡན་གྱི་མདོ།"}
,{d:1,t:"ཕག་མོའི་རྟོགས་པ་བརྗོད་པ་ཞེས་བྱ་བའི་མདོ།"}
,{d:1,t:"མ་ག་དྷཱ་བཟང་མོའི་རྟོགས་པ་བརྗོད་པ།"}
,{d:1,t:"བསོད་ནམས་ཀྱི་སྟོབས་ཀྱི་རྟོགས་པ་བརྗོད་པ།"}
,{d:1,t:"ཟླ་འོད་ཀྱི་རྟོགས་པ་བརྗོད་པ།"}
,{d:1,t:"དཔལ་གྱི་སྡེའི་རྟོགས་པ་བརྗོད་པ།"}
,{d:1,t:"གསེར་མདོག་གི་སྔོན་གྱི་སྦྱོར་བ་ཞེས་བྱ་བ།"}
,{d:1,t:"འཕགས་པ་རྒྱལ་བུ་དོན་གྲུབ་ཀྱི་མདོ།"}
,{d:1,t:"ཚངས་པའི་དྲ་བའི་མདོ།"}
,{d:1,t:"ཐབས་མཁས་པ་ཆེན་པོ་སངས་རྒྱས་དྲིན་ལན་བསབ་པའི་མདོ།"}
,{d:2,t:"དང་པོ། གླེང་གཞིའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། སྲི་ཞུའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། གཉེན་པོའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། ངན་དོན་གྱི་ལེའུ།"}
,{d:2,t:"བདུན་པ། སྙིང་རྗེའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། མ་འགགས་པའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། ཉེ་བར་བསྙེན་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ལེགས་ཉེས་ཀྱི་རྒྱུ་དང་འབྲས་བུ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"དགེ་བ་དང་མི་དགེ་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་བསྟན་པའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཟླ་བའི་སྙིང་པོས་ཞུས་པའི་མདོ་ལས། སངས་རྒྱས་ཀྱི་བསྟན་པ་གནས་པ་དང་འཇིག་པའི་ཚུལ་ལུང་བསྟན་པ།"}
,{d:1,t:"འཕགས་པ་གླང་རུ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"སྟག་རྣའི་རྟོགས་པ་བརྗོད་པ།"}
,{d:1,t:"མིག་བཅུ་གཉིས་པ་ཞེས་བྱ་བའི་མདོ།"}
,{d:2,t:"དང་པོ། འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱི་རྒྱན་གྱི་ཚུལ་རབ་ཏུ་བྱུང་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། དེ་བཞིན་གཤེགས་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། ཀུན་ཏུ་བཟང་པོའི་ཏིང་ངེ་འཛིན་དང་རྣམ་པར་འཕྲུལ་པ་རབ་ཏུ་བྱུང་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཤིན་ཏུ་བསྟན་པའི་ཕྱོགས་གསལ་བར་བྱ་བ་ཡང་དག་པར་བསྒྲུབས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་གཞི་དང་སྙིང་པོ་མེ་ཏོག་གི་རྒྱན་གྱིས་བརྒྱན་པའི་ཡོན་ཏན་རྒྱ་མཚོ་ཡོངས་སུ་དག་པས་སྣང་བ་ཞེས་བྱ་བའི་་ལེའུ།"}
,{d:2,t:"དྲུག་པ། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོའི་འཁོར་ཡུག་གི་རྒྱན་རྒྱ་མཚོ་ཤིན་ཏུ་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོའི་སའི་གཞི་རྒྱན་ཤིན་ཏུ་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། ཞིང་གི་རྒྱུད་ཀྱི་གནས་ཤིན་ཏུ་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་རྣམ་པར་དགོད་པ་ཤིན་ཏུ་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། རྣམ་པར་སྣང་མཛད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། དེ་བཞིན་གཤེགས་པ་རྨད་ག་ཅད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། སངས་རྒྱས་ཀྱི་མཚན་ཤིན་ཏུ་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། འཕགས་པའི་བདེན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་ལས་རྣམ་པར་སངས་རྒྱས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། བྱང་ཆུབ་སེམས་དཔས་དྲིས་པ་སྣང་བ་ཞེས་བྱ་བའི་ལེའུ། "}
,{d:2,t:"བཅུ་དྲུག་པ། སྤྱོད་ཡུལ་ཡོངས་སུ་དག་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། བཟང་པོའི་དཔལ་གྱི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། དེ་བཞིན་གཤེགས་པ་རི་རབ་ཀྱི་རྩེར་གཤེགས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱི་ཚིགས་སུ་བཅད་པའི་ལེའུ།"}
,{d:1,t:"སངས་རྒྱས་ཕལ་པོ་ཆེ་ཞེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། ༼ཁ༽"}
,{d:2,t:"ཉི་ཤུ་པ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དགོད་པ་བཅུ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། ཚངས་པར་སྤྱོད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོའི་དཔེ་ཡང་དག་པར་བསགས་པ་ཚིགས་སུ་བཅད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། ཆོས་སྣང་བའི་ལེའུ།"}
,{d:2,t:" ཉི་ཤུ་རྩ་བཞི་པ། རབ་མཚེ་མའི་གནས་ན་རྣམ་པར་འཕྲུལ་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། ཚིགས་སུ་བཅད་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། གཏེར་མི་ཟད་པ་བཅུ་བསྟན་པའི་ལེའུ།  "}
,{d:2,t:"ཉི་ཤུ་རྩ་བརྒྱད་པ། དེ་བཞིན་གཤེགས་པ་བཞུད་པ་དང་གཤེགས་པ་དང་།བཞུགས་པའི་རྒྱན་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དགུ་པ། དགའ་ལྡན་གྱི་གནས་སུ་བྱང་ཆུབ་སེམས་དཔའ་འདུས་པའི་ཚིགས་སུ་བཅད་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་པ། རྡོ་རྗེ་རྒྱལ་མཚན་གྱི་ཡོངས་སུ་བསྔོ་བའི་ལེའུ།(སྟོད)"}
,{d:1,t:"སངས་རྒྱས་ཕལ་པོ་ཆེ་ཞེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། ༼ག༽"}
,{d:2,t:"སུམ་ཅུ་པ། རྡོ་རྗེ་རྒྱལ་མཚན་གྱི་ཡོངས་སུ་བསྔོ་བའི་ལེའུ།(སྨད)"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཅིག་པ། ས་བཅུའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཉིས་པ། ཀུན་ཏུ་བཟང་པོས་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གསུམ་པ། ཏིང་ངེ་འཛིན་བཅུའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བཞི་པ། མངོན་པར་ཤེས་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་ལྔ་པ། བཟོད་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དྲུག་པ། སེམས་ཀྱི་རྒྱལ་པོས་དྲིས་ནས་གྲངས་ལ་འཇུག་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བདུན་པ། ཚེའི་ཚད་ཀྱི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བརྒྱད་པ། བྱང་ཆུབ་སེམས་དཔའི་གནས་ཀྱི་ལེའུ།"}
,{d:1,t:"ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ་སངས་རྒྱས་ཕལ་པོ་ཆེ་ཞེས་བྱ་བ། ༼ང༽"}
,{d:2,t:"སུམ་ཅུ་དགུ་པ། སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་པ། དེ་བཞིན་གཤེགས་པའི་སྐུའི་མཚན་རྒྱ་མཚོ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་གཅིག་པ། དཔེ་བྱད་བཟང་པོའི་འོད་ཟེར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་གཉིས་པ། ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གསུམ་པ། དེ་བཞིན་གཤེགས་པ་སྐྱེ་བ་འབྱུང་བ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བཞི་པ། འཇིག་རྟེན་ལས་འདས་པའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་ལྔ་པ། སྡོང་བོས་བརྒྱན་པའི་ལེའུ།(སྟོད)"}
,{d:1,t:"སངས་རྒྱས་ཕལ་པོ་ཆེ་ཞེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། ༼ཅ༽"}
,{d:2,t:"བཞི་བཅུ་ལྔ་པ། སྡོང་པོས་བརྒྱན་པའི་ལེའུ།(སྟད)"}
,{d:3,t:"ནོར་བཟངས་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བའི་སྤྱོད་པ་ཕྱོགས་གཅིག་ཏུ་བསྟན་པ།"}
,{d:1,t:" འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་སྟོང་ཕྲག་བརྒྱ་པ་ལས་སྡོམ་བ་གསུམ་བསྟན་པའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ༼ཀ༽"}
,{d:1,t:" འཕགས་པ་སྒོ་མཐའ་ཡས་པ་རྣམ་པར་སྦྱོང་བ་བསྟན་པའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་གསང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་།"}
,{d:2,t:"དང་པོ། དེས་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པའོ། བྱང་ཆུབ་སེམས་དཔའི་ངག་གི་གསང་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་གསང་བའི་ལེའུ།"}
,{d:2,t:"བཞི་པའ། སྒྲ་དབྱངས་བསྒྲགས་པ་འོངས་པའི་ལེའུ།"}
,{d:2,t:" ལྔ་པ། ཡུལ་འཁོར་སྲུང་གི་སྔོན་གྱི་ཚུལ་གྱི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། བྱང་ཆུབ་ཀྱི་ལམ་གྱི་ལེའུ།"}
,{d:2,t:"འདུན་བ། དེ་བཞིན་གཤེགས་པའི་སྐུའི་གསང་བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། དེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། དེ་བཞིན་གཤེགས་པའི་ཐུགས་ཀྱི་གསང་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། གསང་བའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པའི་ལེའོུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། ཟས་ལེན་པ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དཀའ་བ་སྤྱོད་པ་ཡང་དག་འཕགས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཞུད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། བདུད་བཏུལ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། དམིགས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། གསང་བའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། གཉིས་སུ་མེད་པ་བརྗོད་པའི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། ལྕང་ལོ་ཅན་དུ་གཤེགས་ནས་བཤོས་གསོལ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། འཇིག་རྟེན་སྐྱོང་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། བཞུད་པ་དང་བྱོན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། དཔའ་སྟོབས་ཀྱི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། མ་སྐྱེས་དགྲས་ཞུས་པ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། རྒྱལ་པོ་བཟང་གི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། གཟུངས་ཀྱི་ཡོན་ཏན་གྱི་བསྔགས་པའི་དཔེ་དགོད་པ་མི་ཟད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། དམ་པའི་ཆོས་ཡོངས་སུ་གཏད་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་རྨི་ལམ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་འོད་དཔག་མེད་ཀྱི་བཀོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་བཀོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།༼ཀ༽"}
,{d:2,t:"ལེའུ་དང་པོ།"}
,{d:2,t:"ལེའུ་གཉིས་པ།"}
,{d:2,t:"ལེའུ་གསུམ་པ།"}
,{d:2,t:"ལེའུ་བཞི་པ།"}
,{d:2,t:"ལེའུ་ལྔ་པ།"}
,{d:2,t:"ལེའུ་དྲུག་པ།"}
,{d:2,t:"ལེའུ་དྲུག་པ།"}
,{d:1,t:"འཕགས་པ་གོ་ཆའི་བཀོད་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ"}
,{d:1,t:"འཕགས་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་རང་བཞིན་དབྱེར་མེད་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཆོས་བཅུ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཀུན་ནས་སྒོའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་འོད་ཟེར་ཀུན་དུ་བཀྱེ་བ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། ཁྱིམ་བདག་གི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། བྱང་ཆུབ་སེམས་དཔའ་བརྟག་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། དི་བཞིན་གཤེགས་པའི་བསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ།(སྟོད)"}
,{d:1,t:"འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"བཞི་པ། དི་བཞིན་གཤེགས་པའི་བསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ།(སྟད)"}
,{d:2,t:"ལྔ་པ། བཏང་སྙོམས་ཀྱི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་དགའ་བོ་ལ་མངལ་ན་གནས་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཚེ་དང་ལྡན་པ་དགའ་བོ་ལ་མངལ་དུ་འཇུག་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:" འཕགས་པ་འཇམ་དཔལ་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཡབ་དང་སྲས་མཇལ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། རྒྱལ་པོ་མངོན་པར་དད་པར་བྱས་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། རྒྱལ་པོ་གཤེགས་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། རྒྱལ་པོ་འདུན་པར་བྱས་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། ལྷ་མ་ཡིན་ལུང་བསྟན་པའི་ལེའུ་སྟེ།"}
,{d:2,t:"ལྔ་པ། སྔོན་བྱུང་བ་འོད་སྲུང་ཆེན་པོས་ཞུས་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། ནམ་མཁའ་ལྡིང་ལུང་བསྟན་པའི་ལེའོུ།"}
,{d:2,t:"བདུན་པ། ཀླུའི་བུ་མོ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། ཀླུ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། གྲུལ་བུམ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། དྲི་ཟ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། གནོད་སྦྱིན་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། མིའམ་ཅི་ལུང་བསྟན་པའི་ལེའུ། "}
,{d:2,t:"བཅུ་གསུམ་པ། ཕྲེང་ལྡན་གླང་པོ་ཅན་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། རྒྱལ་ཆེན་བཞིའི་རིས་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། སུམ་བཅུ་རྩ་གསུམ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། འཐབ་བྲལ་བ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། དགའ་ལྡན་པ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱ་པ། འཕྲུལ་དགའ་བ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། གཞན་འཕྲུལ་དབང་བྱེད་པ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། ཚངས་པ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། འོད་གསལ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། དགེ་རྒྱས་རིས་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། འབྲས་བུ་ཆེ་བ་པ་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། གནས་གཙང་མ་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། མུ་སྟེགས་ཅན་ལུང་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། ཤཱཀྱ་ལུང་བསྟན་པའི་ལེའུ་སྟེ་འོ།"}
,{d:1,t:"འཕགས་པ་གང་པོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། མང་དུ་ཐོས་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། ཕྱིར་མི་ལྡོག་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། དགེ་བའི་རྩ་བ་དང་ལྡན་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། ཐུགས་རྗེ་ཆེན་པོའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། བརྒལ་བའི་ལན་གདབ་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། ཚེ་དང་ལྡན་པ་གང་པོའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་ཡུལ་འཁོར་སྐྱོང་གིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཁྱིམ་བདག་དྲག་ཤུལ་ཅན་གྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་གློག་ཐོབ་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སྒྱུ་མ་མཁན་བཟང་པོ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཆོ་འཕྲུལ་ཆེན་པོ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བྱམས་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་འདུལ་བ་རྣམ་པར་གཏན་ལ་དབབ་པ་ཉེ་བར་འཁོར་གྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ལྷག་པའི་བསམ་པ་བསྐུལ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ལག་བཟངས་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དེས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཁྱིམ་བདག་དཔལ་བྱིན་གྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བད་སའི་རྒྱལ་པོ་འཆར་བྱེད་ཀྱིས་ཞུས་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་བུ་མོ་བློ་གྲོས་བཟང་མོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་གང་གཱའི་མཆོག་གིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་མྱ་ངན་མེད་ཀྱིས་བྱིན་པ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དྲི་མ་མེད་ཀྱིས་བྱིན་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ལྷའི་བུ་བློ་གྲོས་རབ་གནས་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ལྷའི་བུ་བློ་གྲོས་རབ་གནས་ཀྱིས་ཞུས་པ་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སེང་གེས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གསང་ཆེན་ཐབས་ལ་མཁས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་དམ་པས་ཞུས་པའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བུ་མོ་རྣམ་དག་དད་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བྱམས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐོག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་བྱམས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་འོད་སྲུང་གི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་རིན་པོ་ཆེའི་ཕུང་པོ་ཞེས་བྱ་བ་ཐེགས་པ་ཆེན་པོའི་མདོ།"}
,{d:2,t:"དང་པོ། དགེ་སྦྱོང་གི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། དགེ་སློང་གི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། དགེ་སྦྱོང་གདོལ་པ་ལྟ་བུའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། ཞལ་ཏ་བྱེད་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། དགོན་པ་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། བསོད་སྙོམས་སྤྱོད་པའི་ལེའུ།"}
,{d:1,t:"འཕགས་པ་བློ་གྲོས་མི་ཟད་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བདུན་བརྒྱ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་གཙུག་ན་རིན་པོ་ཆེས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:" འཕགས་པ་ལྷ་མོ་དཔལ་ཕྲེང་གི་སེང་གེའི་སྒྲ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཕགས་པ་དྲང་སྲོང་རྒྱས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།"}
,{d:1,t:"འཇམ་དཔལ་ཡེ་ཤེས་སེམས་དཔའི་དོན་དམ་པའི་མཚན་ཡང་དག་པར་བརྗོད་པ། "}
,{d:1,t:"དབང་མདོར་བསྟན་པ།"}
,{d:1,t:"མཆོག་གི་དང་པོའི་སངས་རྒྱས་ལས་ཕྱུང་བ་རྒྱུད་ཀྱི་རྒྱལ་པོ་དཔལ་དུས་ཀྱི་འཁོར་ལོ་ཞེས་བྱ་བ།"}
,{d:2,t:"དང་པོ། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་བཀོད་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ནང་ངེས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། མངོན་པར་དབང་བསྐུར་བའི་ལེའུ།"}
,{d:2,t:"ལེའུ་བཞི་པ། སྒྲུབ་ཐབས་ཀྱི་ལེའུ།"}
,{d:2,t:"ལེའུ་ལྔ་པ། ཡེ་ཤེས་ཀྱི་ལེའུ།"}
,{d:1,t:"དཔལ་དུས་ཀྱི་འཁོར་ལོའི་རྒྱུད་ཕྱི་མ་རྒྱུད་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ།"}
,{d:1,t:"དཔལ་དུས་ཀྱི་འཁོར་ལོ་ཞེས་བྱ་བའི་རྒྱུད་ཀྱི་སྙིང་པོ།"}
,{d:1,t:"དབང་གི་རབ་ཏུ་བྱེད་པ།"}
,{d:1,t:"དཔལ་སངས་རྒྱས་ཐམས་ཅད་དང་མཉམ་པར་སྦྱོར་བ་མཁའ་འགྲོ་མ་སྒྱུ་མ་བདེ་བའི་མཆོག་ཅེས་བྱ་བའི་རྒྱུད་ཕྱི་མ།"}
,{d:2,t:"དང་པོ། དེ་ཁོ་ན་ཉིད་སྣང་བ་དམ་པའི་ཡུལ་ལ་འཇུག་པ་ཡེ་ཤེས་ཀྱི་ཕྱག་རྒྱའི་རྟོག་པ།"}
,{d:2,t:"གཉིས་པ། དཔལ་རྡོ་རྗེ་སེམས་དཔའ་ཀུན་ཏུ་སྦྱོར་བའི་རྟོག་པ།"}
,{d:2,t:"གསུམ་པ། ལྷ་མོ་ཐམས་ཅད་དང་མཉམ་པར་སྦྱོར་བ་སྐལ་བ་མཆོག་བཟང་པོ་དཔལ་རྡོ་རྗེ་དམ་ཚིག་གི་རྟོག་པ།"}
,{d:2,t:"བཞི་པ། སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་སྐལ་བ་བཟང་པོ་མཆོག་གི་དངོས་གྲུབ་ཅེས་བྱ་སྟེ་དཔལ་དམ་ཚིག་གི་རྟོག་པ།"}
,{d:2,t:"ལྔ་པ། གཏམ་གྱི་ཕྱག་རྒྱ་ཞེས་པ་རྟོག་པ།"}
,{d:2,t:"དྲུག་པ། སངས་རྒྱས་ཐམས་ཅད་མཉམ་པར་སྦྱོར་བ་མཁའ་འགྲོ་སྒྱུ་མའི་དཀྱིལ་འཁོར་གྱི་རྟོག་པ།"}
,{d:2,t:"བདུན་པ། དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་ཤེས་པའི་རྟོག་པ།"}
,{d:2,t:"བརྒྱད་པ། མཆོད་པ་ཐམས་ཅད་དང་མཉམ་པར་སྦྱོར་བ་དཔལ་སྐལ་བ་བཟང་པོ་དམ་ཚིག་གི་རྟོག་པ།"}
,{d:2,t:"དགུ་པ། ཀུན་ཏུ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་དམ་ཚིག་གི་ཕྱག་རྒྱའི་རྟོག་པ།"}
,{d:2,t:"བཅུ་པ། ཀུན་ཏུ་སྣ་ཚོགས་བཤད་པ།"}
,{d:1,t:"རྟོག་པ་ཐམས་ཅད་འདུས་པ་ཞེས་བྱ་བ་སངས་རྒྱས་ཐམས་ཅད་དང་མཉམ་པར་སྦྱོར་བ་མཁའ་འགྲོ་སྒྱུ་མ་བདེ་བའི་མཆོག་གི་རྒྱུད་ཕྱི་མའི་ཕྱི་མ།"}
,{d:2,t:"བཅྭ་བརྒྱད་པ། དེ་ཁོ་ན་ཉིད་ཐམས་ཅད་ངེས་པའི་ཚེག་གི་རྟོག་པ།"}
,{d:2,t:"བཅུ་དགུ་པ། ཆོས་ཀྱི་ཡི་གེ་འབྱུང་བའི་རྟོག་པ།"}
,{d:2,t:"ཉི་ཤུ་པ། སྔགས་འབྱུང་བའི་རྟོག་པ།"}
,{d:2,t:"ཉིར་གཅིག་པ། གསང་བ་བསྒྲུབ་པའི་རྟོག་པ།"}
,{d:2,t:"ཉེར་གཉིས་པ། རྗེས་སུ་སྦྱོར་བ་དང་ལྡན་པ་སྒྲུབ་པའི་རྟོག་པ། "}
,{d:1,t:"ཀྱེའི་རྡོ་རྗེ་ཞེས་བྱ་བ་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:2,t:"བརྟག་པ་དང་པོ།"}
,{d:3,t:"དང་པོ། རྡོ་རྗེ་རིགས་ཀྱི་ལེའུ།"}
,{d:3,t:"གཉིས་པ། སྔགས་ཀྱི་ལེའུ།"}
,{d:3,t:"གསུམ་པ། ལྷའི་ལེའུ།"}
,{d:3,t:"བཞི་པ། དབང་གི་ལེའུ།"}
,{d:3,t:"ལྔ་པ། དེ་ཁོ་ན་ཉིད་ཀྱི་ལེའུ།"}
,{d:3,t:"དྲུག་པ། སྤྱོད་པའི་ལེའུ།"}
,{d:3,t:"བདུན་པ། བརྡ་དང་གནས་གཏན་ལ་ཕབ་པའི་ལེའུ།"}
,{d:3,t:"བརྒྱད་པ། རྣལ་འབྱོར་མའི་འཁོར་ལོ་ཞེས་བྱ་བ་འདུ་བའི་ལེའུ།"}
,{d:3,t:"དགུ་པ། རྣམ་པར་དག་པའི་ལེའུ།"}
,{d:3,t:"བཅུ་པ། དབང་གི་ལེའུ།"}
,{d:3,t:"བཅུ་གཅིག་པ།"}
,{d:2,t:"བརྟག་པ་གཉིས་པ།"}
,{d:3,t:"དང་པོ། རབ་གནས་ཀྱི་ལེའུ།"}
,{d:3,t:"གཉིས་པ། དངོས་གྲུབ་གཏན་ལ་ཕབ་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:3,t:"གསུམ་པ། རྒྱུད་ཐམས་ཅད་ཀྱི་གླེང་གཞི་དང་གསང་བའི་སྐད་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:3,t:"བཞི་པ། རྒྱུད་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་བསྡུས་པའི་དོན་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:3,t:"ལྔ་པ། ཀྱེ་རྡོ་རྗེ་མངོན་པར་འབྱུང་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:3,t:"དྲུག་པ། བྲིས་སྐུའི་ཆོ་གའི་ལེའུ།"}
,{d:3,t:"བདུན་པ། བཟའ་བའི་ལེའུ།"}
,{d:3,t:"བརྒྱད་པ། འདུལ་བའི་ལེའུ།"}
,{d:3,t:"དགུ་པ། སྔགས་བཏུ་བའི་ ལེའུ།"}
,{d:3,t:"བཅུ་པ། བཟླས་པའི་ལེའུ།"}
,{d:3,t:"བཅུ་གཅིག་པ། ལྷན་ཅིག་སྐྱེས་པའི་སྦྱོར་བ་དོན་གྱི་ལེའུ།"}
,{d:3,t:"བཅུ་གཉིས་པ།"}
,{d:1,t:"འཕགས་པ་མཁའ་འགྲོ་མ་རྡོ་རྗེ་གུར་ཞེས་བྱ་བའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཆེན་པོའི་བརྟག་པ།"}
,{d:2,t:"དང་པོ། ཐམས་ཅད་ཀྱི་རྣམ་པ་མཆོག་ཏུ་ཞི་བ་སེམས་ཅན་འཇུག་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། གླུ་སྣ་ཚོགས་དང་རོལ་མོའི་སྒྲ་དང་གར་དང་འདུལ་བར་འཇུག་པ་དང་ཆར་དབབ་པ་དང་མི་གཡོ་བའི་བདག་ཉིད་ཆེ་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཚན་གྱི་ལེའུ།"}
,{d:2,t:"བཞི་པ། ཁྲོ་བོ་ཆེན་པོ་འཁོར་ལོའི་སྙིང་པོའི་སྔགས་ལ་འཇུག་པ་རྡོ་རྗེ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བ་དབུགས་དབྱུང་བ་རྡོ་རྗེ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། རྡོ་རྗེ་སེམས་དཔའི་སྙིང་པོ་སྣང་བའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། སྔགས་ཐམས་ཅད་རྣམ་པར་དག་པ་བདུད་རྩི་ལྔ་མཆོག་ཏུ་བྱུང་བ་རྡོ་རྗེ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། བཞེངས་པ་དང་ལས་སྣ་ཚོགས་ཀྱི་སྦྱོར་བ་དང་སྦྱིན་སྲེག་གི་ལེའུ།"}
,{d:2,t:"དགུ་པ། ལས་སྣ་ཚོགས་བསྒྲུབ་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། རྡོ་རྗེ་སྐྱེ་མཆེད་རྣམ་པར་དག་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། ལས་ཐམས་ཅད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། རྣལ་འབྱོར་མ་འབྱུང་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། རྡོ་རྗེ་སྡོམ་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། དངོས་པོ་སྣ་ཚོགས་རྣམ་པར་ཕྱེ་བའི་ལེའུ།"}
,{d:2,t:"བཅོ་་ལྔ་པ།"}
,{d:1,t:"དཔལ་ཕྱག་རྒྱ་ཆེན་པོའི་ཐིག་ལེ་ཞེས་བྱ་བ་རྣལ་འབྱོར་མ་ཆེན་མོའི་རྒྱུད་ཀྱི་རྒྱལ་པོའི་མངའ་བདག།"}
,{d:2,t:"དང་པོ། རྒྱུད་ཐམས་ཅད་ཀྱི་རྒྱུ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། སློབ་དཔོན་དང་སློབ་མ་བརྟག་པ་དང་། ཡོན་དབུལ་བ་དང་། དབང་བསྐུར་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། སྦྱོར་བ་དྲུག་གི་མཚན་ཉིད་དང་འཁོར་ལོ་དྲུག་གི་རང་གི་ངོ་བོ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། འཁོར་ལོ་དྲུག་གི་རྩ་འབྱུང་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། སྲོག་དང་མཚན་མོ་དང་། ཉིན་མོ་དང་མཚམས་དང་། ཤར་བ་དང་ནུབ་པ་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། ཨཱ་ལི་ཀཱ་ལི་འབྱུང་བ་དང་དུས་ཀྱི་མཚན་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། རྡོ་རྗེའི་མཚན་ཉིད་དང་། བདག་སྒྲའི་ངེས་པའི་དོན་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། གསང་བ་དང་དགའ་བ་བཞི་དང་། རིགས་ལྔའི་མཚན་ཉིད་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། ཕྱག་རྒྱའི་བརྡ་དང་མཆོད་པའི་ཆོ་ག་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། དཀྱིལ་འཁོར་དང་། ལྷ་མོ་དང་། གནས་དང་། དུར་ཁྲོད་དང་། ཤིང་དང་། མཆོད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། དོན་དམ་པའི་སྦྱིན་སྲེག་གི་ཆོ་ག་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། བདུད་རྩི་ལྔ་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། རྣལ་འབྱོར་མ་འདུས་པའི་གནས་སུ་གསང་བའི་སྐད་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། རྣལ་འབྱོར་མ་ཐམས་ཅད་ཀྱི་ཡན་ལག་གི་ཕྱག་རྒྱ་ལ་སོགས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། མཁའ་འགྲོ་མའི་གཟུགས་དང་། མཚན་ཉིད་དང་། རིགས་འབྱུང་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། དཀྱིལ་འཁོར་དང་། དགའ་བའི་བྱེ་བྲག་དང་། ཐིག་ལེའི་མཚན་ཉིད་དང་། བསྐྱེད་པ་དང་། རྫོགས་པའི་རིམ་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། ཚུལ་དང་། ཆར་ཡང་དང་། ཐིག་ལེ་དང་། ཡེ་ཤེས་ཀྱི་གནས་དང་། རྩའི་ཀུན་སྤྱོད་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། བྱང་ཆུབ་ཀྱི་སེམས་བརྟན་པར་བྱེད་པ་དང་།  བསམ་གཏན་བརྟན་པ་ཞེས་བྱ་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། དབང་གི་ཡེ་ཤེས་དང་། ཨཱ་ལི་ཀཱ་ལིའི་རྒྱུ་འབྲས་དང་། ཟླ་བ་འབྱུང་བ་དང་། རྩ་དང་། ཐིག་ལེ་དང་། དགའ་བ་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། རྣལ་འབྱོར་གྱི་དབང་ཕྱུག་ཆེན་པོའི་སྤྱོད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། འཁོར་ལོ་དྲུག་གི་ས་བོན་དང་། སྔགས་བཏུ་བ་དང་། བདུད་རྩི་ལྔ་བཟའ་བ་དང་། སྤྱད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། གཏོར་མའི་ལས་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། ཚོགས་ཀྱི་འཁོར་ལོའི་ཆོ་ག་དང་། མཁའ་འགྲོ་མའི་ཡན་ལག་གི་མཚན་ཉིད་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། ལས་ཀྱི་ཆོ་ག་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། རང་བཞིན་གྱི་བཟླས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། དུས་ཀྱི་དོན་གྱི་རང་བཞིན་གྱི་དོན་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། སྦས་པའི་སྔགས་གསལ་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བརྒྱད་པ། རྨད་དུ་བྱུང་བའི་རྨད་དུ་བྱུང་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:1,t:"དཔལ་ཡེ་ཤེས་སྙིང་པོ་ཞེས་བྱ་བ་རྣལ་འབྱོར་མ་ཆེན་མོའི་རྒྱུད་ཀྱི་རྒྱལ་པོའི་རྒྱལ་པོ།"}
,{d:2,t:"དང་པོ། ལྷན་ཅིག་སྐྱེས་པའི་དགའ་བའི་དོན་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཕྱག་རྒྱ་ཆེན་པོ་དང་། དབང་བསྐུར་བའི་དོན་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། དབང་བསྐུར་བ་དང་། དཀྱིལ་འཁོར་གྱི་དོན་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། གསང་བའི་དཀྱིལ་འཁོར་འབྱུང་བའི་དོན་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:1,t:"དཔལ་ཡེ་ཤེས་ཐིག་ལེ་རྣལ་འབྱོར་མའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཆེན་པོ་མཆོག་ཏུ་རྨད་དུ་བྱུང་བ་ཞེས་བྱ་བ།"}
,{d:2,t:"དང་པོ།  འཕོ་བའི་དུས་ཤར་བ་དང་ནུབ་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། དེ་ཁོ་ན་ཉིད་གསུམ་གྱི་བདག་ཉིད་དང་ཟླ་བ་མཆོག་གི་བདེ་བ་དང་ཕྱག་རྒྱ་ཆེན་པོའི་མཐའ་ལ་སོགས་པའི་ཕྱོགས་ཙམ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། ཡོན་དབུལ་བ་དང་བཅས་པའི་དབང་གི་རིམ་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། དཀྱིལ་འཁོར་གྱི་འཁོར་ལོ་བསྐྱེད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། སྔགས་བཏུ་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། མཆོད་སྦྱིན་གྱི་ཆོ་ག་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། མཆོད་པའི་ཆོ་ག་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། སྦྱིན་སྲེག་གི་ཆོ་ག་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། ཚོགས་ཀྱི་འཁོར་ལོའི་ཆོ་ག་དང་། གཏོར་མ་ཆེན་པོ་དང་། རྣལ་འབྱོར་མའི་མཚན་ཉིད་དང་། གསང་བའི་ཚིག་དང་། ཕྱག་རྒྱའི་བརྡ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། རྣམ་པ་དང་བཅས་པའི་དཀྱིལ་འཁོར་སྒོམ་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། སྔགས་ཀྱི་བཟླས་པའི་རིམ་པ་དང་། མཆོད་སྦྱིན་གྱི་ཆོ་ག་དང་། དཀྱིལ་འཁོར་སྐྱེད་པའི་རིམ་པ་དང་། གནས་ཀྱི་དོན་དང་རྩའི་འཁོར་ལོ་འབྱུང་བ་དང་། དེ་ཁོ་ན་ཉིད་ཀྱི་དོན་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། མཆོད་པའི་རིམ་པ་དང་གསང་བའི་སྐད་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། དབང་བསྐུར་བའི་ངེས་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། མཆོད་པ་སྣ་ཚོགས་ངེས་པར་བསྟན་པ་དང་ནང་གི་སྦྱིན་སྲེག་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། འབྱུང་བ་བསྲུང་བའི་དོན་དུ་གཏོར་མ་ཆེན་པོ་ངེས་པར་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། དེ་ཁོ་ན་ཉིད་གསུམ་ལ་སོགས་པའི་རྒྱས་པ་ངེས་པར་བསྟན་པའི་རང་བཞིན་གྱི་དོན་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། དུར་ཁྲོད་ཀྱི་ངེས་པར་བསྟན་པའི་དོན་དང་། ནང་གི་བསམ་གཏན་གྱི་ཉེ་བར་འགྲོ་བ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། དཔལ་ཡེ་ཤེས་ཐིག་ལེའི་ཚད་དང་། གནས་དང་། ས་བསྟན་པའི་དོན་དང་། ཕུང་པོ་རྣམ་པར་དག་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། བླ་མ་དང་སློབ་མའི་མཚན་ཉིད་བརྟག་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། རྩ་བའི་རྒྱུད་ལ་སོགས་པའི་རིམ་པ་དང་། དོན་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། དཔལ་ཕྱག་རྒྱ་ཆེན་པོ་བཅོམ་ལྡན་འདས་མའི་རང་གི་ངོ་བོ་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ���གཉིས་པ། གསང་བའི་དོན་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཤུ་རྩ་གསུམ་པ། བསྐུལ་བ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། དབང་བསྐུར་བ་བླང་བ་དང་། ཕྱག་རྒྱའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། ཚིག་རྒྱས་པར་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། དེ་ཁོ་ན་ཉིད་ཀྱི་སྙིང་པོ་བསྡུས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། རྣམ་པར་དག་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བརྒྱད་པ། དཔལ་ཕྱག་ན་རྡོ་རྗེའི་དཀྱིལ་འཁོར་བསྐྱེད་པའི་སྒོམ་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དགུ་པ། བསྟོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་པ། མཆོག་ཆེན་པོ་ནང་གི་རྣམ་པར་ཤེས་པ་དྲུག་གི་བསྟོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:1,t:"དཔལ་དེ་ཁོ་ན་ཉིད་ཀྱི་སྒྲོན་མ་ཞེས་བྱ་བའི་རྣལ་འབྱོར་ཆེན་མོའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"རྒྱུད་ཀྱི་རྒྱལ་པོ་དཔལ་བདེ་མཆོག་ཉུང་ངུ་ཞེས་བྱ་བ།"}
,{d:2,t:"དང་པོ། དཀྱིལ་འཁོར་དུ་འཇུག་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། འཁོར་ལོ་མཆོད་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། ཡོན་ཏན་དང་བཅས་པའི་དབང་བསྐུར་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། དཔའ་བོ་དང་རྣལ་འབྱོར་མ་གཉིས་སུ་མེད་པར་དགོད་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། རྩ་བའི་སྔགས་ཀྱི་ཡི་གེ་བཏུ་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། དཔའ་བོ་དྲུག་གི་གོ་ཆ་བཏུ་བའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། སྔགས་བཏུ་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། གོ་བཟློག་པའི་སྙིང་པོ་དང་རྣལ་འབྱོར་མ་དྲུག་གི་སྔགས་བཏུ་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། རྩ་བའི་སྔགས་ཀྱི་ལས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། སྐུ་གསུམ་གྲུབ་པའི་སྙིང་པོའི་སྔགས་ཀྱི་ལས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། སྐྱེ་བ་བདུན་པའི་མཚན་ཉིད་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། ཉེ་བའི་སྙིང་པོའི་ལས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། གོ་ཆའི་སྔགས་ཀྱི་ལས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། དཔལ་ཧེ་རུ་ཀ་རྣམ་པར་མཛད་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅྭ་ལྔ་པ། ཡི་གེའི་བརྡའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། རྣལ་འབྱོར་མའི་མཚན་ཉིད་ངེས་པར་བརྟག་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། རྣལ་འབྱོར་མ་ཐམས་ཅད་ཀྱི་གཟུགས་ཡོངས་སུ་བརྗེ་བ་དང་ཕྱག་མཚན་དང་ཕྱག་རྒྱ་བསྟན་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅྭ་བརྒྱད་པ། རྣལ་འབྱོར་མ་ཐམས་ཅད་ཀྱི་ཁ་དོག་གི་མཚན་ཉིད་དང་མཚན་མའི་ངེས་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། རྣལ་འབྱོར་མ་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་དང་ཕྱག་རྒྱའི་ལན་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། རྣལ་འབྱོར་མ་ཐམས་ཅད་ཀྱི་ལག་པའི་ཕྱག་རྒྱའི་བརྡའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། ཡན་ལག་གི་མཚན་ཉིད་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། ཁྱད་པར་གྱི་ཕྱག་རྒྱའི་མཚན་ཉིད་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། མཁའ་འགྲོ་མའི་ཁྱད་པར་གྱི་མཚན་མའི་ཕྱག་རྒྱའི་མཚན་ཉིད་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། སྡེ་བཞིའི་མཚན་ཉིད་ཐམས་ཅད་ཀྱི་བརྡའི་ཚིག་གི་བརྡར་བཏགས་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉིར་ལྔ་པ། རྩ་བའི་སྔགས་ཀྱི་གསང་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉིར་དྲུག་པ། སློབ་མ་ཡོངས་སུ་བརྟག་པ་དང་སྡོམ་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། སྤྱོད་པ་དང་བརྟུལ་ཞུགས་དང་མཆོད་པ་དང་གཏོར་མའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བརྒྱད་པ། ནང་གི་སྦྱིན་སྲེག་དང་རིགས་གཅིག་དང་ལྡན་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དགུ་པ། ཕོ་ཉའི་མཚན་ཉིད་དང་གནས་སྐབས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་པ། རྫ་རྔ་བཅིང་བའི་སྔགས་བཏུ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཅིག་པ། བཟའ་བ་དང་སྦྱིན་སྲེག་དང་གཏོར་མའི་བྱ་བ་ལ་ལག་པའི་བརྡའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཉིས་པ། དུད་འགྲོ་ཕྱུགས་དང་རོ་ལངས་སྒྲུབ་པ་དང་བསྐྱེད་པའི་རིམ་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གསུམ་པ། གསང་བའི་མཆོད་པ་དང་བསྙེན་བཀུར་གྱི་མཆོད་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བཞི་པ། ཕོ་ཉ་མོའི་སྦྱིན་སྲེག་དང་ལས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་ལྔ་པ། གཉིས་སུ་མེད་པའི་ལས་དང་དུས་མ་ཡིན་པར་འཆི་བ་བླུ་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དྲུག་པ། དེ་ཁོ་ན་ཉིད་ཀྱི་མཆོད་པ་དང་ལས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བདུན་པ། ནང་གི་བདག་ཉིད་ཀྱི་དབང་དུ་བྱ་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བརྒྱད་པ། རྣལ་འབྱོར་མའི་སྒྲུབ་པའི་ས་དང་གསང་བའི་དཔའ་བོའི་གནས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དགུ་པ། བལྟ་བ་དང་ཧ་ཧར་རྒོད་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་པ། རིགས་ལྔ་པོ་དབང་དུ་བྱ་བ་དང་ཕྱག་རྒྱ་ཆེན་པོ་བསྟེན་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གཅིག་པ། ཡི་གེ་ཉི་ཤུ་རྩ་བཞིའི་དཀྱིལ་འཁོར་དགོད་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གཉིས་པ། བཞད་པའི་སྔགས་དང་མཁའ་འགྲོ་མའི་གཟུགས་ཀྱི་སྒྱུ་མའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གསུམ་པ། ཉེ་བའི་སྙིང་པོའི་ལས་སྒྲུབ་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བཞི་པ། རྣལ་འབྱོར་མ་དྲུག་གི་ཡི་གེ་བདུན་གྱི་ལས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་ལྔ་པ། རྣལ་འབྱོར་མ་དྲུག་དང་ཚིག་གི་དངོས་གྲུབ་ལུང་བསྟན་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་དྲུག་པ། ཡི་གེ་ཧ་ལྔའི་ལས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བདུན་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མཁའ་འགྲོ་མའི་སྔགས་ཀྱི་ལས་ཐམས་ཅད་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བརྒྱད་པ། དཔའ་བོ་དང་མཁའ་འགྲོ་མ་ཐམས་ཅད་ཀྱི་གནས་གསང་བའི་དཀྱིལ་འཁོར་གྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་དགུ་པ། སྐྱེ་བ་བདུན་པའི་བསྒྲུབ་པར་བྱ་བའི་གཟུགས་ཡོངས་སུ་བརྗེ་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་པ། དབང་གི་སྦྱིན་སྲེག་དང་གནས་ལ་སོགས་པའི་ས་བསྟན་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་གཅིག་པ།"}
,{d:1,t:"མངོན་པར་བརྗོད་པའི་རྒྱུད་བླ་མ་ཞེས་བྱ་བ།"}
,{d:2,t:"དང་པོ། དམ་ཚིག་ལ་འཇུག་པའི་གསང་བ་སྦས་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཞུ་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། དེ་ཁོ་ན་ཉིད་ཀྱི་སྙིང་པོའི་དོན་དམ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། སྐུའི་སྡོམ་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། གསུང་གི་སྡོམ་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། ཐུགས་ཀྱི་སྡོམ་པ་དང་བླ་མའི་བསྙེན་བཀུར་གྱི་ལེའུ།"}
,{d:2,t:"བདུན་པ། སྡོམ་པའི་དམ་ཚིག་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། གནས་ཀྱི་རིམ་པའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། གཉིས་སུ་མེད་པའི་འཁོར་ལོའི་རིམ་པར་ཕྱེ་བ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། འཁོར་ལོ་གསུམ་གྱི་དཀྱིལ་འཁོར་གྱི་ཆོ་གའི་རིམ་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། དངོས་གྲུབ་ཀྱི་གནས་ཀྱི་རིམ་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། རྣལ་འབྱོར་མའི་གནས་བསྒྲུབ་པའི་མཚན་མའི་རིམ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། རེའུ་མིག་དགོད་པ་དང་གནས་བསྡུ་བ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། གཉིས་སུ་མེད་པར་སྦྱོར་བའི་གནས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། དཔལ་ཧེ་རུ་ཀ་དང་མཁའ་འགྲོ་མ་དང་དཔའ་བོ་དང་རྣལ་འབྱོར་མ་རྣམས་བསྒོམས་པས་བསྐྱེད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། ལས་དང་པོ་པའི་སྦྱོར་བའི་བསྒོམ་པ་བསྟན་པའི་ལེའ།"}
,{d:2,t:"བཅུ་བདུན་པ། དབང་པོ་བར་མའི་བསྒོམ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། དབང་པོ་རྣོན་པོའི་སྒོམ་པ་རྗེས་སུ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། མཁའ་འགྲོ་མ་བཞིའི་སྦྱོར་བའི་སྡོམ་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། རྣལ་འབྱོར་གྱི་སྡོམ་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། སྲུང་བའི་ཕྱིར་ཟློག་གི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། འཆི་བ་སློང་བར་བྱེད་པའི་ལས་ཐམས་ཅད་བྱེད་པ་སྒོམ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། རྣལ་འབྱོར་མའི་གསང་བའི་དམ་ཚིག་གི་དེ་ཁོ་ན་ཉིད་ཀྱི་སྒོམ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། རིགས་དྲུག་གི་འཁོར་ལོས་སྒྱུར་བའི་བཀའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། སྐུ་གསུང་ཐུགས་ཀྱི་གནས་ཀྱི་རིམ་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། དམ་ཚིག་ལས་ལྡང་བ་སངས་རྒྱས་ཐོད་པ་བསྐྱེད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། རྡོ་རྗེ་སེམས་དཔའ་སྐྱེད་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བརྒྱད་པ། འཇམ་པའི་རྡོ་རྗེ་སྒྲུབ་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དགུ་པ། ཀྵའི་མཁའ་འགྲོ་སྒྲུབ་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་པ། གསང་བ་ཆེན་པོའི་གསང་བ་ཨཱ་ལིའི་མཁའ་འགྲོ་སྒྲུབ་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཅིག་པ། གསལ་བྱེད་མཁའ་འགྲོའི་སྒྲུབ་པའི་མཚན་མ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཉིས་པ། དམ་ཚིག་གི་སྡོམ་པ་འབྱུང་བའི་དཀྱིལ་འཁོར་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གསུམ་པ། སྦྱངས་པའི་ཡོན་ཏན་སྐྱེད་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བཞི་པ། ཆར་དབབ་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་ལྔ་པ། སྣ་ཚོགས་སྒྲུབ་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དྲུག་པ། གསང་བ་གསུམ་གྱི་དམ་ཚིག་གི་མཆོག་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བདུན་པ། གཉིས་སུ་མེད་པའི་གོ་ཆའི་སྦྱོར་བ་སྐྱེད་པའི་སྒོམ་པའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བརྒྱད་པ། བརྡའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དགུ་པ། རྣལ་འབྱོར་མའི་མཚན་མའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་པ། མཁའ་འགྲོ་མའི་མཚན་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གཅིག་པ། ལཱ་མའི་མཚན་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གཉིས་པ། བརྡའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གསུམ་པ། ཡན་ལག་གི་ཕྱག་རྒྱའི་མཚན་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བཞི་པ། མཁའ་འགྲོ་མའི་ཡན་ལག་གི་ཕྱག་རྒྱའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་ལྔ་པ། མཁའ་འགྲོ་མའི་བརྡའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་དྲུག་པ། ཕོ་ཉའི་གྲངས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བདུན་པ། མཁའ་འགྲོ་མ་དང་དཔའ་བོའི་ལས་ཀྱི་རིམ་པ་སྒྲུབ་པ་རྣལ་འབྱོར་མ་དང་དཔའ་བོ་གཉིས་སུ་མེད་པའི་སྙིང་པོའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བརྒྱད་པ། རས་རིས་ལ་སོགས་པ་རབ་ཏུ་གནས་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་དགུ་པ། དཀྱིལ་འཁོར་གྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་པ། དབྱངས་སྐྱོང་གི་མཚམས་ཀྱི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་གཅིག་པ། ཉེ་བའི་སྙིང་པོ་བསྒོམས་པས་སྐྱེད་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་གཉིས་པ། ཡི་གེ་ཉི་ཤུ་རྩ་གཉིས་ཀྱི་སྙིང་པོ་བསྒོམས་པས་སྐྱེད་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་གསུམ་པ། དཀྱིལ་འཁོར་གྱི་སྒོམ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་བཞི་པ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་གྲོང་ཁྱེར་སྒོམ་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་ལྔ་པ། གསང་བ་སྦྱོར་བའི་སྒོམ་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་དྲུག་པ། གསང་བའི་ཡི་གེ་སྐྱེད་ཅིང་སྒྲུབ་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་བདུན་པ། རྩ་བའི་སྔགས་ཀྱི་ཡི་གེ་བཏུ་བའི་རྡོ་རྒྱུས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་བརྒྱད་པ། གོ་ཆའི་སྙིང་པོ་སྒོམ་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་དགུ་པ། གོ་ཆ་དང་ལྷ་མོའི་སྙིང་པོ་སྒོམ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་པ། སྲུང་བ་ཞལ་བཞི་པར་བྱིན་གྱིས་བརླབས་པ་ཁྲོ་བོ་བཞིའི་དཀྱིལ་འཁོར་རྡོ་རྒྱུས་ཀྱིས་བྲིས་པ་རྡོ་རྗེ་ཧཱུཾ་མཛད་སྐྱེད་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་གཅིག་པ། སྡེ་ཚན་གྱི་སྦྱོར་བའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་གཉིས་པ ། ཇི་ལྟར་འདོད་པའི་བོང་བུའི་མཛད་པ་དངོས་གྲུབ་ཀྱི་རྒྱུ་སྒྲུབ་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་གསུམ་པ། གསང་བའི་ཡེ་ཤེས་ཀྱི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་བཞི་པ། ལྷ་མོ་བཞིའི་གསང་བ་ཁ་སྦྱོར་གྱི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་ལྔ་པ། ཁྲོ་བོ་རྡོ་རྗེ་འཇིགས་བྱེད་ཆེན་པོའི་བདག་པོའི་ཁ་སྦྱར་གནོན་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་དྲུག་པ། སྐྱེ་བ་བདུན་པའི་ཕྱུགས་ཆེན་སྒྲུབ་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་བདུན་པ། བདག་ཉིད་བཅོས་་ཀྱི་ཡི་གེ་ལས་བསྐྱེད་པའི་བྱིན་གྱིས་བརླབས་པའི་སྒོམ་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་བརྒྱད་པ། བདག་འདུལ་བའི་མཆོད་པའི་ལེའུ།"}
,{d:2,t:"དྲུག་ཅུ་རྩ་དགུ་པ། གསང་བའི་ཡང་གསང་བ་བདེ་མཆོག་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཆེན་པོ་ཐེ་ཚོམ་མེད་པར་དེ་ཁོ་ན་སྒོམ་པ་བསྟན་པའི་ལེའུ།"}
,{d:1,t:"རྒྱུད་ཀྱི་རྒྱལ་པོ་ཆེན་པོ་དཔལ་རྡོ་རྗེ་མཁའ་འགྲོ་ཞེས་བྱ་བ།"}
,{d:2,t:"དང་པོ ། དེ་ཁོ་ན་ཉིད་སྣང་བ་དམ་པའི་ཡུལ་ལ་འཇུག་པའི་ཡེ་ཤེས་ཀྱི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"གཉིས་པ། སྒྱུ་མ་ཆེན་པོས་རྣམ་པར་འཕྲུལ་པའི་སྔགས་ཀྱི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"གསུམ་པ། ཀླུ་ཐམས་ཅད་དགུག་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཞི་པ། ལས་ཐམས་ཅད་ཀྱི་ཚོགས་རབ་ཏུ་འབྱུང་བ་ཞེས་བྱ་བའི་ཆོ་ག་རྒྱས་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ལྔ་པ། ཀླུ་ཐམས་ཅད་དགུག་པ་དང་། གཞུག་པ་དང་། བཅིང་བའི་ཆོ་ག་རྒྱས་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"དྲུག་པ། ཀླུའི་སྔགས་ཐམས་ཅད་ཀྱི་རབ་ཏུ་སྦྱོར་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བདུན་པ ། མཁའ་འགྲོ་མ་ཐམས་ཅད་ཀྱི་བརྡའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བརྒྱད་པ ། ལག་པའི་ཕྱག་རྒྱའི་སྦྱོར་བ་དང། སོས་བཏབ་པའི་མཚན་མ་ལ་སོགས་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"དགུ་པ། འཁྲུལ་འཁོར་ཐམས་ཅད་འབྱུང་བ་ཞེས་བྱ་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་པ། དབུགས་བརྩི་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་གཅིག་པ། སྒྱུ་མ་ཀུན་ཏུ་རྣམ་པར་འཕྲུལ་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་གཉིས་པ། རྡོ་རྗེ་མཁའ་འགྲོ་འབྱུང་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་གསུམ་པ། དཔའ་བོའི་གཉིས་སུ་མེད་པའི་མཆོད་པ་དང་། ལས་ཀྱི་ཚོགས་རྣམས་འབྱུང་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་བཞི་པ། དཔའ་བོ་གཉིས་སུ་མེད་པའི་གནས་བསྟན་པ་ཞེས་བྱ་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅོ་ལྔ་པ། སྐུ་གསུམ་དང་སྔགས་དང་རྒྱུད་ཀྱི་འབྱུང་བ་དང་། འཆི་བ་བླུ་བ་ཞེས་བྱ་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་དྲུག་པ། དཔའ་བོ་ཐམས་ཅད་དང་མཉམ་པར་སྦྱོར་བའི་འཁོར་ལོ་འབྱུང་བ་ཞེས་བྱ་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་བདུན་པ། བཅུད་ཀྱིས་ལེན་གྱི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། འདུ་བའི་གནས་ངེས་པ་དང་། སྒྲུབ་པའི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་དགུ་པ། འབྱུང་བོ་དང་གདོན་ཐམས་ཅད་ཀྱི་སྒྲུབ་ཐབས་འབྱུང་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་པ། རྩ་བ་དང་མཉམ་པར་སྦྱོར་བའི་དབུགས་འབྱུང་བ་ཞེས་བྱ་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། གོང་དུ་འཕོ་བའི་བསམ་གཏན་དང་། སེང་གེ་རྣམ་པར་རོལ་པའི་ཕྱག་རྒྱའི་སྦྱོར་བ་འབྱུང་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། རྣལ་འབྱོར་པ་དང་རྣལ་འབྱོར་མ་རྣམས་ཀྱི་དག་གི་ཕྱག་རྒྱའི་བརྡ་ཡིས་རོལ་པའི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། གཟའ་དང་ཉི་མའི་ངེས་པར་འཆི་བ་ཚར་གཅད་པའི་དབང་དུ་བྱས་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། གཟའ་རྣམས་ཀྱི་རྒྱུ་བ་དང་སྡེ་ཚན་གྱི་ལྟས་ཀྱི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། ཐམས་ཅད་རྒྱུ་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། དུས་འབྱུང་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། སྐར་མ་རྣམས་ཀྱི་སྟོབས་ལ་དབང་བའི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བརྒྱད་པ། ཚེས་གྲངས་དང་སྐར་མའི་ངེས་པ་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དགུ་པ། ཡེ་ཤེས་འབྱུང་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"སུམ་ཅུ་པ། རྡོ་རྗེ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་འབྱུང་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཅིག་པ། རྡོ་རྗེ་དང་དྲིལ་བུའི་མཚན་ཉིད་དང་ཚད་ཀྱི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཉིས་པ། བླ་མའི་བསྙེན་བཀུར་དང་། དམ་ཚིག་དང་སྡོམ་པའི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གསུམ་པ། སྔགས་ཀྱི་ཆོ་ག་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བཞི་པ། རྡོ་རྗེ་དབང་བསྐུར་བའི་བརྡའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་ལྔ་པ། ཧེ་རུ་ཀའི་རྣམ་པར་རོལ་པའི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དྲུག་པ། བརྡ་ཡིས་རོལ་པ་དང་དམ་ཚིག་དང་སྡོམ་པའི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བདུན་པ། མཚོན་ཆ་ཐམས་ཅད་ཀྱི་བརྡའི་ཡེ་ཤེས་ཀྱི་གོ་ཆའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བརྒྱད་པ། ཕོ་ཉ་གདུལ་བའི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དགུ་པ། སྟོབས་སྐྱེད་པའི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཞི་བཅུ་པ། འབྲས་བུ་བཅོས་མའི་ཕྱག་རྒྱའི་ཡེ་ཤེས་ཀྱི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གཅིག་པ། ཨཱ་ལི་ཀཱ་ལིའི་སྔགས་ཀྱི་སྒྲུབ་ཐབས་འབྱུང་བའི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གཉིས་པ། གསང་བ་ཞེས་བྱ་བ་ལ་སོགས་པ་དེ་ཁོ་ན་ཉིད་འབྱུང་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གསུམ་པ། ལས་ཐམས་ཅད་ཀྱི་བསམ་གཏན་འབྱུང་བ་དང་སྦྱིན་སྲེག་གི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བཞི་པ།  རོ་ལངས་སྒྲུབ་པ་དང་། ནང་གི་སྦྱིན་སྲེག་གི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་ལྔ་པ། བཟླས་པའི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་དྲུག་པ། ས་གཟུང་བ་དང་། སྟ་གོན་ལ་གནས་པ་དང་། ཐིག་བྲི་བའི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བདུན་པ། བཅུད་ཀྱིས་ལེན་གྱི་རྫས་ཀྱི་དབང་དུ་བྱས་པའི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བརྒྱད་པ། ལས་ཐམས་ཅད་ཀྱི་གསང་ཆེན་སྦྱིན་སྲེག་གི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་དགུ་པ། བཅུད་ཀྱིས་ལེན་གྱི་སྦྱོར་བ་དང་། སྡོམ་པའི་ཆོ་གའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ལྔ་བཅུ་པ། རྡོ་རྗེ་སེམས་དཔའི་དབུགས་དབྱུང་བ་དང་། རང་བཞིན་ཉིད་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:1,t:"རྡོ་རྗེ་མཁའ་འགྲོ་ཞེས་བྱ་བའི་རྒྱུད་ཕྱི་མ།"}
,{d:2,t:"ལེའུ་དང་པོ།"}
,{d:2,t:"ལེའུ་གཉིས་པ།"}
,{d:2,t:"ལེའུ་གསུམ་པ།"}
,{d:2,t:"ལེའུ་བཞི་པ།"}
,{d:2,t:"ལེའུ་ལྔ་པ།"}
,{d:2,t:"ལེའུ་དྲུག་པ།"}
,{d:2,t:"ལེའུ་བདུན་པ།"}
,{d:2,t:"ལེའུ་བརྒྱད་པ།"}
,{d:2,t:"ལེའུ་དགུ་པ།"}
,{d:2,t:"ལེའུ་བཅུ་པ།"}
,{d:2,t:"ལེའུ་བཅུ་གཅིག་པ།"}
,{d:2,t:"ལེའུ་བཅུ་གཉིས་པ།"}
,{d:2,t:"ལེའུ་བཅུ་གསུམ་པ།"}
,{d:2,t:"ལེའུ་བཅུ་བཞི་པ།"}
,{d:1,t:"དཔལ་མཁའ་འགྲོ་རྒྱ་མཚོ་རྣལ་འབྱོར་མའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཆེན་པོ་ཞེས་བྱ་བ།"}
,{d:2,t:"དང་པོ། ཡེ་ཤེས་ཀྱི་རྒྱ་མཚོ་ལ་འཇུག་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། རྡོ་རྗེ་ཕག་མོ་སྐྱེད་པ་དང་གཙོ་མོ་དང་འཁྲུལ་འཁོར་གྱི་འཁོར་ལོ་དང་། དཀྱིལ་འཁོར་སྒོམ་པ་ལ་སོགས་པའི་རང་བཞིན་གྱི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། མཁའ་འགྲོ་མ་སྐྱེད་པའི་མཚན་ཉིད་དང་།  བདེ་བ་ལ་ཀུན་དུ་སྤྱོད་པའི་ལས་ཀྱི་དེ་ཁོ་ན་ཉིད་ཀྱི་རྣམ་པར་གཞག་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། ལཱ་མ་བསྐྱེད་པའི་མཚན་ཉིད་དང་སྔགས་དགོད་པ་དང་། འཁོར་ལོས་སྒྱུར་བ་དྲུག་ལ་སོགས་པའི་རང་བཞིན་དང་མྱ་ངན་ལས་འདས་པ་ལ་སོགས་པའི་རྣམ་པར་གཞག་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། དུམ་སྐྱེས་མའི་མཚན་ཉིད་དང་སྐྱེད་པ་དང་། འཁོར་ལོ་བཞིའི་རྩའི་རྣམ་པར་གཞག་པའི་མིང་མདོར་བསྟན་པ་དང་། སྔགས་དགོད་པ་ལ་སོགས་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། གཟུགས་ཅན་མའི་མཚན་ཉིད་ཀྱི་རང་བཞིན། རྩའི་འཁོར་ལོའི་རང་བཞིན་དང་གནས་ཀྱི་རྣམ་པར་གཞག་པ་དང་རྒྱུད་ཀྱི་མཚན་ཉིད་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། ཁྭ་གདོང་མ་ལ་སོགས་པའི་སྲོག་སྐྱེད་པའི་མཚན་ཉིད་ཀྱི་ཆོ་གའི་ལེའོུ།"}
,{d:2,t:"བརྒྱད་པ། འུག་གདོང་མའི་ངེས་པའི་ཚུལ་དང་ཡང་དག་པའི་ཆོ་ག་ལས་སྐྱེད་པ་དང་སྲོག་ལ་སོགས་པའི་མཚན་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"དགུ་པ། ཁྱི་གདོང་མའི་མཚན་ཉིད་དང་བདེ་བ་ལ་སོགས་པའི་གནས་སྐབས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། ཕག་གདོང་མ་སྐྱེད་པ་དང་དཀྱིལ་འཁོར་ལ་འཇུག་པ་ལ་སོགས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། གཤིན་རྗེ་བརྟན་མའི་རྣམ་པར་གཞག་པ་དང་སྐྱེད་པའི་མཚན་ཉིད་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། གཤིན་རྗེ་ཕོ་ཉ་མོ་སྐྱེད་པ་ལ་སོགས་པའི་མཚན་ཉིད་དང་འཆི་བ་བསླུ་བའི་འཁོར་ལོ་བསྒོམ་པའི་མན་ངག་མདོར་བསྡུས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། གཤིན་རྗེ་མཆེ་བ་མའི་རབ་ཏུ་སྦྱོར་བ་ལ་འཇུག་པ་འཆི་བ་བསླུ་བ་ལ་སོགས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། གཤིན་རྗེ་འཇོམས་མ་འཇུག་པ་སྐྱེད་པ་དང་དུས་སུ་འཆི་བ་བསླུ་བའི་ཆོ་གའི་མཚན་ཉིད་དང་སངས་རྒྱས་ཀྱི་གནས་སྐབས་ཀྱི་རང་བཞིན་གྱི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། བཅོམ་ལྡན་འདས་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་རྣམ་པར་གཞག་པ་དང་མན་ངག་སྣ་ཚོགས་བསྟན་པའི་ལེའུ།"}
,{d:3,t:"གཉིས་པ། སྙིང་པོའི་འཁོར་ལོ།"}
,{d:3,t:"གསུམ་པ། ཡོན་ཏན་གྱི་འཁོར་ལོ།"}
,{d:3,t:"དང་པོ། ནམ་མཁའི་འཁོར་ལོ།"}
,{d:3,t:"གཉིས་པ། རླུང་གི་འཁོར་ལོ།"}
,{d:3,t:"གསུམ་པ། སའི་དཀྱིལ་་འཁོར་ལ་རིམ་པ་གཉིས་དང་བཅས་པ།"}
,{d:3,t:"དང་པོ། ལོངས་སྤྱོད་རྫོགས་པའི་འཕར་མའི་མེའི་འཁོར་ལོ།"}
,{d:3,t:"གཉིས་པ། ཆུའི་འཁོར་ལོ།"}
,{d:3,t:"གསུམ་པ། ཡེ་ཤེས་ཀྱི་འཁོར་ལོ།"}
,{d:3,t:"དང་པོ། ཐུགས་ཀྱི་འཁོར་ལོ།"}
,{d:3,t:"གཉིས་པ། གསུང་གི་འཁོར་ལོ།"}
,{d:3,t:"གསུམ་པ། སྐུ་ཡི་འཁོར་ལོ།"}
,{d:2,t:"བཅུ་དྲུག་པ། རྩ་བའི་སྔགས་བཏུ་བའི་ཆོ་གའི་མཚན་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། རྡོ་རྗེ་སེམས་དཔའ་དང་ཕག་མོའི་གོ་ཆ་སྐྱེད་པའི་མཚན་ཉིད་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། རྣམ་པར་སྣང་མཛད་ལ་སོགས་པའི་གོ་ཆ་སྲུང་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། པདྨ་གར་གྱི་དབང་ཕྱུག་ལ་སོགས་པའི་སྲུང་བ་གོ་ཆའི་སྔགས་གཏན་ལ་དབབ་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། ཧེ་རུ་ཀ་ལ་སོགས་པའི་སྲུང་བའི་གོ་ཆའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། རྡོ་རྗེ་ཉི་མ་ལ་སོགས་པའི་གོ་ཆའི་སྲུང་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། རྟ་མཆོག་ལ་སོགས་པའི་གོ་ཆའི་སྲུང་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། གཏོར་མ་དང་འཁོར་ལོ་མཆོད་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། དཀྱིལ་འཁོར་དང་སྦྱིན་སྲེག་དང་སློབ་དཔོན་མཆོད་པའི་ཆོ་ག་ཞེས་བྱ་བའི་ལའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། བཅོམ་ལྡན་འདས་ཞེས་བྱ་བ་ལ་སོགས་པའི་རྣམ་པར་དག་པ་དང་དེ་བཞིན་དུ་རབ་ཏུ་གནས་པའི་ཆོ་གའི་མཚན་ཉིད་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། རབ་ཏུ་གཏུམ་མོ་བདག་པོའི་དཀྱིལ་འཁོར་དུ་རྣལ་འབྱོར་མ་དང་དཔའ་བོ་རྣམས་ཀྱི་ཕྱག་རྒྱའི་བརྡ་ཡིས་གནས་པའི་མཚན་ཉིད་ཀྱི་ཆོ་ག་ཞེས་བྱ་བའི་སྤྱོད་ཡུལ་གྱི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། གཏུམ་མིག་མའི་མཚན་ཉིད་ཀྱི་ཕྱག་རྒྱ་དང་བདག་པོའི་རང་བཞིན་གྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བརྒྱད་པ། འོད་ལྡན་མའི་མཚན་ཉིད་ཀྱི་ཕྱག་རྒྱའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དགུ་པ། སྣ་ཆེན་མའི་མཚན་ཉིད་ཀྱི་བརྡའི་ཆོ་གའི་ངེས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་པ། ཕྱག་རྒྱ་དང་ཕྱག་རྒྱའི་ལན་དཔའ་བོའི་བློ་གྲོས་མའི་ཆོ་གའི་མཚན་ཉིད་ཀྱི་མིང་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཅིག་པ། མིའུ་ཐུང་མའི་ཡི་གེའི་བརྡའི་མཚན་ཉིད་ཀྱི་རང་བཞིན་གྱི་ཡེ་ཤེས་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཉིས་པ། ལང་ཀའི་དབང་ཕྱུག་མའི་ཕྱག་རྒྱའི་བརྡའི་མཚན་ཉིད་དང་དཀྱིལ་འཁོར་གྱི་འཁོར་ལོའི་རང་བཞིན་དང་མིང་གི་ཆོ་གའི་ཡེ་ཤེས་ཀྱི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གསུམ་པ། ཤིང་གྲིབ་མའི་རང་གི་མཚན་ཉིད་ཀྱི་ཕྱག་རྒྱའི་བརྡའི་ཆོ་གའི་ངེས་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བཞི་པ། ས་སྲུང་མའི་སྐུའི་ཕྱག་རྒྱའི་མཚན་ཉིད་ཀྱི་ཆོ་ག་དང་ལྡན་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་ལྔ་པ། འཇིགས་བྱེད་ཆེན་མོའི་ནང་གི་ཕྱག་རྒྱའི་ཆོ་ག་འཆད་པའི་མཚན་ཉིད་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དྲུག་པ། རླུང་ཤུགས་མའི་ཁ་དོག་གི་ཕྱག་རྒྱའི་ཆོ་གའི་མཚན་ཉིད་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བདུན་པ། ཆང་འཐུང་མའི་རབ་ཏུ་སྦྱོར་བའི་བརྡའི་རང་བཞིན་གྱི་མཚན་ཉིད་ཀྱི་ཆོ་ག་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བརྒྱད་པ། རྡོ་རྗེ་ཕག་མོ་དང་གཉིས་སུ་མེད་པའི་ལྗང་ལྷ་མོའི་དབང་དུ་བྱ་བའི་སྦྱིན་སྲེག་དང་འཁྲུལ་འཁོར་གྱི་འཁོར་ལོ་དང་རྡོ་རྗེའི་དཀྱིལ་འཁོར་གྱི་ཆོ་གའི་མཚན་ཉིད་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དགུ་པ། བཅོམ་ལྡན་འདས་ཀྱི་རྩ་བའི་སྔགས་དང་། ཤིན་ཏུ་བཟང་མོ་གཉིས་སུ་མེད་པའི་སྦྱོར་བའི་བདག་ཉིད་ཅན་རྟའི་སྔགས་མདོར་བསྟན་པ་རིགས་ཀྱི་ཀླུའི་ལས་ཀྱི་ཆོ་གའི་མཚན་ཉིད་ཀྱི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་པ། རྟ་རྣ་མ་དང་དཔའ་བོ་གཉིས་སུ་མེད་པའི་སྦྱོར་བས་གོ་ཆ་དང་རྩ་བའི་སྔགས་ཀྱི་ཆོ་གའི་མཚན་ཉིད་ཀྱི་བསད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གཅིག་པ། བྱ་གདོང་མ་དང་དཔའ་བོ་གཉིས་སུ་མེད་པའི་སྨྱོ་བར་བྱེད་པའི་འཁྲུལ་འཁོར་འཁོར་ལོའི་རང་བཞིན་གྱི་མཚན་ཉིད་ཀྱི་ཆོ་གའི་སྙིང་པོའི་སྔགས་དང་བཅས་པའི་ལས་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གཉིས་པ། འཁོར་ལོའི་ཤུགས་ཅན་མའི་རེངས་པར་བྱ་བའི་ལས་དཔའ་བོ་དང་གཉིས་སུ་མེད་པའི་སྦྱོར་བའི་མཚན་ཉིད་ཀྱི་རང་བཞིན་ཞེས་བྱ་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གསུམ་པ། དུམ་སྐྱེས་མའི་རབ་ཏུ་སྦྱོར་བ་སྒོམ་པའི་འཁྲུལ་འཁོར་གྱི་འཁོར་ལོ་བསྐྲད་པའི་ལས་རྣལ་འབྱོར་མ་དྲུག་གི་གོ་ཆའི་སྔགས་ཀྱི་ཆོ་གའི་མཚན་ཉིད་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བཞི་པ། ཆང་འཚོང་མའི་རབ་ཏུ་སྦྱོར་བས་དབྱེ་བའི་མཚན་ཉིད་ཀྱི་ཆོ་གའི་འཁྲུལ་འཁོར་གྱི་འཁོར་ལོའི་རང་བཞིན་གྱི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་ལྔ་པ། འཁོར་ལོའི་གོ་ཆ་མའི་ལྐུགས་པར་བྱ་བའི་རབ་ཏུ་སྦྱོར་བའི་ཆོ་གའི་མཚན་ཉིད་དང་འཁོར་ལོ་སྒོམ་པ་དང་དཔའ་བོ་དང་གཉིས་སུ་མེད་པའི་རྣལ་འབྱོར་སྲིན་པོའི་རྣམ་པའི་འཁྲུལ་འཁོར་གྱི་འཁོར་ལོ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་དྲུག་པ། ཤིན་ཏུ་དཔའ་མོའི་ཞི་བའི་ལས་ཀྱི་རབ་ཏུ་སྦྱོར་བའི་ཆོ་གའི་མཚན་ཉིད་ཀྱི་འཁྲུལ་འཁོར་འཁོར་ལོ་སྒོམ་པ་དང་གནོད་མཛེས་ཀྱི་སྔགས་ཀྱི་ལས་ཀྱི་ཚོགས་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བདུན་པ། སྟོབས་ཆེན་མའི་སྦྱོར་བས་སྲུང་བ་ཆེན་པོ་ཕུར་བུའི་སྔགས་ཀྱི་ལས་བྱང་ཆུབ་སེམས་དཔའི་འཁྲུལ་འཁོར་སྒོམ་པའི་མན་ངག་གི་ཆོ་གའི་མཚན་ཉིད་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བརྒྱད་པ། འཁོར་ལོས་སྒྱུར་མའི་རབ་ཏུ་སྦྱོར་བ་ལ་སོགས་པ་ལས་སྣ་ཚོགས་བསྒྲུབ་པའི་འཁྲུལ་འཁོར་འཁོར་ལོ་སྒོམ་པའི་ལམ་དང་རྫ་རྔའི་སྔགས་མདོར་བསྟན་པའི་ཆོ་གའི་མཚན་ཉིད་ཅེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་དགུ་པ། བརྩོན་འགྲུས་ཆེན་མོའི་རབ་ཏུ་སྦྱོར་བའི་ཆོ་གའི་མཚན་ཉིད་གསང་བའི་བཅུད་ལེན་ལ་སོགས་པ་དང་རྒྱས་པའི་ལས་དཔལ་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཧེ་རུ་ཀའི་རྩ་བའི་སྔགས་ཀྱི་ཆོ་ག་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:2,t:"ལྔ་བཅུ་པ། དེ་ཁོ་ན་ཉིད་ཉི་ཤུ་རྩ་ལྔའི་བདག་ཉིད་རྒྱུད་ཐམས་ཅད་ཀྱི་དོན་སྟོན་པ་པོ་གསང་ཆེན་ཐམས་ཅད་པ་ཞེས་བྱ་བའི་ལེའུ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་དང་པོ། ཐོད་པའི་དུམ་བུ་ཅན་གྱི་རྣལ་འབྱོར་གྱི་མཚན་ཉིད་ཀྱི་སྒྲུབ་པའི་ཐབས་དང་དཀྱིལ་འཁོར་གྱི་འཁོར་ལོའི་སྒྲུབ་ཐབས་ཀྱི་མིང་ཅན་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་གཉིས་པ། བོང་བུའི་རྣལ་འབྱོར་ལ་ཀེང་རུས་ཆེན་པོ་སྒོམ་པ་པོའི་མན་ངག་དེ་ཁོ་ན་ཉིད་དང་ལྡན་པ་བསྟན་པ།"}
,{d:3,t:"གསུམ་པ། ཀེང་རུས་ཀྱི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་བཞི་པ། མཆེ་བ་རྣམ་པར་གཙིགས་པའི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་ལྔ་པ། ལྷ་དགྲ་ཡི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་དྲུག་པ། འོད་དཔག་མེད་ཀྱི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་བདུན་པ། རྡོ་རྗེ་འོད་ཀྱི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་བརྒྱད་པ། རྡོ་རྗེ་སྐུའི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་དགུ་པ། རྡོ་རྗེ་མྱུ་གུ་ཅན་གྱི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་བཅུ་པ། རྡོ་རྗེ་རལ་པ་ཅན་གྱི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་བཅུ་གཅིག་པ། དཔའ་བོ་ཆེན་པོའི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་བཅུ་གཉིས་པ། རྡོ་རྗེ་ཧཱུཾ་མཛད་ཀྱི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་བཅུ་གསུམ་པ། ཤིན་ཏུ་བཟང་པོའི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་བཅུ་བཞི་པ། རྡོ་རྗེ་བཟང་པོའི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་བཅོ་ལྔ་པ། འཇིགས་བྱེད་ཆེན་པོའི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་བཅུ་དྲུག་པ། མིག་མི་བཟང་གི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་བཅུ་བདུན་པ། སྟོབས་པོ་ཆེའི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་བཅྭ་བརྒྱད་པ། རིན་ཆེན་རྡོ་རྗེའི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་བཅུ་དགུ་པ། རྟ་མགྲིན་གྱི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་ཉི་ཤུ་པ། ནམ་མཁའི་སྙིང་པོའི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"ཉི་ཤུ་རྩ་གཅིག་པ། དཔལ་ཧེ་རུ་ཀའི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་ཉི་ཤུ་རྩ་གཉིས་པ། པདྨ་གར་དབང་གི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་ཉི་ཤུ་རྩ་གསུམ་པ། རྣམ་པར་སྣང་མཛད་ཀྱི་ཆོ་ག་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་སྟེ་ཉི་ཤུ་རྩ་བཞི་པ། གནས་ཐམས་ཅད་ཀྱི་བདག་ཉིད་ཅན་བསྟན་པ།"}
,{d:3,t:"རབ་ཏུ་བྱེད་པ་སྟེ་ཉི་ཤུ་རྩ་ལྔ་པ།"}
,{d:2,t:"ལྔ་བཅུ་རྩ་གཅིག་པ། བསྟོད་པ་དང་མཆོད་པ་བཞི་ལ་སོགས་པ་གཉིས་སུ་མེད་པའི་དམ་ཚིག་བསྟན་པའི་ལེའུ།"}
,{d:1,t:"དཔལ་བདེ་མཆོག་འབྱུང་བ་ཞེས་བྱ་བའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཆེན་པོ།"}
,{d:2,t:"དང་པོ། ཞུས་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། སྐྱེད་པའི་རིམ་པ་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"གསུམ་པ། རྫོགས་པའི་རིམ་པ་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཞི་པ། འབྱུང་བ་བཞི་དང་རྣམ་པ་ལྔ་དང་། ཡུལ་དྲུག་ལྷའི་རྣམ་པར་དག་པ་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ལྔ་པ། ཟླ་བ་དང་ཉི་མའི་མན་ངག་གི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"དྲུག་པ། ལམ་ལྔ་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བདུན་པ། རྩའི་འཁོར་ལོའི་ཐབས་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བརྒྱད་པ། དམ་ཚིག་གི་བརྡའི་ཆོ་ག་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"དགུ་པ། བརྡ་དང་གནས་ལ་སོགས་པའི་བརྡས་ས་རྣམས་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་པ། ལས་རབ་འབྱམ་འབྱུང་བ་ཞེས་བྱ་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་གཅིག་པ། སྔགས་ཀྱི་བཟླས་པའི་ངེས་པ་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་གཉིས་པ། སྔགས་ཀྱི་བཟླས་པའི་བགྲང་ཕྲེང་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་གསུམ་པ། དཔལ་ཧེ་རུ་ཀའི་བསྐྱེད་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་བཞི་པ། མཆོད་པའི་ཆོ་ག་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅོ་ལྔ་པ། སྣོད་ཀྱི་མཚན་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་དྲུག་པ། བདུད་རྩི་ལྔ་སྒྲུབ་པ་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་བདུན་པ། དཀྱིལ་འཁོར་གྱི་ཐིག་གདབ་པའི་མཚན་ཉིད་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། དབང་བསྐུར་བའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"བཅུ་དགུ་པ། འཆི་བའི་ལྟས་ལྟ་བ་དང་འཕོ་བའི་རྣལ་འབྱོར་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་པ། དུས་བཞི་པོ་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཤུ་རྩ་གཅིག་པ། སྤྱོད་པ་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། ལྷ་རྣམས་རབ་ཏུ་གནས་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། སྦྱིན་སྲེག་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། ལས་རབ་འབྱམ་གྱི་སྨན་གྱི་རབ་ཏུ་སྦྱོར་བ་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། བཅུད་ཀྱིས་ལེན་གྱི་ཆོ་ག་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། མྱོས་བྱེད་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། སྔགས་བཏུ་བའི་ཆོ་ག་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བརྒྱད་པ། སྦྱིན་སྲེག་གི་ཆོ་ག་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"སུམ་ཅུ་པ། རི་མོ་ལ་སོགས་པའི་སྐུའི་མཚན་ཉིད་ངེས་པར་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"སོ་གཅིག་པ། རྣལ་འབྱོར་མ་བཞི་དང་། །འཁོར་ལོ་བཞི་ཡི་རིམ་པ་དང་། །བྱང་ཆུབ་ཀྱི་སེམས་འཕོ་བ་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"སོ་གཉིས་པ། གཏོར་མའི་མཆོད་པ་བསྟན་པའི་རིམ་པར་ཕྱེ་བ།"}
,{d:2,t:"རིམ་པར་ཕྱེ་བ་སོ་གསུམ་པ།"}
,{d:1,t:"དཔལ་ཁྲག་འཐུང་མངོན་པར་འབྱུང་བ་ཞེས་བྱ་བ།"}
,{d:2,t:"དང་པོ། འཇུག་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། སྔགས་དགོད་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། ཡི་གེ་བཅུ་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། སྙིང་པོའི་སྔགས་བཏུ་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། སྔགས་བཏུ་བའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། སྔགས་བཏུ་བའི་ལེའུ།"}
,{d:2,t:"བདུན་པ། ཁ་ཟས་གཉིས་སུ་མེད་པར་བསྒྲུབ་པ་ངེས་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། དཔལ་རྡོ་རྗེ་ཕག་མོའི་རྩ་བའི་སྔགས་སུ་གསུངས་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། རྡོ་རྗེ་ཕག་མོའི་རྩ་བའི་སྔགས་ཀྱིས་ཐམས་ཅད་དག་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་པ། དཔལ་རྡོ་རྗེ་ཕག་མོའི་རྩ་བའི་སྔགས་ཀྱི་སྦྱིན་སྲེག་གི་ཆོ་གའི་ལས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། དཔལ་རྡོ་རྗེ་ཕག་མོའི་རྩ་བའི་སྔགས་ཀྱི་རྣལ་འབྱོར་གྱི་འདོད་པ་དང་། བཅུད་ཀྱིས་ལེན་དང་འགུགས་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། ཕྱག་རྒྱ་ཆེན་པོ་བསྒྲུབ་པའི་ཐབས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། སྐྱེ་བ་བདུན་པ་ལ་སོགས་པ་ཐམས་ཅད་དགུག་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། ལྷ་དགོད་པ་དང་དབང་བསྐུར་བ་དང་། བླ་མ་མཆོད་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། ཚོགས་ཀྱི་དཀྱིལ་འཁོར་ལ་མཆོད་པ་དང་དབང་བསྐུར་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། གཡོན་པའི་མཆོད་པ་དང་སྡོམ་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། གཟུགས་བཟང་མ་བལྟ་བ་དང་གི་ཝང་དང་གཞན་གྱི་སྡེ་རེངས་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། རོ་ལངས་ཆེན་པོ་བསྒྲུབ་པའི་ཐབས་ལྷ་ཐམས་ཅད་དང་རྩེ་ཞིང་བདེ་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། བཟླས་པའི་མཚན་ཉིད་དང་། མཆོད་པ་དང་རྩེ་བའི་རྩེད་མོའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། གླིང་བདུན་གྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་སྦྱིན་སྲེག་གི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། ཕྲིན་ལས་བཞིའི་སྦྱིན་སྲེག་གི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཉིས་པ། རོ་ལངས་ཆེན་པོའི་སྒྲུབ་ཐབས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། དཔལ་རྡོ་རྗེ་ཕག་མོའི་རྩ་བའི་སྔགས་ཀྱིས་དགུག་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། རྡོ་རྗེ་ཕག་མོའི་གོ་བཟློག་པའི་སྙིང་པོའི་དགུག་པ་དང་བསྐྲད་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། གསང་བའི་བརྡའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དྲུག་པ། ལག་པའི་བརྡ་དང་རྣལ་འབྱོར་མའི་མཚན་མ་དང་། ཕྱག་རྒྱའི་མཚན་མའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བདུན་པ། ནང་གི་བསམ་གཏན་དང་བཟླས་པ་རྣམ་པར་དག་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བརྒྱད་པ། སྦས་པའི་སྔགས་དང་དམ་ཚིག་སྲུང་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་དགུ་པ། དཔལ་རྡོ་རྗེ་ཕག་མོའི་སྙིང་པོའི་སྔགས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་པ། རྣལ་འབྱོར་མ་རྣམས་ཀྱི་ཚེ་འཕེལ་བ་དང་། མཆོད་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཅིག་པ། རྡོ་རྗེ་ཕག་མོའི་ཡི་གེ་དྲུག་གི་སྔགས་ཀྱི་ལས་ཐམས་ཅད་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གཉིས་པ། དེ་ཉིད་སྔགས་ཀྱིས་གཟུགས་ཐམས་ཅད་ཡོངས་སུ་བརྗེ་བ་དང་། དབང་དུ་བྱེད་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་གསུམ་པ། ལས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བཞི་པ།  དཔལ་རྡོ་རྗེ་ཕག་མོའི་ཉེ་བའི་སྙིང་པོའི་སྔགས་བཏུ་བའི་ལས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་ལྔ་པ། ཕྱག་རྒྱ་ཆེན་པོ་སྒྲུབ་པའི་ཀླུའི་ལས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དྲུག་པ། གདུག་པ་ཐམས་ཅད་ཀྱི་བསམ་གཏན་གྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བདུན་པ། ཆར་དབབ་པ་དང་། གཟའ་རྒྱུ་བ་དང་། འཇིག་རྟེན་སྐྱོང་བ་བརྒྱད་ཀྱི་སྒྲུབ་ཐབས་ཀྱི་ཆོ་གའི་ལེའ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་བརྒྱད་པ། བསྐྲད་པ་དང་གསད་པའི་སྔགས་ཀྱི་ལས་ཀྱི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"སུམ་ཅུ་རྩ་དགུ་པ། འཁོར་ལོ་སྒྱུར་བ་དྲུག་གི་བསམ་གཏན་དང་སྔགས་བཏུ་བའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་པ། དཔའ་བོ་དྲུག་གི་གོ་ཆ་དང་། ལྷའི་གྲངས་དང་ལག་པའི་མཆོད་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གཅིག་པ། དུས་བཞིའི་མཐའི་རྣལ་འབྱོར་མ་དང་ལག་པའི་བརྡའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གཉིས་པ། སྐྱེ་བ་བདུན་པའི་བསྒྲུབ་བྱ་དང་། ཧཱུཾ་ཡིག་བཞི་རྣམ་པར་དག་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་གསུམ་པ། ཀུན་གྱི་རྣམ་པའི་སྒྱུ་མ་ལྟར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་བཞི་པ། ཐམས་ཅད་སོ་སོར་གསལ་བའི་མངོན་པར་ཤེས་པ་བརྒྱད་ངེས་པར་བསྟན་པའི་ཆོ་གའི་ལེའུ།"}
,{d:2,t:"བཞི་བཅུ་རྩ་ལྔ་པ།"}
,{d:1,t:"ཕག་མོ་མངོན་པར་བརྗོད་པ་བཤད་པའི་རྒྱུད་ཕྱི་མ་ལས། ཕག་མོ་མངོན་པར་བྱང་ཆུབ་པ་ཞེས་བྱ་བ།"}
,{d:1,t:"རྣལ་འབྱོར་མའི་ཀུན་ཏུ་སྤྱོད་པ།"}
,{d:2,t:"དང་པོ། ལྷ་རྣམས་ཀྱི་གནས་ཀྱི་རྣམ་པར་དག་པ་གནས་པ་བསྟན་པ།"}
,{d:2,t:"གཉིས་པ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་བསྟན་པ།"}
,{d:2,t:"གསུམ་པ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལྷ་རྣམས་ཀྱི་རྣམ་པར་དག་པ་བསྟན་པ།"}
,{d:2,t:"བཞི་པ། དཔའ་བོའི་རྣམ་པར་དག་པ་བསྟན་པ།"}
,{d:2,t:"ལྔ་པ། ལྷའི་གནས་ཀྱི་ས་བསྟན་པ།"}
,{d:2,t:"དྲུག་པ། རང་གི་མཚན་མ་དང་། ཞལ་དང་ཕྱག་རྒྱ་དང་། སྐུ་མདོག་དང་མཚོན་ཆ་བསྟན་པ།"}
,{d:2,t:"བདུན་པ། གོ་ཆ་གཉིས་བསྟན་པ།"}
,{d:2,t:"བརྒྱད་པ། ཡེ་ཤེས་ཀྱི་འཁོར་ལོ་སྤྱན་དྲང་བ་དང་བསྡུ་བ་བསྟན་པ།"}
,{d:2,t:"དགུ་པ། འཇུག་པ་བསྟན་པ།"}
,{d:2,t:"བཅུ་པ། གཏོར་མ་དང་། མཆོད་པ་ཚེས་བཅུར་བྱ་བ་སྲུང་བ་བསྟན་པ།"}
,{d:2,t:"བཅུ་གཅིག་པ། ཐམས་ཅད་རྣམ་པར་དག་པ་བསྟན་པ།"}
,{d:2,t:"བཅུ་གཉིས་པ། རྒྱུད་ཐམས་ཅད་ལས་ངེས་པར་བྱས་པའི་དེ་ཁོ་ན་ཉིད་ཀྱི་གནས་གཅིག་པུ་བསྟན་པ།"}
,{d:2,t:"བཅུ་གསུམ་པ། ཨཱ་ལི་ཀཱ་ལི་དང་། ལས་ཐམས་ཅད་ཀྱི་ངེས་པ་གཉིས་སུ་མེད་པར་བསྟན་པ།"}
,{d:2,t:"བཅུ་བཞི་པ། དཔའ་བོ་བཞི་དང་ཡང་དག་པར་སྦྱོར་བའི་ལག་པའི་མཆོད་པ་བསྟན་པ།"}
,{d:2,t:"བཅོ་ལྔ་པ། གཉིས་སུ་མེད་པའི་བརྟུལ་ཞུགས་དང་གསང་སྔགས་བསྟན་པ།"}
,{d:2,t:"བཅུ་དྲུག་པ། དངོས་གྲུབ་ཀྱི་ངེས་པ་དང་དཔལ་ཧེ་རུ་ཀའི་མཛད་པ་བསྟན་པ།"}
,{d:2,t:"བཅུ་བདུན་པ། དེ་ཁོ་ན་ཉིད་དག་པ་ལ་སོགས་པ་བསྟན་པ།"}
,{d:1,t:"རྣལ་འབྱོར་མ་བཞིའི་ཁ་སྦྱོར་གྱི་རྒྱུད་ཅེས་བྱ་བ།"}
,{d:2,t:"དང་པོ། ཚོགས་ཀྱིས་བསྒྱིངས་པའི་རྒྱུད་ཆེན་པོ་ཞེས་བྱ་བའི་བརྟག་པ།"}
,{d:2,t:"གཉིས་པ། དཀྱིལ་འཁོར་གྱི་བརྟག་པ།"}
,{d:2,t:"གསུམ་པ། དམ་ཚིག་ཆེན་པོའི་བདུད་རྩི་ལྔ་ཞེས་བྱ་བའི་བརྟག་པ།"}
,{d:2,t:"བཞི་པ། དེ་ཁོ་ན་ཉིད་ཀྱི་མན་ངག་སྦྱོར་བ་བཞིའི་ཆ་ཞེས་བྱ་བའི་བརྟག་པ།"}
,{d:2,t:"ལྔ་པ། སྦྱིན་སྲེག་རབ་གནས་ཀྱི་བརྟག་པ།"}
,{d:2,t:"དྲུག་པ། དེ་ཁོ་ན་ཉིད་གཏན་ལ་དབབ་པ་ཞེས་བྱ་བའི་བརྟག་པ།"}
,{d:2,t:"བདུན་པ"}
,{d:1,t:"རིག་པ་འཛིན་པ་རྡོ་རྗེ་རྣལ་འབྱོར་མའི་སྒྲུབ་ཐབས་ཞེས་བྱ་བ།"}
,{d:1,t:"ཡང་དག་པར་སྦྱོར་བ་ཞེས་བྱ་བའི་རྒྱུད་ཆེན་པོ།"}
,{d:2,t:"རྕ་རྒྱུད་བསྟན་པ།"}
,{d:3,t:"བརྟག་པའི་རྒྱལ་པོ་དང་པོ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་དང་པོ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གཉིས་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གསུམ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་བཞི་པ།"}
,{d:3,t:"བརྟག་པའི་རྒྱལ་པོ་གཉིས་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་དང་པོ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གཉིས་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གསུམ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་བཞི་པ།"}
,{d:3,t:"བརྟག་པའི་རྒྱལ་པོ་གསུམ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་དང་པོ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གཉིས་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གསུམ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་བཞི་པ།"}
,{d:3,t:"བརྟག་པའི་རྒྱལ་པོ་བཞི་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་དང་པོ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གཉིས་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གསུམ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་བཞི་པ།"}
,{d:3,t:"བརྟག་པའི་རྒྱལ་པོ་ལྔ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་དང་པོ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གཉིས་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གསུམ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་བཞི་པ།"}
,{d:3,t:"བརྟག་པའི་རྒྱལ་པོ་དྲུག་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་དང་པོ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གཉིས་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གསུམ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་བཞི་པ།"}
,{d:3,t:"བརྟག་པའི་རྒྱལ་པོ་བདུན་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་དང་པོ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གཉིས་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གསུམ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་བཞི་པ།"}
,{d:3,t:"བརྟག་པའི་རྒྱལ་པོ་བརྒྱད་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་དང་པོ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གཉིས་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གསུམ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་བཞི་པ།"}
,{d:3,t:"བརྟག་པའི་རྒྱལ་པོ་དགུ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་དང་པོ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གཉིས་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གསུམ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་བཞི་པ།"}
,{d:3,t:"བརྟག་པའི་རྒྱལ་པོ་བཅུ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་དང་པོ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གཉིས་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་གསུམ་པ།"}
,{d:4,t:"རབ་ཏུ་བྱེད་པ་བཞི་པ།"}
,{d:1,t:"དཔལ་གསང་བ་རྡོ་རྗེ་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:2,t:"དང་པོ། གླེང་བསླང་བའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། རྟོག་པ་སེལ་བའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། གསང་བ་རྟོག་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། རྒྱུ་དང་འབྲས་བུའི་དེ་ཁོ་ན་བསྟན་པའི་ལེའུ།"}
,{d:1,t:"དཔལ་གསང་བ་ཐམས་ཅད་གཅོད་པའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་འཁོར་ལོ་སྡོམ་པ་གསང་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་ནམ་མཁའ་དང་མཉམ་པའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ།"}
,{d:1,t:"དཔལ་ནམ་མཁའ་ཆེན་པོའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་སྐུ་གསུང་ཐུགས་ཀྱི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་རིན་ཆེན་ཕྲེང་བའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་དམ་ཚིག་ཆེན་པོའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ།"}
,{d:1,t:"དཔལ་སྟོབས་པོ་ཆེའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ།"}
,{d:2,t:"དང་པོ། མངོན་པར་རྟོགས་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། མཚན་མ་ཐམས་ཅད་བརྟག་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། བསྲུང་བའི་འཁོར་ལོའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། ཡེ་ཤེས་བརྟག་པའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། ཡེ་ཤེས་ཆེན་པོ་བརྟག་པའི་ལེའུ།"}
,{d:1,t:"དཔལ་ཡེ་ཤེས་གསང་བའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་ཡེ་ཤེས་ཕྲེང་བའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་ཡེ་ཤེས་འབར་བའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་ཟླ་བའི་ཕྲེང་བའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་རིན་ཆེན་འབར་བའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ།"}
,{d:1,t:"དཔལ་ཉི་མའི་འཁོར་ལོའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ།"}
,{d:1,t:"དཔལ་ཡེ་ཤེས་རྒྱལ་པོའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་རྡོ་རྗེ་མཁའ་འགྲོ་གསང་བའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་གསང་བ་མེ་འབར་བའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་གསང་བ་བདུད་རྩིའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་དུར་ཁྲོད་རྒྱན་གྱི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་རྡོ་རྗེ་རྒྱལ་པོ་ཆེན་པོའི་རྒྱུད།"}
,{d:1,t:"དཔལ་ཡེ་ཤེས་བསམ་པའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་ཆགས་པའི་རྒྱལ་པོའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་མཁའ་འགྲོ་མའི་སྡོམ་པའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ།"}
,{d:1,t:"དཔལ་མཁའ་འགྲོ་མ་གསང་བ་འབར་བའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་རྡོ་རྗེ་འཇིགས་བྱེད་རྣམ་པར་འཇོམས་པའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་མེའི་ཕྲེང་བའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་རྡོ་རྗེ་གྲུབ་པ་དྲ་བའི་སྡོམ་པའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:2,t:"ལེའུ་དང་པོ། མཚན་གྱི་རྒྱུད་བསྟན་པ།"}
,{d:2,t:"ལེའུ་གཉིས་པ། ཡེ་ཤེས་རྒྱུ་དང་གནས་ལ་སོགས་པ།"}
,{d:2,t:"ལེའུ་གསུམ་པ། འཁོར་ལོ་བཞི་བསྟན་པ།"}
,{d:1,t:"དཔལ་སྟོབས་ཆེན་ཡེ་ཤེས་རྒྱལ་པོའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:1,t:"དཔལ་འཁོར་ལོ་སྡོམ་པའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་དུར་ཁྲོད་ཀྱི་རྒྱན་རྨད་དུ་བྱུང་བ་ཞེས་བྱ་བ།"}
,{d:1,t:"རྒྱུད་ཀྱི་རྒྱལ་པོ་རྙོག་པ་མེད་པ་ཞེས་བྱ་བ།"}
,{d:1,t:"དཔལ་བདེ་མཆོག་ནམ་མཁའ་དང་མཉམ་པའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ།"}
,{d:2,t:"ལེའུ་དང་པོ། བསྐྱེད་པའི་རིམ་པའི་དུམ་བུ།"}
,{d:2,t:"ལེའུ་གཉིས་པ། རྫོགས་པའི་རིམ་པའི་དུམ་བུ།"}
,{d:2,t:"ལེའུ་གསུམ་པ། ལས་སྣ་ཚོགས་ཀྱི་དུམ་བུ།"}
,{d:1,t:"མཁའ་འགྲོ་མ་ཐམས་ཅད་ཀྱི་ཐུགས་གཉིས་སུ་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡེ་ཤེས་རྡོ་རྗེ་ཕག་མོ་མངོན་པར་འབྱུང་བའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ།"}
,{d:1,t:"མཁའ་འགྲོ་མ་ཐམས་ཅད་ཀྱི་ཐུགས་གཉིས་སུ་མེད་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པ་ཕག་མོ་མངོན་པར་འབྱུང་བའི་རྒྱུད་ལས་རྒྱུད་ཕྱི་མ་བསྐྱིད་རིམ་བསྟན་པའི་ལའུ།"}
,{d:1,t:"དཔལ་རྡོ་རྗེ་ནག་པོ་ཆེན་པོ་ཁྲོས་པའི་མགོན་པོ་གསང་བ་དངོས་གྲུབ་འབྱུང་བ་ཞེས་བྱ་བའི་རྒྱུད།"}
,{d:2,t:"དང་པོ། གསང་བ་མངོན་པར་བྱང་ཆུབ་པའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། གསང་བ་སྤྱི་ལ་དགོངས་པའི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། གསང་བའི་རིམ་པའི་ལེའུ།"}
,{d:2,t:"བཞི་པ། གསང་བ་མངོན་པར་འབྱུང་བའི་ལེའུ།"}
,{d:2,t:"ལྔ་པ། གསང་བ་ལྷའི་གནས་མངོན་པར་འབྱུང་བའི་ལེའུ།"}
,{d:2,t:"དྲུག་པ། གསང་བ་སྔགས་ཀྱི་ལེའུ།"}
,{d:2,t:"བདུན་པ། གསང་སྔགས་རིམ་པར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བརྒྱད་པ། གསང་སྔགས་དང་འཁོར་ལོ་བསྒྲུབ་པའི་ལེའུ།"}
,{d:2,t:"དགུ་པ། དྲག་པོའི་མངོན་སྤྱོད་བསྟན་པའི་ལེའོུ།"}
,{d:2,t:"བཅུ་པ། དྲག་པོའི་སྦྱིན་སྲེག་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཅིག་པ། དུར་ཁྲོད་ཀྱི་བདག་པོ་རྣམས་དང་། ཕོ་ཉ་བ་ཁྱད་པར་བ་རྣམས་དང་མ་མོ་དང་ཞིང་སྐྱོང་གི་ཕྲིན་ལས་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གཉིས་པ། ཕྱི་དང་ནང་གི་དངོས་པོ་ཕོ་ཉ་མའི་ལས་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་གསུམ་པ། ལྷ་མོའི་འཁོར་ལོ་དང་ལས་བསྒྲུབ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བཞི་པ། དཀྱིལ་འཁོར་བའི་མགོན་པོ་དང་ཡུམ་དང་བཅས་པའི་གསང་སྔགས་དང་ཕྲིན་ལས་ཀྱི་ལེའུ།"}
,{d:2,t:"བཅོ་ལྔ་པ། ཕྱི་ནང་གསང་བ་དང་སྐུ་གསུང་ཐུགས་ཀྱི་རྟེན་གཟུགས་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དྲུག་པ། གཙོ་བོ་དང་འཁོར་དུ་བཅས་པ་མཆོད་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་བདུན་པ། གསང་བ་ཆེན་པོའི་དཀྱིལ་འཁོར་གསལ་བར་བྱེད་པའི་ལེའུ།"}
,{d:2,t:"བཅོ་བརྒྱད་པ། དབང་བསྐུར་ཞིང་བྱིན་གྱིས་བརླབས་པའི་ལེའུ།"}
,{d:2,t:"བཅུ་དགུ་པ། ཁྱད་པར་དུ་འཕགས་པ་རྣམ་ཐོས་སྲས་གནོད་སྦྱིན་ཆེན་པོ་བརྒྱད་དང་བཅས་པ་བསྒྲུབ་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་པ། རྒྱལ་པོ་རྣམ་ཐོས་སྲས་ལ་ཀླུ་ཆེན་པོ་བརྒྱད་ཀྱིས་བསྐོར་བའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གཅིག་པ། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་སྲས་འཁོར་དང་བཅས་པ་བསྒྲུབ་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ གཉིས་པ། ལས་ཉེ་བར་བསྒྲུབ་པར་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་གསུམ་པ། སྣ་ཚོགས་པའི་ལས་ཀྱི་རབ་ཏུ་བྱེད་པ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་བཞི་པ། གསུམ་དུ་སྒྲུབ་པའི་དབང་ཕྱུག་ཏུ་བསྟན་པའི་ལེའུ།"}
,{d:2,t:"ཉི་ཤུ་རྩ་ལྔ་པ། གསང་བ་གྲུབ་པ་དང་གཏོར་མའི་ལེའུ།"}
,{d:1,t:"དཔལ་སངས་རྒྱས་ཐོད་པ་ཞེས་བྱ་བ་རྣལ་འབྱོར་མའི་རྒྱུད་ཀྱི་རྒྱལ་པོ།"}
,{d:2,t:"དང་པོ། དངོས་གྲུབ་ཐམས་ཅད་དང་ཡེ་ཤེས་གཏན་ལ་དབབ་པ་དང་། ཐོད་པ་ཁ་ཕྱེ་བ་ལས་གླེགས་བམ་བྱུང་བའི་ལེའུ།"}
,{d:2,t:"གཉིས་པ། ཐལ་བའི་སྦྱོར་བ་དང་ལས་སྣ་ཚོགས་གཏན་ལ་དབབ་པ་དང་། སྔགས་ཀྱི་ལེའུ།"}
,{d:2,t:"གསུམ་པ། ལྷ་བསྐྱེད་པ་དང་། དབང་བསྐུར་བའི་ལེའུ།"}
]
},{}],"D:\\ksana2015\\node_modules\\ksana2015-treetoc\\addnode.js":[function(require,module,exports){
var React=require("react");
var E=React.createElement;
var linecount=function(t) {
	var lcount=0;
	t.replace(/\n/g,function(){
		lcount++;
	})
	return lcount+2;
}
var AddNode=React.createClass({
	propTypes:{
		action: React.PropTypes.func.isRequired
	}
	,addingkeydown:function(e) {
		var t=e.target.value;
		if (e.key=="Enter" && t.charCodeAt(t.length-1)==10) {
			this.props.action("addnode",t.trim().split("\n"),this.props.insertBefore);
		}
		var lc=linecount(t);
		e.target.rows=lc;
	}
	,componentDidMount:function() {
		this.refs.adding.getDOMNode().focus();
	}
	,render:function(){
		return E("div", {}, 
			E("textarea",
				{onKeyDown:this.addingkeydown,ref:"adding"
				 ,placeholder:"Enter twice to finish adding",defaultValue:""}
		));
	}

})

module.exports=AddNode;
},{"react":"react"}],"D:\\ksana2015\\node_modules\\ksana2015-treetoc\\controls.js":[function(require,module,exports){
var React=require("react");
var E=React.createElement;

var Controls=React.createClass({
	propTypes:{
		enabled:React.PropTypes.array.isRequired
		,action:React.PropTypes.func.isRequired
	}
	,getDefaultProps:function(){
		return {enabled:[]};
	}
	,enb:function(name) {
		return this.props.enabled.indexOf(name)===-1;		
	}
	,act:function(name) {
		var that=this;
		return function(e){
			that.props.action(name,e.ctrlKey);
		}
	}
	,render:function() {
		return E("span",{},
			E("button" ,{onClick:this.act("addingnode"),title:"Create a new node below, press Ctrl to above here."},"＋"),
			E("button"　,{style:{visibility:"hidden"}}," "),
			E("button" ,{onClick:this.act("levelup"),title:"level -1",disabled:this.enb("levelup")},"⇠"),
			E("button" ,{onClick:this.act("leveldown"),title:"level +1",disabled:this.enb("leveldown")},"⇢")
		);
	}
})

module.exports=Controls;
},{"react":"react"}],"D:\\ksana2015\\node_modules\\ksana2015-treetoc\\index.js":[function(require,module,exports){
/*
   toc data format
   array of { d:depth, o:opened, t:text, n:next_same_level ]

   only first level can be 0

   TODO, do not write directly to props.toc
*/
var React=require("react");
var TreeNode=require("./treenode");
var E=React.createElement;
var manipulate=require("./manipulate");

var buildToc = function(toc) {
	if (!toc || !toc.length || toc.built) return;
	var depths=[];
 	var prev=0;
 	if (toc.length>1) {
 		toc[0].o=true;//opened
 	}
 	for (var i=0;i<toc.length;i++) delete toc[i].n;
	for (var i=0;i<toc.length;i++) {
	    var depth=toc[i].d||toc[i].depth;
	    if (prev>depth) { //link to prev sibling
	      if (depths[depth]) toc[depths[depth]].n = i;
	      for (var j=depth;j<prev;j++) depths[j]=0;
	    }
    	depths[depth]=i;
    	prev=depth;
	}
	toc.built=true;
	return toc;
}
var genToc=function(toc,title) {
    var out=[{depth:0,text:title||ksana.js.title}];
    if (toc.texts) for (var i=0;i<toc.texts.length;i++) {
      out.push({t:toc.texts[i],d:toc.depths[i], vpos:toc.vpos[i]});
    }
    return out;
}

var TreeToc=React.createClass({
	propTypes:{
		toc:React.PropTypes.array.isRequired  //core toc dataset
		,opts:React.PropTypes.object    
		,onSelect:React.PropTypes.func  //user select a treenode
		,tocid:React.PropTypes.string  //toc view 
		,styles:React.PropTypes.object //custom styles
	}
	,getInitialState:function(){
		return {editcaption:-1,selected:[]};
	}
	,clearHits:function() {
		for (var i=0;i<this.props.toc;i++) {
			if (this.props.toc[i].hit) delete this.props.toc[i].hit;
		}
	}
	,componentDidMount:function() {
		buildToc(this.props.toc);
	}
	,componentWillReceiveProps:function(nextProps) {
		if (nextProps.toc && !nextProps.toc.built) {
			buildToc(nextProps.toc);
		}
		if (nextProps.hits!==this.props.hits) {
			this.clearHits();
		}
	}
	,getDefaultProps:function() {
		return {opts:{}};
	}
	,action:function() {
		var args=Array.prototype.slice.apply(arguments);
		var act=args.shift();
		var p1=args[0];
		var p2=args[1];
		var sels=this.state.selected;
		var toc=this.props.toc;
		var r=false;
		if (act==="updateall") {
			this.setState({editcaption:-1,deleting:-1});
		} else if (act==="editcaption") {
			var n=parseInt(p1);
			this.setState({editcaption:n,selected:[n]});
		} else if (act==="deleting") {
			this.setState({deleting:this.state.editcaption});
		} else if (act==="changecaption") {
			if (!this.state.editcaption===-1) return;
			if (!p1) {
				this.action("deleting");
			} else {
				this.props.toc[this.state.editcaption].t=p1;
				this.setState({editcaption:-1});
			}
		} else if (act==="select") {
			var selected=this.state.selected;
			if (!(this.props.opts.multiselect && p2)) {
				selected=[];
			}
			var n=parseInt(p1);
			if (n>0) selected.push(n);
			this.props.onSelect&&this.props.onSelect(this.props.tocid,this.props.toc[n],n,this.props.toc);
			this.setState({selected:selected,editcaption:-1,deleting:-1,adding:0});
		} else if (act==="addingnode") {
			var insertAt=sels[0];
			if (p1) {
				insertAt=-insertAt; //ctrl pressed insert before
			}
			this.setState({adding:insertAt,editcaption:-1});
		} else if (act=="addnode") {
			var n=this.state.selected[0];
			r=manipulate.addNode(toc,n,p1,p2)
		}else if (act==="levelup") r=manipulate.levelUp(sels,toc);
		else if (act==="leveldown") r=manipulate.levelDown(sels,toc);
		else if (act==="deletenode") r=manipulate.deleteNode(sels,toc);
		else if (act==="hitclick") {
			this.props.onHitClick&&this.props.onHitClick(this.props.tocid,this.props.toc[p1],p1,this.props.toc);
		}
		if (r) {
			buildToc(toc);
			this.setState({editcaption:-1,deleting:-1,adding:0});
			if (act==="deletenode") this.setState({selected:[]});
		}
	}
	,render:function() {
		return E("div",{},
			E(TreeNode,{toc:this.props.toc,
				editcaption:this.state.editcaption,
				deleting:this.state.deleting,
				selected:this.state.selected,
				styles:this.props.styles,
				adding:this.state.adding,
				action:this.action,opts:this.props.opts,cur:0,
				hits:this.props.hits}));
	}
})
module.exports={Component:TreeToc,genToc:genToc,buildToc:buildToc};

},{"./manipulate":"D:\\ksana2015\\node_modules\\ksana2015-treetoc\\manipulate.js","./treenode":"D:\\ksana2015\\node_modules\\ksana2015-treetoc\\treenode.js","react":"react"}],"D:\\ksana2015\\node_modules\\ksana2015-treetoc\\manipulate.js":[function(require,module,exports){
var descendantOf=function(n,toc) { /* returning all descendants */
	var d=toc[n].d;
	n++;
	while (n<toc.length) {
		if (toc[n].d<=d) return n;
		n++;
	}
	return toc.length-1;
}
var levelUp =function(sels,toc) { //move select node and descendants one level up
	if (!canLevelup(sels,toc))return;
	var n=sels[0];
	var cur=toc[n];
	var next=toc[n+1];
	var nextsib=cur.n||descendantOf(n,toc);
	if (next && next.d>cur.d) { //has child
		for (var i=n+1;i<nextsib;i++) {
			toc[i].d--;
		}
	}
	cur.d--;
	cur.o=true;//force open this node , so that sibling is visible
	return true;
}
var levelDown =function(sels,toc) {
	if (!canLeveldown(sels,toc))return; //move select node descendants one level down
	var n=sels[0];
	var cur=toc[n];
	var next=toc[n+1];

	//force open previous node as it becomes parent of this node
	var p=prevSibling(n,toc);
	if (p) toc[p].o=true;

	if (!cur.o) { //do no move descendants if opened
		if (next && next.d>cur.d) { //has child
			for (var i=n+1;i<cur.n;i++) {
				toc[i].d++;
			}
		}		
	}
	cur.d++;
	return true;
}

var addNode =function(toc,n,newnodes,insertbefore) {
	var d=toc[n].d;
	if (!insertbefore) {
		toc[n].o=true;
		n++;
	}
	var args=[n,0];

	for (var i=0;i<newnodes.length;i++) {
		args.push({d:d,t:newnodes[i]});
	}
	toc.splice.apply(toc,args);
	return true;
}
var deleteNode =function(sels,toc) {
	if (!canDeleteNode(sels,toc))return; //move select node descendants one level down
	var n=sels[0];
	var to=descendantOf(n,toc);
	toc.splice(n,to-n);
	return true;
}

var canDeleteNode=function(sels,toc) {
	if (sels.length==0) return false;
	var n=sels[0];
	return (sels.length==1 && toc[n].d>0 && toc.length>2);
}
var canLevelup=function(sels,toc) {
	if (sels.length==0) return false;
	var n=sels[0];
	return (sels.length==1 && toc[n].d>1);
}
var prevSibling=function(n,toc) {
	var p=n-1;
	var d=toc[n].d;
	while (p>0) {
		if (toc[p].d<d) return 0;
		if (toc[p].d==d) return p;
		p--;
	}
}
var canLeveldown=function(sels,toc) {
	if (sels.length==0) return false;
	var n=sels[0];
	return (sels.length==1 && prevSibling(n,toc));
}
var enabled=function(sels,toc) {
	var enabled=[];
	if (canLeveldown(sels,toc)) enabled.push("leveldown");
	if (canLevelup(sels,toc)) enabled.push("levelup");
	if (canDeleteNode(sels,toc)) enabled.push("deletenode");
	return enabled;
}
module.exports={enabled:enabled,levelUp:levelUp,levelDown:levelDown,
	addNode:addNode,deleteNode:deleteNode,descendantOf:descendantOf};
},{}],"D:\\ksana2015\\node_modules\\ksana2015-treetoc\\treenode.js":[function(require,module,exports){
var React=require("react/addons");
var E=React.createElement;
var update=React.addons.update;
var manipulate=require("./manipulate");
var Controls=require("./controls");
var AddNode=require("./addnode");
var treenodehits=require("./treenodehits");
var styles={
	selectedcaption:{cursor:"pointer",background:"highlight",borderRadius:"5px"}
	,caption:{cursor:"pointer"}
	,childnode:{left:"15px",position:"relative"}
	,rootnode:{position:"relative"}
	,folderbutton: {cursor:"pointer",borderRadius:"50%"}
	,closed:{cursor:"pointer",fontSize:"75%"}
	,opened:{cursor:"pointer",fontSize:"75%"}	
	,leaf:{fontSize:"75%"}	
	,hiddenleaf:{visibility:"hidden"}	
	,deletebutton:{background:"red",color:"yellow"}
	,nodelink:{fontSize:"65%",cursor:"pointer"}
	,hit:{color:"pink",fontSize:"65%",cursor:"pointer"}
};


var TreeNode=React.createClass({
	mixins:[React.addons.pureRenderMixin]
	,propTypes:{
		toc:React.PropTypes.array.isRequired
		,opts:React.PropTypes.object
		,action:React.PropTypes.func.isRequired 
		,selected:React.PropTypes.array         //selected treenode (multiple)
		,cur:React.PropTypes.number.isRequired //current active treenode
		,styles:React.PropTypes.object  //custom style
	}
	,getDefaultProps:function() {
		return {cur:0,opts:{},toc:[]};
	}
	,click:function(e) {
		var n=parseInt(e.target.parentElement.attributes['data-n'].value);
		this.props.toc[n].o=!this.props.toc[n].o;
		this.forceUpdate();
		e.preventDefault();
    e.stopPropagation();
	}
	,select:function(e){
		if (e.target.nodeName!=="SPAN") return;
		var datan=e.target.parentElement.attributes['data-n'];
		if (!datan) return;
		var n=parseInt(datan.value);
		var selected=this.props.selected.indexOf(n)>-1;
		if (selected && this.props.opts.editable) {
			this.props.action("editcaption",n);
		} else {
			this.props.action("select",n,e.ctrlKey);
		}
		e.preventDefault();
    e.stopPropagation();
	}
	,componentWillReceiveProps:function(nextProps) {
		if (nextProps.styles && nextProps.styles!==this.props.styles) {
			styles=update(styles,{$merge:nextProps.styles});
		}
	}
	,componentDidUpdate:function() {
		if (this.refs.editcaption) {
			var dom=this.refs.editcaption.getDOMNode();
			dom.focus();
			dom.selectionStart=dom.value.length;
		}
	}
	,oninput:function(e) {
		var size=e.target.value.length+2;;
		if (size<5) size=5;
		e.target.size=size;
	}

	,editingkeydown:function(e) {
		if (e.key=="Enter") {
			this.props.action("changecaption",e.target.value);	
			e.stopPropagation();
		} else this.oninput(e);
	}
	,deleteNodes:function() {
		this.props.action("deletenode");
	}
	,renderDeleteButton:function(n) {
		var childnode=null;
		var children=manipulate.descendantOf(n,this.props.toc);
		if (children>n+1) childnode=E("span",{}," "+(children-n)+" nodes");
		var out=E("button",{onClick:this.deleteNodes,style:styles.deletebutton},"Delete",childnode);
		return out;
	}
	,mouseenter:function(e) {
		e.target.style.background="highlight";
		e.target.style.oldcolor=e.target.style.color;
		e.target.style.color="HighlightText";
		var t=e.target.innerHTML;
		if (t==="＋"||t==="－") e.target.style.borderRadius="50%";
		else e.target.style.borderRadius="5px";
	}
	,mouseleave:function(e) {
		e.target.style.background="none";
		e.target.style.color=e.target.style.oldcolor;
	}
	,renderFolderButton:function(n) {
		var next=this.props.toc[n+1];
		var cur=this.props.toc[n];
		var folderbutton=null;
		var props={style:styles.closed, onClick:this.click, onMouseEnter:this.mouseenter,onMouseLeave:this.mouseleave};
		if (cur.o) props.style=styles.opened;
		if (next && next.d>cur.d) { 
			if (cur.o) folderbutton=E("a",props,"－");//"▼"
			else       folderbutton=E("a",props,"＋");//"▷"
		} else {
			folderbutton=E("a",{ style:styles.hiddenleaf},"　");
		}
		return folderbutton;
	}
	,renderCaption:function(n) {
		var cur=this.props.toc[n];
		var stylename="caption";
		if (this.props.selected.indexOf(n)>-1) stylename="selectedcaption";
		var caption=null;
		if (this.props.deleting===n) {
			caption=this.renderDeleteButton(n);
		} else if (this.props.editcaption===n) {
			var size=cur.t.length+2;
			if (size<5) size=5;
			caption=E("input",{onKeyDown:this.editingkeydown,
				               size:size,ref:"editcaption",defaultValue:cur.t});
		} else {
			caption=E("span",{onMouseEnter:this.mouseenter,onMouseLeave:this.mouseleave,
				style:styles[stylename],title:n},cur.t);
		}
		return caption;
	}
	,renderAddingNode:function(n,above) {
		if (this.props.adding===n && n) { 
			return E(AddNode,{insertBefore:above,action:this.props.action});
		}
	}
	,renderEditControls:function(n) {
		if (!this.props.opts.editable) return;
		if (this.props.editcaption===n) {	
			var enabled=manipulate.enabled([n],this.props.toc);
			return E(Controls,{action:this.props.action,enabled:enabled});
		} 
	}
	,renderItem:function(e,idx){
		var t=this.props.toc[e];
		var props=update(this.props,{$merge:{key:"k"+idx,cur:e}});
		return E(TreeNode,props);
	}
	,clickhit:function(e) {
		var n=parseInt(e.target.dataset.n);
		this.props.action("hitclick",n);
		e.preventDefault();
		e.stopPropagation();
	}
	,renderHit:function(hit,n) {
		if (!hit) return;
		return E("span",{onClick:this.clickhit,style:styles.hit,"data-n":n,
			onMouseEnter:this.mouseenter,onMouseLeave:this.mouseleave},hit);
	}
	,render:function() {
		if (this.props.toc.length===0) return E("span",{},"");
		var n=this.props.cur;
		var cur=this.props.toc[n];
		var stylename="childnode",children=[];
		var selected=this.props.selected.indexOf(n)>-1;
		var depthdeco=renderDepth(cur.d,this.props.opts)
		if (cur.d==0) stylename="rootnode";
		var adding_before_controls=this.renderAddingNode(-n,true);
		var adding_after_controls=this.renderAddingNode(n);
		var editcontrols=this.renderEditControls(n);
		var folderbutton=this.renderFolderButton(n);
		if (cur.o) children=enumChildren(this.props.toc,n);

		var extracomponent=this.props.opts.onNode&& this.props.opts.onNode(cur,selected,n);
		caption=this.renderCaption(n);
		if (this.props.editcaption>-1 || this.props.deleting>-1) extracomponent=null;
		if (this.props.deleting>-1) editcontrols=null;
		var hits=treenodehits(this.props.toc,this.props.hits,n);

		return E("div",{onClick:this.select,"data-n":n,style:styles[stylename]},
			   adding_before_controls,
			   folderbutton,depthdeco,
			   editcontrols,
			   caption,
			   this.renderHit(hits,n),
			   extracomponent,
			   adding_after_controls,
			   children.map(this.renderItem));
	}
});

var ganzhi="　甲乙丙丁戊己庚辛壬癸子丑寅卯辰巳午未申酉戌亥";

var renderDepth=function(depth,opts) {
  var out=[];
  if (opts&&opts.tocstyle=="ganzhi") {
    return E("span", null, ganzhi[depth].trim()+" ");
  } else {
    if (opts&&opts.numberDepth && depth) return E("span", null, depth, ".")
    else return null;
  }
  return null;
};


var enumChildren=function(toc,cur) {
    var children=[];
    if (!toc || !toc.length || toc.length==1) return children;
    thisdepth=toc[cur].d||toc[cur].depth;
    if (cur==0) thisdepth=0;
    if (cur+1>=toc.length) return children;
    if ((toc[cur+1].d||toc[cur+1].depth)!= 1+thisdepth) {
    	return children;  // no children node
    }
    var n=cur+1;
    var child=toc[n];
    
    while (child) {
      children.push(n);
      var next=toc[n+1];
      if (!next) break;
      if ((next.d||next.depth)==(child.d||child.depth)) {
        n++;
      } else if ((next.d||next.depth)>(child.d||child.depth)) {
        n=child.n||child.next;
      } else break;
      if (n) child=toc[n];else break;
    }
    return children;
}
module.exports=TreeNode;
},{"./addnode":"D:\\ksana2015\\node_modules\\ksana2015-treetoc\\addnode.js","./controls":"D:\\ksana2015\\node_modules\\ksana2015-treetoc\\controls.js","./manipulate":"D:\\ksana2015\\node_modules\\ksana2015-treetoc\\manipulate.js","./treenodehits":"D:\\ksana2015\\node_modules\\ksana2015-treetoc\\treenodehits.js","react/addons":"react/addons"}],"D:\\ksana2015\\node_modules\\ksana2015-treetoc\\treenodehits.js":[function(require,module,exports){
var rangeOfTreeNode=function(toc,n) {
  //setting the ending vpos of a treenode
  //this value is fixed when hits is changed, but not saved in kdb
  if (typeof toc[n].end!=="undefined") return;

  if (n+1>=toc.length) {
    return;
  }
  var depth=toc[n].d , nextdepth=toc[n+1].d;
  if (n==toc.length-1 || n==0) {
      toc[n].end=Math.pow(2, 48);
      return;
  } else  if (nextdepth>depth){
    if (toc[n].n) {
      toc[n].end= toc[toc[n].n].vpos || Number.MAX_VALUE;  
    } else { //last sibling
      var next=n+1;
      while (next<toc.length && toc[next].d>depth) next++;
      if (next==toc.length) toc[n].end=Math.pow(2,48);
      else toc[n].end=toc[next].voff;
    }
  } else { //same level or end of sibling
    toc[n].end=toc[n+1].vpos;
  }
}
var calculateHit=function(toc,hits,n) {

  var start=toc[n].vpos;
  var end=toc[n].end;
  if (n==0) {
    return hits.length;
  } else {
    var hit=0;
    for (var i=0;i<hits.length;i++) {
      if (hits[i]>=start && hits[i]<end) hit++;
    }
    return hit;
  }
}

var treenodehits=function(toc,hits,n) {
  if (!hits || !hits.length) return 0;

  if (toc.length<2) return 0 ;

  //need to clear toc[n].hit when hits is changed.
  //see index.js clearHits()
  if (typeof toc[n].hit!=="undefined") return toc[n].hit;

  rangeOfTreeNode(toc,n);

  return toc[n].hit=calculateHit(toc,hits,n);
}

module.exports=treenodehits;
},{}],"D:\\ksana2015\\node_modules\\ksana2015-webruntime\\downloader.js":[function(require,module,exports){

var userCancel=false;
var files=[];
var totalDownloadByte=0;
var targetPath="";
var tempPath="";
var nfile=0;
var baseurl="";
var result="";
var downloading=false;
var startDownload=function(dbid,_baseurl,_files) { //return download id
	var fs     = require("fs");
	var path   = require("path");

	
	files=_files.split("\uffff");
	if (downloading) return false; //only one session
	userCancel=false;
	totalDownloadByte=0;
	nextFile();
	downloading=true;
	baseurl=_baseurl;
	if (baseurl[baseurl.length-1]!='/')baseurl+='/';
	targetPath=ksanagap.rootPath+dbid+'/';
	tempPath=ksanagap.rootPath+".tmp/";
	result="";
	return true;
}

var nextFile=function() {
	setTimeout(function(){
		if (nfile==files.length) {
			nfile++;
			endDownload();
		} else {
			downloadFile(nfile++);	
		}
	},100);
}

var downloadFile=function(nfile) {
	var url=baseurl+files[nfile];
	var tmpfilename=tempPath+files[nfile];
	var mkdirp = require("./mkdirp");
	var fs     = require("fs");
	var http   = require("http");

	mkdirp.sync(path.dirname(tmpfilename));
	var writeStream = fs.createWriteStream(tmpfilename);
	var datalength=0;
	var request = http.get(url, function(response) {
		response.on('data',function(chunk){
			writeStream.write(chunk);
			totalDownloadByte+=chunk.length;
			if (userCancel) {
				writeStream.end();
				setTimeout(function(){nextFile();},100);
			}
		});
		response.on("end",function() {
			writeStream.end();
			setTimeout(function(){nextFile();},100);
		});
	});
}

var cancelDownload=function() {
	userCancel=true;
	endDownload();
}
var verify=function() {
	return true;
}
var endDownload=function() {
	nfile=files.length+1;//stop
	result="cancelled";
	downloading=false;
	if (userCancel) return;
	var fs     = require("fs");
	var mkdirp = require("./mkdirp");

	for (var i=0;i<files.length;i++) {
		var targetfilename=targetPath+files[i];
		var tmpfilename   =tempPath+files[i];
		mkdirp.sync(path.dirname(targetfilename));
		fs.renameSync(tmpfilename,targetfilename);
	}
	if (verify()) {
		result="success";
	} else {
		result="error";
	}
}

var downloadedByte=function() {
	return totalDownloadByte;
}
var doneDownload=function() {
	if (nfile>files.length) return result;
	else return "";
}
var downloadingFile=function() {
	return nfile-1;
}

var downloader={startDownload:startDownload, downloadedByte:downloadedByte,
	downloadingFile:downloadingFile, cancelDownload:cancelDownload,doneDownload:doneDownload};
module.exports=downloader;
},{"./mkdirp":"D:\\ksana2015\\node_modules\\ksana2015-webruntime\\mkdirp.js","fs":false,"http":false,"path":false}],"D:\\ksana2015\\node_modules\\ksana2015-webruntime\\html5fs.js":[function(require,module,exports){
/* emulate filesystem on html5 browser */
var get_head=function(url,field,cb){
	var xhr = new XMLHttpRequest();
	xhr.open("HEAD", url, true);
	xhr.onreadystatechange = function() {
			if (this.readyState == this.DONE) {
				cb(xhr.getResponseHeader(field));
			} else {
				if (this.status!==200&&this.status!==206) {
					cb("");
				}
			}
	};
	xhr.send();
}
var get_date=function(url,cb) {
	get_head(url,"Last-Modified",function(value){
		cb(value);
	});
}
var get_size=function(url, cb) {
	get_head(url,"Content-Length",function(value){
		cb(parseInt(value));
	});
};
var checkUpdate=function(url,fn,cb) {
	if (!url) {
		cb(false);
		return;
	}
	get_date(url,function(d){
		API.fs.root.getFile(fn, {create: false, exclusive: false}, function(fileEntry) {
			fileEntry.getMetadata(function(metadata){
				var localDate=Date.parse(metadata.modificationTime);
				var urlDate=Date.parse(d);
				cb(urlDate>localDate);
			});
		},function(){
			cb(false);
		});
	});
}
var download=function(url,fn,cb,statuscb,context) {
	 var totalsize=0,batches=null,written=0;
	 var fileEntry=0, fileWriter=0;
	 var createBatches=function(size) {
		var bytes=1024*1024, out=[];
		var b=Math.floor(size / bytes);
		var last=size %bytes;
		for (var i=0;i<=b;i++) {
			out.push(i*bytes);
		}
		out.push(b*bytes+last);
		return out;
	 }
	 var finish=function() {
		 rm(fn,function(){
				fileEntry.moveTo(fileEntry.filesystem.root, fn,function(){
					setTimeout( cb.bind(context,false) , 0) ;
				},function(e){
					console.log("failed",e)
				});
		 },this);
	 };
		var tempfn="temp.kdb";
		var batch=function(b) {
		var abort=false;
		var xhr = new XMLHttpRequest();
		var requesturl=url+"?"+Math.random();
		xhr.open('get', requesturl, true);
		xhr.setRequestHeader('Range', 'bytes='+batches[b]+'-'+(batches[b+1]-1));
		xhr.responseType = 'blob';
		xhr.addEventListener('load', function() {
			var blob=this.response;
			fileEntry.createWriter(function(fileWriter) {
				fileWriter.seek(fileWriter.length);
				fileWriter.write(blob);
				written+=blob.size;
				fileWriter.onwriteend = function(e) {
					if (statuscb) {
						abort=statuscb.apply(context,[ fileWriter.length / totalsize,totalsize ]);
						if (abort) setTimeout( cb.bind(context,false) , 0) ;
				 	}
					b++;
					if (!abort) {
						if (b<batches.length-1) setTimeout(batch.bind(context,b),0);
						else                    finish();
				 	}
			 	};
			}, console.error);
		},false);
		xhr.send();
	}

	get_size(url,function(size){
		totalsize=size;
		if (!size) {
			if (cb) cb.apply(context,[false]);
		} else {//ready to download
			rm(tempfn,function(){
				 batches=createBatches(size);
				 if (statuscb) statuscb.apply(context,[ 0, totalsize ]);
				 API.fs.root.getFile(tempfn, {create: 1, exclusive: false}, function(_fileEntry) {
							fileEntry=_fileEntry;
						batch(0);
				 });
			},this);
		}
	});
}

var readFile=function(filename,cb,context) {
	API.fs.root.getFile(filename, {create: false, exclusive: false},function(fileEntry) {
		fileEntry.file(function(file){
			var reader = new FileReader();
			reader.onloadend = function(e) {
				if (cb) cb.call(cb,this.result);
			};
			reader.readAsText(file,"utf8");
		});
	}, console.error);
}

function createDir(rootDirEntry, folders,  cb) {
  // Throw out './' or '/' and move on to prevent something like '/foo/.//bar'.
  if (folders[0] == '.' || folders[0] == '') {
    folders = folders.slice(1);
  }
  rootDirEntry.getDirectory(folders[0], {create: true}, function(dirEntry) {
    // Recursively add the new subfolder (if we still have another to create).
    if (folders.length) {
      createDir(dirEntry, folders.slice(1),cb);
    } else {
			cb();
		}
  }, cb);
};


var writeFile=function(filename,buf,cb,context){
	var write=function(fileEntry){
		fileEntry.createWriter(function(fileWriter) {
			fileWriter.write(buf);
			fileWriter.onwriteend = function(e) {
				if (cb) cb.apply(cb,[buf.byteLength]);
			};
		}, console.error);
	}

	var getFile=function(filename){
		API.fs.root.getFile(filename, {exclusive:true}, function(fileEntry) {
			write(fileEntry);
		}, function(){
				API.fs.root.getFile(filename, {create:true,exclusive:true}, function(fileEntry) {
					write(fileEntry);
				});

		});
	}
	var slash=filename.lastIndexOf("/");
	if (slash>-1) {
		createDir(API.fs.root, filename.substr(0,slash).split("/"),function(){
			getFile(filename);
		});
	} else {
		getFile(filename);
	}
}

var readdir=function(cb,context) {
	var dirReader = API.fs.root.createReader();
	var out=[],that=this;
	dirReader.readEntries(function(entries) {
		if (entries.length) {
			for (var i = 0, entry; entry = entries[i]; ++i) {
				if (entry.isFile) {
					out.push([entry.name,entry.toURL ? entry.toURL() : entry.toURI()]);
				}
			}
		}
		API.files=out;
		if (cb) cb.apply(context,[out]);
	}, function(){
		if (cb) cb.apply(context,[null]);
	});
}
var getFileURL=function(filename) {
	if (!API.files ) return null;
	var file= API.files.filter(function(f){return f[0]==filename});
	if (file.length) return file[0][1];
}
var rm=function(filename,cb,context) {
	var url=getFileURL(filename);
	if (url) rmURL(url,cb,context);
	else if (cb) cb.apply(context,[false]);
}

var rmURL=function(filename,cb,context) {
	webkitResolveLocalFileSystemURL(filename, function(fileEntry) {
		fileEntry.remove(function() {
			if (cb) cb.apply(context,[true]);
		}, console.error);
	},  function(e){
		if (cb) cb.apply(context,[false]);//no such file
	});
}
function errorHandler(e) {
	console.error('Error: ' +e.name+ " "+e.message);
}
var initfs=function(grantedBytes,cb,context) {
	webkitRequestFileSystem(PERSISTENT, grantedBytes,  function(fs) {
		API.fs=fs;
		API.quota=grantedBytes;
		readdir(function(){
			API.initialized=true;
			cb.apply(context,[grantedBytes,fs]);
		},context);
	}, errorHandler);
}
var init=function(quota,cb,context) {
	navigator.webkitPersistentStorage.requestQuota(quota,
			function(grantedBytes) {
				initfs(grantedBytes,cb,context);
		}, errorHandler
	);
}
var queryQuota=function(cb,context) {
	var that=this;
	navigator.webkitPersistentStorage.queryUsageAndQuota(
	 function(usage,quota){
			initfs(quota,function(){
				cb.apply(context,[usage,quota]);
			},context);
	});
}
var API={
	init:init
	,readdir:readdir
	,checkUpdate:checkUpdate
	,rm:rm
	,rmURL:rmURL
	,getFileURL:getFileURL
	,writeFile:writeFile
	,readFile:readFile
	,download:download
	,get_head:get_head
	,get_date:get_date
	,get_size:get_size
	,getDownloadSize:get_size
	,queryQuota:queryQuota
}
module.exports=API;

},{}],"D:\\ksana2015\\node_modules\\ksana2015-webruntime\\ksanagap.js":[function(require,module,exports){
var appname="installer";
if (typeof ksana=="undefined") {
	window.ksana={platform:"chrome"};
	if (typeof process!=="undefined" && 
		process.versions && process.versions["node-webkit"]) {
		window.ksana.platform="node-webkit";
	}
}
var switchApp=function(path) {
	var fs=require("fs");
	path="../"+path;
	appname=path;
	document.location.href= path+"/index.html"; 
	process.chdir(path);
}
var downloader={};
var rootPath="";

var deleteApp=function(app) {
	console.error("not allow on PC, do it in File Explorer/ Finder");
}
var username=function() {
	return "";
}
var useremail=function() {
	return ""
}
var runtime_version=function() {
	return "1.4";
}

//copy from liveupdate
var jsonp=function(url,dbid,callback,context) {
  var script=document.getElementById("jsonp2");
  if (script) {
    script.parentNode.removeChild(script);
  }
  window.jsonp_handler=function(data) {
    if (typeof data=="object") {
      data.dbid=dbid;
      callback.apply(context,[data]);    
    }  
  }
  window.jsonp_error_handler=function() {
    console.error("url unreachable",url);
    callback.apply(context,[null]);
  }
  script=document.createElement('script');
  script.setAttribute('id', "jsonp2");
  script.setAttribute('onerror', "jsonp_error_handler()");
  url=url+'?'+(new Date().getTime());
  script.setAttribute('src', url);
  document.getElementsByTagName('head')[0].appendChild(script); 
}


var loadKsanajs=function(){

	if (typeof process!="undefined" && !process.browser) {
		var ksanajs=require("fs").readFileSync("./ksana.js","utf8").trim();
		downloader=require("./downloader");
		ksana.js=JSON.parse(ksanajs.substring(14,ksanajs.length-1));
		rootPath=process.cwd();
		rootPath=require("path").resolve(rootPath,"..").replace(/\\/g,"/")+'/';
		ksana.ready=true;
	} else{
		var url=window.location.origin+window.location.pathname.replace("index.html","")+"ksana.js";
		jsonp(url,appname,function(data){
			ksana.js=data;
			ksana.ready=true;
		});
	}
}

loadKsanajs();

var boot=function(appId,cb) {
	if (typeof appId=="function") {
		cb=appId;
		appId="unknownapp";
	}
	if (!ksana.js && ksana.platform=="node-webkit") {
		loadKsanajs();
	}
	ksana.appId=appId;
	var timer=setInterval(function(){
			if (ksana.ready){
				clearInterval(timer);
				cb();
			}
		});
}


var ksanagap={
	platform:"node-webkit",
	startDownload:downloader.startDownload,
	downloadedByte:downloader.downloadedByte,
	downloadingFile:downloader.downloadingFile,
	cancelDownload:downloader.cancelDownload,
	doneDownload:downloader.doneDownload,
	switchApp:switchApp,
	rootPath:rootPath,
	deleteApp: deleteApp,
	username:username, //not support on PC
	useremail:username,
	runtime_version:runtime_version,
	boot:boot
}
module.exports=ksanagap;
},{"./downloader":"D:\\ksana2015\\node_modules\\ksana2015-webruntime\\downloader.js","fs":false,"path":false}],"D:\\ksana2015\\node_modules\\ksana2015-webruntime\\livereload.js":[function(require,module,exports){
var started=false;
var timer=null;
var bundledate=null;
var get_date=require("./html5fs").get_date;
var checkIfBundleUpdated=function() {
	get_date("bundle.js",function(date){
		if (bundledate &&bundledate!=date){
			location.reload();
		}
		bundledate=date;
	});
}
var livereload=function() {
	if(window.location.origin.indexOf("//127.0.0.1")===-1) return;

	if (started) return;

	timer1=setInterval(function(){
		checkIfBundleUpdated();
	},2000);
	started=true;
}

module.exports=livereload;
},{"./html5fs":"D:\\ksana2015\\node_modules\\ksana2015-webruntime\\html5fs.js"}],"D:\\ksana2015\\node_modules\\ksana2015-webruntime\\mkdirp.js":[function(require,module,exports){
function mkdirP (p, mode, f, made) {
     var path = nodeRequire('path');
     var fs = nodeRequire('fs');
	
    if (typeof mode === 'function' || mode === undefined) {
        f = mode;
        mode = 0x1FF & (~process.umask());
    }
    if (!made) made = null;

    var cb = f || function () {};
    if (typeof mode === 'string') mode = parseInt(mode, 8);
    p = path.resolve(p);

    fs.mkdir(p, mode, function (er) {
        if (!er) {
            made = made || p;
            return cb(null, made);
        }
        switch (er.code) {
            case 'ENOENT':
                mkdirP(path.dirname(p), mode, function (er, made) {
                    if (er) cb(er, made);
                    else mkdirP(p, mode, cb, made);
                });
                break;

            // In the case of any other error, just see if there's a dir
            // there already.  If so, then hooray!  If not, then something
            // is borked.
            default:
                fs.stat(p, function (er2, stat) {
                    // if the stat fails, then that's super weird.
                    // let the original error be the failure reason.
                    if (er2 || !stat.isDirectory()) cb(er, made)
                    else cb(null, made);
                });
                break;
        }
    });
}

mkdirP.sync = function sync (p, mode, made) {
    var path = nodeRequire('path');
    var fs = nodeRequire('fs');
    if (mode === undefined) {
        mode = 0x1FF & (~process.umask());
    }
    if (!made) made = null;

    if (typeof mode === 'string') mode = parseInt(mode, 8);
    p = path.resolve(p);

    try {
        fs.mkdirSync(p, mode);
        made = made || p;
    }
    catch (err0) {
        switch (err0.code) {
            case 'ENOENT' :
                made = sync(path.dirname(p), mode, made);
                sync(p, mode, made);
                break;

            // In the case of any other error, just see if there's a dir
            // there already.  If so, then hooray!  If not, then something
            // is borked.
            default:
                var stat;
                try {
                    stat = fs.statSync(p);
                }
                catch (err1) {
                    throw err0;
                }
                if (!stat.isDirectory()) throw err0;
                break;
        }
    }

    return made;
};

module.exports = mkdirP.mkdirp = mkdirP.mkdirP = mkdirP;

},{}]},{},["D:\\ksana2015\\jiangkangyurtoc\\index.js"])
//# sourceMappingURL=bundle.js.map
